[
  {
    "post_id":"360rvv",
    "title":"So the lawer broke my heart... [update from yesterday's post]",
    "body":"I posted yesterday about my possible custody case.  I had a lot of great encouragement, and advice.  I went to the lawer this morning before work.  He said I had a good case for establishing 50\/50 at least.  He said we could file for no contest since she probably won't be able to get a lawyer.  He said we could get visitation rights established within a week.  Then he told me my group legal would only cover 15% of the cost.  He told me the longer I wait, the harder it will be.  I can't even afford to drive to see him every week, let alone afford the lawer.  I had a panic attack at work,  cried in front of everyone.  I'm crying right now.  How do you guys do it?  How do some of you deal with a hole in your very soul? I'm just so scared and I don't know why."
  },
  {
    "post_id":"yrfx4l",
    "title":"Depressed Dads and Fun Withdrawal",
    "body":"I'm sure this has been brought up before, but I don't feel like reading old threads. Mostly, I just wanted to type this out as a form of therapy and see if anyone relates.\n\nHow many of you fathers out there find yourselves feeling low after stretches of particular fun times?\n\nI have recently been feeling very down after the passing of Halloween. It is a favorite holiday for our family. Returning to our normal routines has felt like a drag and I have struggled in engaging with my wife and daughters (3,1) for the past two weeks.\n\nI have noticed similar patterns after family vacations, birthdays, other holidays, or unplanned joyful days. It typically goes away with the next fun event, and with the holidays approaching, I am looking forward to breaking out of my funk. I've only been able to describe it to my wife as \"fun withdrawal\", where the fun times feel like an escape from our normal routines, not the norm. \n\nCan anyone relate? Any tips?"
  },
  {
    "post_id":"1fuzehg",
    "title":"Worst thing you’ve said to your partner",
    "body":"So I already know I’m in an abusive relationship, unfortunately for many reasons one I cannot leave at this time. I’m just starting to somewhat normalize this behavior and it’s really bringing me down. Just curious what the worst thing you’ve said\/say in a fight with your partner is. I’ve asked multiple female friends if their partner has ever told them to STFU and they insist no but like I said, it’s just starting to feel like it’s normal. Let a mama know"
  },
  {
    "post_id":"7v7slu",
    "title":"Newly graduated, baby is having difficulty breastfeeding, fights against Mom, days and nights swapped, something isn’t working",
    "body":"Dads I need help! \n\nMy wife is having a hard time getting our 4 day old string bean to breastfeed. She will make hunger cues, sticking tongue out, suckling hands, rooting with her mouth, but when she is placed next to a nipple\/boob (both football and cross over positions) she will either suck a little while poorly latched, hurting my wife, then start screaming or she will just scream and push away, yet scream and make hunger cues. We know she is hungry because it’ll be 2-3 hours between attempts.  We’ve resorted to pumping and using a super low flow nipple bottle so we know she’s getting fed because she cries so much when trying to latch, my decision because I’d rather know she is fed.\n\nWe were in hospital for 3 days due to c section and we had lactation visit us, but every time they came she latched almost perfectly, and at for 20minutes. Except the last time as I was away packing car up the lactation nurse was thinking of keep us there another day then squirt finally latched. When they weren’t there, it was a struggle as it is now at home! She’s like the reversed Michigan j frog. \n\nDuring hospital stay bean would spit up during the night, she would finally fall asleep, but then nurses would come make her mad and then leave 😡. Leaving my poor wife stay up with her to try and feed, whenever I tried to hold her she’d start making feeding cues but would proceed to cry, fight and push away from Mom! Doesn’t help that daughter didn’t poop until we got her home, although she did have a big one during labor, then she had 2 back to back. \n\nAdd in that she has her days and night switched and will sleep during the day with occasional cries that stop the nap attempt and then at night she will not sleep anywhere else but in someone’s arms. \n\nMy questions are numerous so thanks in advance for any help:\n\n1. Baby won’t latch even trying the lip tease, expressing milk, etc. she makes hunger cues but fights at the nipple, will get a nipple shield today **what else can I do to help, I refuse to feel helpless while my wife cries?** (she already gets overwhelmed emotionally just like her mother, add in a huge estrogen dump and it’s brutal)\n\n2. What else can we try to get her to latch? She knows she’s hungry, she knows she needs something in her mouth, but when she gets it she screams with a nipple in her mouth and pushes away!\n\n3. Nights and days swapped, won’t sleep in bassinet only sleeps when held at night (naturally angled), spit ups. Is this possible signs of reflux? \n\n4. Why does she let out sudden cries when sleeping and sometimes a simple shhhh shhhh will soothe her? \n\n5. I decided to give her the bottle of pumped milk, it was either that or she starve. My wife tried pumping this morning and only got like 1oz from each side, should I start researching formula? \n\n6. Should we increase how often we just try to feed her? Sort of feeding before she really makes the motions?\n\n\nThanks again \/r\/daddit, I hope my sleep deprived state came across well, any other tips will be greatly appreciated!"
  },
  {
    "post_id":"1bax5uo",
    "title":"Does everyone experience that feeling like you just don't have what it takes?",
    "body":"I recently quit my job to try and work freelance and be more supportive for my son&wife.\n\nMy wife was really struggling with me working full time in the job I was in. I've always dreamed of going out on my own. So seemed like the right thing to do.\n\nBut I don't know if I'm just having a bad day or what but im really struggling right now... Which is maybe the worst time for it as I'm needed more than ever to get up and running at get money flowing back into our accounts.\n\nMy 5 month old son won't be out down for more than a few minutes at a time. He has to sleep with someone there and feed all night. Rarely if ever sleeps for more than 2 hours and naps for no more than 30\/40 mins. I loose my temper soo much his fussing noises just make me soo uncomfortable I can't stand it."
  },
  {
    "post_id":"z180c6",
    "title":"Dad depression\/anxiety after the birth",
    "body":"Hi Dad's, looking for some advice. Baby is a week old now and I've been feeling really negative thoughts (constantly worrying about SIDS). The birth was quite traumatic as she got stuck on the way out and the suction cup didn't work. Baby came out unconscious. She's come to very quickly and everything is okay now. Very alert and happy baby. Wife had to have two cuts to help with the whole process and she's healing fine now. \n\nBasically wanted to know if anyone else has felt this way after the birth and if it's normal or if I need to get some help. TYIA"
  },
  {
    "post_id":"1cftc44",
    "title":"My mother in law spanked my daughter (3Y10M)--my wife and I are resolutely against physical punishment.",
    "body":"TLDR; my daughter had a tantrum while I was at work and my MIL lost control and spanked her even though my wife and I are resolutely anti-corporal punishment. \n\nLately my little girl, I’ll call her E (3Y10M), has become a full-fledged 'threenager.' I posted a while back about my wife worrying about her having a mental condition, but she’s just a willful and stubborn soon-to-be four year old. We’ve adapted to her tantrums and we’ve been figuring out how to redirect her or letting her cool off depending on the degree of tantrum. We’ve been making headway, but grandma is not along for the ride. \n\nMy MIL--who has lived with us since we all got shut in together during COVID--has been getting more and more aggressive with E as she goes through this new phase. My MIL's limited patience has given way to shouting, calling E names and even openly swearing in front of her. My wife has tried her best to get her mom to cut the bullshit, and to get her to take some time away from the house. Frankly, the only reason I haven’t kicked her to the curb myself is because my wife insists that she needs her mom’s help around the house. \n\nWell, last night I was on duty to watch study hall until 10:00 PM (very normal for teachers at boarding schools in our country). My wife messages me that E has been being a pain in the ass that night. Later she tells me that E had a bath but is going into tantrum mode, doesn’t want to put on her pants or underwear and is rolling around on the hard wood floors saying she doesn’t want to be clean. That is clearly an awful situation and I wish I were at home to deal with it. Before I can even type a response message, my wife tells me that my mother in law--who has been told countless times that we are vehemently against physical punishment--bent E over and spanked her. Afterward my wife took E into the bedroom and locked the door. \n\nI won’t go into a play by play of how our conversation went or how her conversation with her mom went. I want to throw this horrible woman out on her ass, but my wife has asked me to let her deal with it. My MIL says that she is beside herself with regret and admits that she lost control and says it will never happen again. My wife and MIL took her out of preschool so that grandma can ‘make it up to E’ today by taking her to the play place and buying her some toys. \n\nHere’s the deal though; she lost control. The very fact that she used that language shows me that if she is allowed to watch my daughter any more then there will always be a risk of this happening again. Also the ‘making it up to E’ strikes me as the kind of behavior a domestic abuser would display--you know, apologizing and suddenly behaving like a saint after clocking their partner. I am almost certain that if she stays in the house then this will happen again, but my wife says I need to have more faith in her and her family. \n\nSo here’s my rock and a hard place: I want this woman out of my house immediately for the safety and welfare of my daughter, but my wife has specifically asked me to let her handle it. She is handling it by giving her mom a second chance, which sees me worried that my daughter will experience more of this kind of what I would frankly call abuse and my wife and I will see more casual disregard for our parenting ethics.\n\nHow do I navigate this? Has anyone had any similar experience?"
  },
  {
    "post_id":"lx0h44",
    "title":"Stay at home dad.. Help",
    "body":"I was wondering if there was any stay at home dads that could help me, my partner will be starting work soon and i will be left with my 5 month old girl alone all day. Im stressing of the thought of having no time for myself. When she's awake she gets bored really quickly so i have to walk around, i dont mind this but all day is gonna kill me. When she takes a nap its max 30 minutes. What do you do to keep your baby's occupied so you can have just 5 minutes to yourself?"
  },
  {
    "post_id":"dw9su0",
    "title":"Am I alone in thinking this sucks at least 60% of the time?",
    "body":"So much of this sub is sunshine and rainbows,  makes me feel ashamed to admit that most of the time having a little one is not fun. Cooking, cleaning, shelling out money we didn’t budget for, the list goes on. Don’t get me wrong, the milestones are incredible, first laugh, first steps, I love my son, But is fatherhood really the #blessed experience that everyone else is experiencing? Am I the only one grinning and bearing it, choking down occasional feelings of regret? After 1.5 years, still no matter how many books I read or toys I bring home, I still can’t compete for a second with a boob full of milk. Sometimes I think they’d be better off without me around."
  },
  {
    "post_id":"14id1db",
    "title":"I want to kill myself, after watching my cousins father daughter dance",
    "body":"My dad died thanksgiving day 2021 after a battle with cancer that started when I was in 4th grade.\n\nTonight my cousin got married. I watch his new wife have her first dance with her dad and just completely fucking broke down. I’ll never get a fucking first Dance, hell, my dad didn’t even make it to my 21st. Im so fucking sad I’m so fucking angry I just want to swallow all the pills I have and die. I don’t know why I won’t, I’m afraid of failing and waking up in a hospital somewhere. If “heaven” (I think it’s fucking bullshit, personally) is so amazing, then why can’t I join my dad up there?\n\nWhile my cousin got married and watched his wife have her first dance with her dad, I just doubled over the box of ashes I know as “dad.”\n\nI can’t do this anymore. I’m sobbing in my bed, I’ve already fought with my mom, she’s no fucking emotional support. What did I possibly do to deserve any of this. I try my best to be a good person, and I end up without a dad after my 19th birthday. We were born the same weeek. My birthday will never be the same. I just want to die."
  },
  {
    "post_id":"5kn4su",
    "title":"will the resentment go away?",
    "body":"I always wanted to have a baby. Now i have one and the affection i felt for her faded away in two months. She cries 7\/24. Not just simply crying but shrieking. Every interaction with her results in this. She screams before, during, after diaper change, before and after feeding. Only time she is not crying is when she is feeding. The total time she smiled at us in two months is maybe 30 mins in total. The rest was trashing, crying, screaming and shrieking. I visited a friend and couldnt believe that they put their 1 month old in babasling. When we tried that she had such a fit that i thought she was going to pass out. I feel guilty all the time because of this but i really want to do nothing with her since she does nothing but scream. When i take care of her its because i have to. Everything is ok with her, her mothers milk is enough etc. I am not asking for advice. I just want to learn when she hopefully gets better will the resentment go away?"
  },
  {
    "post_id":"18f761k",
    "title":"Are there days anyone else hates being a dad?",
    "body":"I work full time my wife works nights…usually we have the responsibilities split reasonably well but when she gets busy at work she just kind of excuses herself from some of her responsibilities.\n\nNormally she…\nGets him up in the morning\nFeeds, and changes him\nTakes him to school\nDoes the laundry \n\nI..\nPick him up \nFeed him dinner\nBathe him\nDeal with bedtime\nDo the dishes\nBasically just be the parent by myself 5 nights a week\n\nThis week well the last few weeks really…I’ve done nearly everything by myself on my wife’s days off she has changed maybe one diaper. All I wanted to do this weekend was put the ornaments on the tree…no help. I get that she’s tired but I’ve been tired since Halloween. I’m tired of feeling like I’m raising my son without support. While my wife spends all her time wrapped up on Facebook and work drama. She got upset last night because she suggested a vacation I tossed out some ideas and she wasn’t sure those would be good places to have a baby…then got upset again when I said I wanted a vacation without the kid. My wife wants more kids…I want help with the one we have now. \n\n\nI’m just so completely fucking over it right now. I feel like asking for a few hours a week for her to actually be responsible for the kid isn’t that big of a deal…even when I get the time it still gets used for chores. Am I being ridiculous I’m tired of my wife acting like I’m high or have a sick growing out of my forehead when I ask for a little support. Someone help me out here I’m at my wits end.\n\nOn mobile and watching the kid so sorry for weird formatting or anything."
  },
  {
    "post_id":"18epjpq",
    "title":"Zoloft and Dad Life",
    "body":"Hey dad's, I'm wondering if anyone else can share their experience using Zoloft or other SSRIs while being a dad to younger kids.\n\nI've struggled with mental health my entire teen\/adult life, but the past 6 months have been particularly bad, culminating with me ending up in the hospital after self harming. 12 staples in my leg later I left the hospital with a Sertraline (generic Zoloft) prescription.\n\nI took an SSRI over a decade ago for a few months but stopped after the side effects outweighed the benefits.\n\nI've been fairly averse to medication since then, and I'm really nervous starting up on antidepressants again. 4 days in and the startup side affects are kicking my ass.\n\nWould appreciate and positive experience stories or tips fellow dad's can give me."
  },
  {
    "post_id":"1dpdfxj",
    "title":"Girlfriend bailed out ",
    "body":"Well dad's, while i was at work on Monday my girlfriend packed her things and left. I was caught really off guard and after some digging I saw how terrible she had been talking about me behind my back to her friends, family, etc. I asked her what happened and she told me she didn't feel appreciated for the work she did, and didn't feel like she could come to me for help with housework. The latter is absolutely not true, I consistently told her I would help her if she asked. The former, well, that is absolutely on me. I should've showed more appreciation to the work she puts in the house. \n\nFor reference we are both military, buy I run a side business which keeps me fairly occupied at home, and then I have my daughter every other week. My daughter has been the hardest part of this. She keeps asking when she's coming home. If she's at home yet. Why isn't she home. She's 2. My girlfriend was her best friend. What do I even tell her? \n\nHer frustrations were valid but the talking about me behind my back, and lying to my face about it...don't know dad's. I'm hurt by this one. Just the night prior she had asked me if I saw a future with her, and my answer was of course I do. I thought it had made her happy but maybe the smile was more of an \"I know something you don't know\" smile. I get that I fucked up, but I wish she would've just voiced her frustrations to me instead of bailing on me like this.\n\nNow my bills are going to be more taxing, groceries will be harder, rent, everything, all in the midst of me paying off loans and cc bills that I racked up paying for a lawyer to win split custody of my daughter. I cried my eyes out when I got home and all of her things were gone, but I know I can't show this in front of my kid. She's counting on me to be superman, especially with her mom and I already split, I can't let her see this kind of thing. \n\nI think I'm just done dating. I can't keep introducing women into my life, for them to leave. When my daughter is old enough to understand it will break her. And no, I didn't start dating this girl and just immediately introduce her. It was months before that happened. \n\nI'm so tired, and stressed, and I don't know how to keep my head above water on this one. What do I do, dads?"
  },
  {
    "post_id":"17q3nle",
    "title":"I'm asking a pretty tough question here. How and when do my wife and I know if it's time for adoption.",
    "body":"My wife is struggling with severe anxiety, I am not doing any better either. Our daughter is 15 days and we are both struggling so much. We had the MIL come in for a night of relief but that didn't change anything. I really want the best life for my daughter and at this point I know she is not getting it. I have a therapist appointment this week, plus I am going to visit my doctor. I am trying to take the steps I can to get better but I'm just not sure what to do. My wife and I were so in love before this and we've both said so many times that we miss each other through these first few weeks..Has anybody gone through this process before. I will add that our daughter is a pretty decent kid, she wakes everynight around 3 hours, she's a bit fussy all through the day but all in all she's not a crying horrible child. That's what's making me think that maybe we aren't the best parents for her. I've read a lot of messages on this site and I know some might come at me hard for thinking this way but I'm just not sure about this."
  },
  {
    "post_id":"hmrfav",
    "title":"Tips on staying calm?",
    "body":"I'm a first time dad with a 4 month old. She's early teething and has been for a few weeks. She has times where she screams and I have to wear earplugs just to keep myself from escalating. I have a hard enough time with her while she screams so I end up handing her over to my wife. Anytime she cries, no matter the reason, it spikes my anxiety and stress levels. My wife and I did plan for this baby so it's not like she unwanted. Coming home from work on Monday she was fine. that's what my mother (who was at my house when I got home) and wife said. She got a little fussy, but she was tired and I ended up laying her down for a nap. Later that evening I was trying to feed her and she kept pushing the bottle away. She usually does that as I think she's trying to hold the bottle herself and isn't very good at it so I kept trying to feed her, ended up stoping, I was getting frustrated. She was pulling at her gums so my wife said get a cold binky from the fridge. Long story short, I got really frustrated, had to hand my daughter over to my  wife and she had a hard time getting her to calm down, we ended up giving her some baby ibuprofen. She calmed down after that. \n\nLater in the night my wife and I argued while putting our baby to bed. Now she thinks I don't love her or the baby and I should \"leave.\" This is hard to put in writing the morning after a fight, I have to leave for work soon and I don't want to come home again to have another argument. I didn't realize this First time dad thing would be so hard. I need some help. My wife feels like a single mom."
  },
  {
    "post_id":"4lizu9",
    "title":"Made a huge mistake today and now I feel awful",
    "body":"Long story short, my wife and I both thought the other was watching our two year old daughter and she ended up in serious danger.  My wife was looking for something in the backyard and I was inside when she asked where she was - when I couldn't see her inside, we started to panic, and started tearing around looking for her.  I ended up finding her about three minutes later when I looked in front of our house (she never is allowed out there) and I saw someone pull to a stop, get out of their car, and start pointing.  She had wandered half-way down the block and was headed for the corner to (we think) go to the park we always visit.  Another minute and she would have probably been around the corner and out of sight.\n\nWe're counting our blessings that she was okay but it terrifies me to think that she could have gotten into the road, picked up by someone, or who knows what.  I know there is nothing I can do other than move on and be more diligent and aware in the future, but this incident has left me felling like an awful parent.  She means more to us than life itself and to know that we allowed her to walk into such a dangerous situation makes me sick.\n\nAny advice from others who have had similar experiences would be greatly appreciated; this is our first incident like this and I'm not really sure how to handle\/process it."
  },
  {
    "post_id":"x21gzz",
    "title":"Wife's Insomnia Destroying our Family",
    "body":"We are really, really struggling. My wife has had horrible insomnia for a long time now, feels like since our 2nd child was born over a year ago (3yr boy, 1yr girl), but it's gotten so bad now. She doesn't get any restful sleep. By 3pm she's completely drained, by 6:30 when she gets home (she's burning herself out at work), she's barely lucid. Maybe twice a week she's able to hold it together long enough to help get the kids fed and in bed by 8pm, but her personality, her ability to function at work, or interact with me or the family, has deteriorated so badly and so rapidly, I honestly fear every day coming home. \n\nAt best she's so out of it that she just passes out on the couch at 6:30. or it might be another night of hell, with me being told everyone hates me, that the kids hate me, that I'm a horrible human being and a liar about everything, even though she can't articulate what I'm lying about. A couple times it's gotten so bad I've had to lock the kids and myself in the bathroom, giving the kids a bath to drown out her screaming at me. Even worse is the fear that she will lie and manipulate those around us to try and take the kids from me.  \n\nI know this isn't my wife. When she's lucid she knows she's sick, she loves our family and wants to get better. This evil has entered her brain and taken root. It's killing her. The worst fear is getting the call that she's been in a wreck or hurt herself in some way, that I will have to explain to our children why Mommy isn't here anymore.\n\nTonight I literally begged, pleaded, yelled and screamed, cried, tried to to everything in my power to get her to agree to get in the car so we could go to urgent care, see a doctor, try to get something just to help her sleep for one night. It's a $75 co-pay with our insurance, they were open, and the kids were at her parents. Just to try and take a step to getting better. She, or rather the evil within her, refused. Wasn't willing to see a doctor to try and feel better tonight.\n\nThis is her pain, her illness, and these are her choices. But I can't deny she isn't the only one being affected by this. I've struggled with my own anxiety and depression, and have sought help for that. I can feel that I've gotten better. She could have chosen to seek help tonight. She wouldn't, said she was afraid. Her toxicity, her words and her behavior scare me. It hurts her, hurts me, hurts our family, and I need my wife back. My kids need their mom. I want to save my family. I don't know what to do."
  },
  {
    "post_id":"1ghabix",
    "title":"Life feels incredibly overwhelming right now. I really need to let this out.",
    "body":"I’m a dad of two (3rd is loading), and I’m stressed, tired, and anxious about the future.\n\nTwo years ago, we made the tough decision to migrate (somewhere in north America) in search of better opportunities, leaving behind everything we knew. Back in my home country, there simply weren’t any paths forward for us, and now, I find myself questioning if we’ve made the right choice.\n\nMy day starts at 5 AM with a grueling 50 km drive to work back n forth with the traffic and all, where I’m on the clock from 6 AM to 4:30 PM. After a long day when I finally walk through our door, I dive straight into cooking dinner and preparing lunches for my kids, my wife, and myself for the next day. I let my wife, who is pregnant with our third child, manages the kids’ baths and bedtime routine, giving them the attention they crave while I tackle the evening chores. It’s a delicate balance, but I often find myself wrapped up in tasks until 9:30 or 10 PM, sometimes later if something unexpected comes up. I sleep average 6-7hrs a day.\n\nWe’re both feeling the weight of financial strain. My wife works part-time to help cover daycare and other expenses, I can’t afford to miss a day of work. I’m falling behind on payments, barely scraping by with just the minimums. I’m grateful that I can max out my overtime to keep up with bills, but it’s disheartening that rent and utilities consume about 60% of my monthly salary. Despite my efforts, it feels like we’re running in place, unable to catch up.\n\nIn my alone time, the anxiety and sadness hit me like a wave. I find myself going into my kids’ room just to lay down beside them, hugging and kissing them while they sleep. It breaks my heart to realize how often I’ve missed being fully present in their lives. They wake up without me and go to bed without me, and on a good day, I get to spend less than 4hrs with them. But even then, I’m busy with chores, and I’m not giving them my full attention. I constantly worry about the future and whether I’m doing enough. I wish I could provide them with the best life possible, but right now, it feels utterly impossible.\n\nI’ve thought about starting a journal to capture all these feelings, but I also feel like I need to vent to someone to hear words of encouragement that is why I am writing here. I know I’m not alone in this struggle, but it’s incredibly heavy on my heart. Thank you for letting me share. I’d really appreciate any support or advice from those who can relate. Your words could make a difference."
  },
  {
    "post_id":"wtftnj",
    "title":"physical job, NEED SLEEP...",
    "body":"This is my first time posting here... So I just wanted to put this out there for opinions to see if I'm asking for to much or being unreasonable?\n\nSo I'm a dad of three, one 3yr old and two 5 week old twins. It's been a massive shock to the system trying to adjust... We always just wanted 2 kids but it is what it is. \n\nI am a self employed gardener and do everything myself, it's hard work at the best of times. Mowing, hedge trimming, strimming and clearing, digging borders, bagging waste etc etc... I can easily do 10,000 steps a day. \n\nAs you can imagine, sleep is pretty non-existent at the moment.. multiple feeds, wakes and all that fun stuff. Our 3yr old still isn't a great sleeper as he suffers with night terrors. \n\nThe absolute hardest thing for me is the sleep deprivation... It's the worst I've ever experienced (borderline delusional at times) I have had days off work because of it, and the day's I'm working it pretty much doesn't even feel safe to drive let alone use machinery and all the rest.. I've actually never been good on little sleep, some people seem to be able to cope better than others I find.\n\nAnyway... I've said to my wife about needed more sleep for work, I suggested the spare room and offered to help out in other ways as much as I can.. the problem is we're butting heads as she says she absolutely cannot do the nights alone. Don't get me wrong I feel guilty suggesting in the first place but I'm basically on my knees with exhaustion and we can't seem to meet in the middle unfortunately.\n\nShe is a \"stay at home mum\" for now at least. And I'm in no way saying that it's easier but in my opinion having such a physical job and the added financial pressure of being self employed really isn't easy."
  },
  {
    "post_id":"j2dxw1",
    "title":"Struggling New Dad - Possible Paternal PPD",
    "body":"I am new to Daddit. As a new dad of just 5 days, I never even thought to look for an online community for dads before.\n\nMy wife and I just had our first baby 5 days ago, a beautiful little girl. I am extremely excited about her being in the world and have been looking forward to this for the last 9 months. My wife and I are amazingly in love with one another. We work very hard for one another and with one another. We have, what I feel like, is just about the most perfect relationship any couple could have. Adding a new player to our team just felt like the right step and we are both excited to have finally made it here.\n\nDespite all that, I feel like I am crumbling under the weight of expectations and responsibility to be the unflinching pillar of strength in our family. These expectations do not come from my wife or either of our families. They're all from me. \n\nThis is kind of a rough summary of all of the things that I'm feeling and all of the things that I don't even know what I'm feeling. I'm not very good with emotions. I don't really understand them. I don't really connect with them or through them. I do know that I am feeling a lot of something and this is the best I can really articulate them. I just feel like I'm not enough and that I'm failing or going to fail.\n\nIt's been a slow build since our baby was born. We spent 4 nights in the hospital and, while it was very overwhelming, there was a sense of comfort in the form of the nursing staff as a safety net. They were absolutely amazing! They did so much for us. We could really tell they were a group of people who absolutely love what they do. But once we left the hospital and were on our own, all that responsibility that they were helping with was now ours and it is heavy, to say the least.\n\nMy wife and I both fight with depression. Her more so than myself. She is just killing it right now, though. She's an amazing machine with our daughter and she doesn't flinch at anything. I am trying very hard to do the same and putting on a brave face but I am crumbling. I am scared I will mess something up. I am very clumsy. I'm scared of failing. Failing my wife and failing my daughter. I've always been a bit of a failure through most of my life.\n\nI consider myself to be pretty self-aware. I'm very analytical of myself. The things I do, think, say, feel (when I can figure them out). I am a bit of an over analyzer at times, even. But because of that, I can see the signs and they seem to check just about every box of post-partum depression. I didn't even know dads could have PPD until my wife mentioned it to me. She is aware of what I'm going through and is very supportive. It helps but this just isn't going away with simple recognition. \n\nI have read several posts and stories online and they all just kind of point at it going away over time, but I'm not sure if I have the mental or emotional fortitude to wait that long. It's been 5 days and every time my daughter cries, I want to as well. I get scared at every cough and sniffle or noise she makes. Especially at night. Not scared that something is wrong with her, but scared that I'm going to have to get up when I just laid down to get some rest. Scared that I won't sleep that night. Scared that the stress of all of this is going to utterly crush me.\n\nI'm not really sure exactly what I'm looking for out of this post. I flaired it as advice request but I think I may have just needed to get this off my chest. I think maybe I'm curious to see if there are others out there who are going through this, or have gone through this, also.\n\nI absolutely love my daughter. She is a tremendous joy and I wouldn't ever want to bail on her or my wife. I am excited to hold her and to take care of her every day. But I still feel like I'm drowning in all of this. Maybe that's the hardest part. Why do I love her so much but feel this way at the same time?"
  },
  {
    "post_id":"wusu8k",
    "title":"Trying to find the time to recharge",
    "body":"Got a 8 month old daughter, and she is doing great. Got a wife that’s a great mom. All good.\n\nI got a job, had it for about 10 months now. It’s in a management position, which was\/is new and the job is very stressful for me. Long days, often weekends. Wife has no work, daycare costs more than she makes.\n\nOur family lives far away, so no grandparents babysitting etc.\n\nI need to be alone to recharge. Almost never happens these days. I can’t not help or do something if I hear her crying and my wife struggling. \n\nGoing crazy. I feel guilty for wanting to be alone or when I take time for myself, because I’m already away from home so much. Feel like I’m failing as a dad. \n\nPlease give me some words of encouragement. I need it. Crying in the restroom at work on a Monday morning.\n\nAnybody else feel like this? Or been there? What did you do to turn it around?"
  },
  {
    "post_id":"18uzw2h",
    "title":"MIL gave my baby an unknown medication.",
    "body":"We have two boys, 6 and 34 months. We lean pretty heavily on my in-laws for baby sitting and stop-gap childcare: In addition to baby-sitting as-required, Eldest spends Monday and Wednesday nights at their home after preschool (at in-laws' request). They love him immensely and spoil him, which is kinda their job as grandparents IMO. They don't do everything the way we would, and sometimes I worry that too much time there is creating more difficulties for us in the long run, but in general it's a pill I can swallow.\n\nTonight they were babysitting at our place so we could have dinner with a friend. I had already put Eldest to bed, so once my wife had fed Youngest, they just had to get him to sleep, and call us if anything went sideways in the next 2.5h.\n\nWe got home from dinner and MIL informed us that Youngest had been very fussy before sleep. He is teething, and she is aware. Administering baby Tylenol\/Advil to Youngest has been immensely difficult, so we didn't bother to leave any out for them to give him. This didn't stop MIL from raiding our medicine cabinet to find some Tylenol for him.\n\n\"Ok. How much did you give him?\" asks my wife, an ER Doctor.\n\n\"Just a few drops in this spoon\" says MIL, showing the spoon and the bottle of *topical oral anesthetic (lidocaine)* she took from our medicine cabinet!\n\nHere's the rub, daddit: They did not read the label to see it was not Tylenol or acetaminophen or Advil or ibuprofen (the bottle was very clearly labelled as \"topical oral anesthetic\" ie, not Tylenol). They did not read the warnings on the label clearly stating that it can affect the swallowing reflex in children and not to use it for teething relief for babies. They did not measure out any kind of calculated dose. In essence, they grabbed the first bottle of red syrup they saw and put as much of it as seemed reasonable to them into the mouth of our 6 month old baby.\n\nFor those wondering (as I obviously was), there was no immediate cause for alarm. Youngest is fine; the amount given to our son was not harmful.\n\nBut what if it had been?\n\nThe way I see it, MIL endangered our baby son's life tonight. That could have been any one of thousands of pharmacological compounds that could have harmed him. They could have tried to give him more than they did. He could have gotten really sick. Or worse. I'm livid. I'm dumbfounded they would do something so jaw-droppingly stupid as to administer an unmeasured dose of an unknown medication to an infant -- our baby -- without even so much as texting us first.\n\nMy in-laws were out the door before I could even comprehend what happened (they are Romanian and don't always speak English, so I don't always get the whole picture right away), let alone process it.\n\nWe have every intention of having a very frank and stern conversation with them about this. My feeling is that we can't trust them alone with either of my boys again unless they acknowledge the gravity of that decision and sincerely apologize. My wife feels similarly. Problem is, we have a lot of reason to expect they won't respond so reasonably. If they don't, we lose the immeasurable support they've been providing. That will strain our collective sanity, our wallets, and I'm sure our marriage as well.\n\nHow would you feel, and what would you do if you were in my shoes, daddit?"
  },
  {
    "post_id":"1gnreqe",
    "title":"I feel like a constant failure at night",
    "body":"FTD to a 2 week old boy. Love him to death, but i am struggling really hard during the nights. \n\nI use to see posts of dad's expressing their frustration, anxiety, and stress about their newborns, and I'd think to myself, \"can't be THAT bad.\" .... Oh boy, was I wrong!\n\nI'm at the point now that I get super irritated at this poor, helpless baby boy when he cries at night. More so at the fact of NOT KNOWING what to do after we have checked all the boxes (fed, diaper, burp, etc.). I have even said the whole, \"we may have made a mistake\" thing to my wife and few times. Even though I don't truly mean it. \n\nEvery night, I tell myself that tonight I will do better when he wakes us up screaming and won't settle down. No matter what. And I seem to always fail by getting frustrated. I feel incredibly low and like I'm letting down my son and my wife.... \n\nFor those who have gone through this, I could really use some advice it even words of encouragement cause... damn... being a dad is way tougher than I thought. "
  },
  {
    "post_id":"244rdn",
    "title":"Just got told to choose between my Unborn son and my wife. Any advice with coping?",
    "body":"Just got told to choose between my unborn son and wife.  If I choose my wife, my son will die.  If I choose my son, my wife could end up needing a hysterectomy or worse yet, she could die.  I already know what choice I have to make.  Has anyone else here made this choice?  How'd you cope?  What did you do for your wife?"
  },
  {
    "post_id":"1az17a2",
    "title":"Wife is refusing to go to counselling. 7 month old at home. I'm about to call it quits.",
    "body":"Hello Daddit,\n\nIt's me again with my monthly relationship crisis. I'm actually sorry to burden you with my negative relationship issues but I really appreciate the support and feedback that I get here. You can look at my post history for more background info. I'll try to focus on my main issue to avoid making this too long. \n\nI've been with my wife for 2.5 years now. We fell in love and got serious quickly. However she also got more and more controlling but I didn't realize the extent of the issue. She often gets angry, yells, and sometimes make threats when I disagree with her. Because of that, we usually arnt able to resolve disagreements calmly without hurt feelings. \n\nWe fight very often, recently it's just her getting angry at me. She's done a few things now that have violated my boundaries and our relationship such as making major family decisions without adequate consultation and making threats about our relationship. I'm not saying I've done nothing wrong but I feel that the magnitude of our wrongs are very different. \n\nI regrettably haven't been able to bond with our son. It's partly my fault but I put a lot of blame on her for not supporting our father-son relationship. She criticizes me unfairly and takes him out of my arms whenever he starts crying. I wasn't even allowed to take him to a nearby park to meet my mother whom she doesn't like. \n\nI've been asking for marriage counselling for over 4 months now. She's agreed but keeps delaying with different excuses. I've been going to individual counselling in the meanwhile. Now after our last fight, she says she wants a 'break' where we don't discuss our relationship issues or child care differences for 3 months and that she is not willing to go to relationship counselling.\n\nI've only managed to last this long in the hopes of repairing our relationship and to avoid abandoning her. However, this refusal to attend counselling is unacceptable to me. I'm preparing to leave in a couple days. I feel guilty about leaving my son but my in-laws are living with us so my wife and son will be well supported. I will also continue to support by doing things that they might struggle with. \n\nI don't have anything specific to ask of you but I would like feedback anyways. Thank you very much for all of your support up until now. \n"
  },
  {
    "post_id":"8jlxn8",
    "title":"Is it supposed to be this hard?",
    "body":"Hello, I got my subscription to this sub on May 4th and since then it’s been one struggle after another.  We’re breastfeeding and it just doesn’t seem to be going right all though my son is putting on plenty of weight. He cries, all the time. Inconsolable crying that goes on and on and on. We’ve tried winding and walking and music and car rides and pram walks and Infacol. He just doesn’t stop. Today he started crying at 0500 and the only time he stopped between then and now (1530) is when he was on the boob. \n\nOur midwife keeps saying it will get easier and that things will calm down but it just doesn’t seem that way at all and to top it all off my wife is now showing signs of mastitis. \n\nHow did you guys cope?? "
  },
  {
    "post_id":"msv55k",
    "title":"1 Month old daughter not sleeping. Wife is going crazy. We have tried everything we can think of.",
    "body":"So for the first 2 weeks or so my daughter slept pretty well. She would go to sleep around midnight, wake up for a bottle and diaper around 3, then again around 6. My wife and I would each take 1 shift and it worked out pretty well. Now she has decided to not sleep at all. She will lay there screaming and crying not matter what. She will be fed and have a fresh diaper but she will still cry. We have tried swaddling, sleep sack thing, crib, bassinet, Boppee pillow thing, bouncy, swing, laying on our bed and nothing works. She doesn't have a fever and we cant find anything else that could be wrong with her.\n\n\nMy wife is going crazy, now that I am going back to work she has to deal with the majority of it. I try to help, but she is so stressed all the time that it ends up with her just yelling at me to go to bed so I can get some sleep before work. I think my wife slept like maybe an hour and a half last night and now has to deal with the kids while im working today. She gets extreme guilt if she goes to take a nap while I watch the kids to the point where she can't even sleep. So she doesn't get much \"me time\". I suggested she use my noise cancelling headphones but she doesn't really want to do that.\n\n\nOur first son did not have any problems like this, he would sleep all the time, only getting up every 3 or 4 hours at night. He was in his own crib and room by a few months old sleeping through the night.\n\n\nWhat do we do? Trying to save my wife's sanity."
  },
  {
    "post_id":"3zihw9",
    "title":"Freaking out",
    "body":"I know you guys probably get posts like this a bunch, but I'm freaking out.\n\nMy wife and I are expecting our first baby, a girl, on January 15th....\n\nThat's next week. I feel like I'm having anxiety attacks. Every time I think about it, my stomach feels queasy and I get scared. \n\nI'm terrified of having a baby, and I'm overwhelmed about my wife going into labor.\n\nI'm excited too. But I just am so overwhelmed with everything. I'm sure this is absolutely normal...right?"
  },
  {
    "post_id":"1gf2mgh",
    "title":"Anyone have autistic kids and wife? ",
    "body":"I don’t know how to even start this. no one knows how difficult and frustrating this situation is. My ability to be around and having to walk on egg shells with things that I say around my family. I because of the autism in my family my feelings and emotions are always out on the back burner. I feel like I am never emotionally invested in the family anymore. And this leads to my frustrations being pushed down and sometimes I lash out with a temper. \n\nI am a very open minded person and have very strong opinions on things when it comes to the world around us. With all the shit that is going on currently. \n\nI work part time (previously worked fully time) to care for my wife who was last year diagnosed with a rare autoimmune disease. I cook. I clean. I wash clothes. Clean the house. Fold Laundry. Hang laundry. I cook everyone’s meals and my own. Which as a dad of 2 is fine. But there are times when the balance is way off. If I am struggling mentally with the pressures of life and work. There is no room for me to safely or emotionally handle my own thoughts. \n\nI am constantly nagged at by my wife. Nothing I do ever feels like I have done the right thing it’s always wrong according to the wife. I had a pretty terrible mother who engrained a terrible sense of shit self esteem in me from a very young age, and in turn this makes it difficult for me to express my emotions in a healthy manner sometimes. \n\nI’m holding that some other dad on here may have a similar experience with this?? "
  },
  {
    "post_id":"10ztpcj",
    "title":"I’m afraid.",
    "body":"So a little background. I’m a dad to a beautiful 3yo daughter and a 2 yo son. He turned 2 last month and my daughter will be 4 in June. \n\nFor almost a year now I’ve been scared of the future. Not because my daughter eventually has lovers that need to be taken care of. My son getting in a fight or whatever. No, I’m scared because I don’t know if my daughter will get to her 4th birthday. Or my sons 3 January next year. Hell will I be alive to see 32 in November? All because some idiot wants a war some 1600km from here and he’s been threatening with Nuclear War. I know to much, I know what the world will look like if that (hopefully unlikely) scenario will come to pass. This has me close to a mental  breakdown. I’ve never felt something like this. At times it’s making me wish I never had children. I’ve thought about things no dad should have to think about. \n\nAm I overreacting? I can’t be the only one can I?\n\nEDIT:\n\nI want to thank you all for the great advice you’ve given me. I’ll try and seek someone out to talk to and maybe getting head more level and less on the doomthinking."
  },
  {
    "post_id":"4escbk",
    "title":"Advice needed, please. I feel like I'm ruining my relationship with my kids.",
    "body":"This is from a throwaway account because…well, fuck, I’m just not proud of who I am. I don’t know if this is the right place to ask such advice but, under my normal account, I occasionally lurk here to see all the happy, proud dads and I’m envious. I’m not naïve, I know it’s not all going to be good times and smiles but bad moods, being overwhelmed, anger, and exploding at my kids seem to happen more than the good times. I apologize if this is disjointed or long but part of me just wants to get it out and maybe the details will help with any advice anyone can give. My kids are about to turn five and two and I thought, when my oldest was born, that patience would come with time and experience, like a callous. It hasn’t. Patience has never been my strong suit. In the past I’ve occasionally responded by throwing things and lashing out explosively, though never physically on a person. I’m not proud of that at all but have never known just how to control it. When I had children, I promised to stop reacting like that and have done better, especially in front of them, but not nearly well enough. I’ve also had problems with descending into dark, angry moods. It used to happen every few weeks or months, though now it feels like the norm, four or five days out of the week and usually building up throughout the day. It’s not an excuse but I think it has to do with my ADD. I don’t multitask well because every piece of information coming in gets flagged as important but *not* multitasking is impossible with two children, a wife, life, job, etc. Many days I start off fine, happy, optimistic even, but as the day goes on it gets worse. Thinking and concentrating become harder, like I'm in a deepening fog. I liken it to a room full of people, first one or two are talking, then more, then more, until the din is so loud I have to concentrate heavily to get a solid thought finished or a task accomplished. The feeling of being overwhelmed leads to anger and bad moods. It’s usually then that my patience is shortest and I explode at my kids by yelling at them. Sometimes for legit reasons but usually it could be handled much differently. Because it’s what I’ve experienced, I’ve always believed in limited spanking or corporal punishment but have never used it “responsibly”. I want to believe that I’m not physically abusive but I feel like I’m borderline and have, shamefully, crossed that line a few times. So maybe the term “borderline” is just self denial. I’ve slapped each of them twice in their lives and each has been triggered by them screaming in my face. I don’t know why that effects me the way it does but it’s a noise I can’t stand and I’d do almost anything to make stop. Many times, during their screaming fits, I’ve been able to keep it under control, but those few times, I failed. More often, I’ve just treated them roughly, jerking or moving them harder than I should have. A few days ago, the three of us were on a playground when my son did something to his sister that prompted me to ask him nicely to apologize to her and he refused. I calmly asked him twice more and finally followed it up with, “if you can’t do that then we need to go home.” He recently has seen The Peanut’s Movie and picked up the term Blockhead, and so he responded to me, “No we’re not, you Blockhead!” I saw red, grabbed him by the wrist, and yanked him out of the alcove he was in so hard it lifted a 42 pound kid off his feet, hitting his other wrist against a bar pretty hard. I jerked him to his feet and stormed to the car with both kids wailing and other parents looking on. As with the other incidents, I’m ashamed of myself. I hate myself for it and wish I had the balls to tell someone my own size so they could treat me accordingly. I deserve that. But here’s the thing, and I wouldn’t believe me if I’d just read that either, but I love my kids with all my heart. I love my son’s imagination and the random things he says from nowhere. He’s so observant, misses nothing, and is so incredibly curious. He will ask questions nonstop for hours and it’s fascinating to watch his understanding of the world develop. He’s my little drama queen and prone to meltdowns but I’ve always loved the bond he and I have had since before he was born. I read to him every night that I could when he was in the womb and minutes after he was born, he was under the heat lamp squalling away, when I came over, looked down at him, and said his name. He immediately stopped crying and began looking around for me. He already knew me, my voice. As long as I live, I will never forget that or stop cherishing that moment. I have genuine tears in my eyes as I say that. Thanks to their mother, both our kids are beautiful but my daughter is one of the most adorable little girls I’ve ever seen, with her mom’s looks and my wavy, curly hair. She’s so independent but so loving and cuddly. When she belly laughs, she purrs at the end and it melts my heart. Until recently, she’s been the opposite of her brother, very easy going and relaxed compared to his drama. She sleeps on my shoulder frequently and my arm could be on fire from holding her weight so long and I still love just having her there. They still love me, run to me when I come home or pick them up, and I..."
  },
  {
    "post_id":"13l7b75",
    "title":"\"You need to make time for yourself\"",
    "body":"For context, I'm a dad to a wonderful 2 year old girl and I love it. Also relevant -I have struggled with chronic depression my entire life.\n\nI have been told the titular phrase more times than I can count- by my therapist, by the fellas in my men's group, by my parents and extended family, even by my wife. \"You need to make time for yourself so you can be at your best for your daughter\". And every time someone says that to me, I get more and more frustrated. \n\nToday will mark the third session of my men's mental health group in a row that I will have to miss because my wife Is having a hard time mentally right now, and watching the kiddo from 7am-8pm straight is just not going to happen. Normally, grandma takes the kiddo on Thursdays to take pressure off mom, and so I can do the mental health work with my group that has been so helpful. Well, grandma has flaked out 4 weeks running with stupid excuses. \n\nAt this point my trust in ANYONE that says they can or will help my family out is at absolute rock bottom. \"Oh sure, we'd love to watch *daughter's name* any time!\". Yeah, sure. I've done this song and dance plenty- we'll schedule a time with you, the day will come and there's always a fucking reason why it can't happen. Our kiddo is not hard to watch- she's the best behaved 2 year old I've ever met. This is just people who you thought were reliable pretending they want to help and finding reasons not to.\n\n\nSo when should I make time for myself to take care of my mental health? My wife and daughter need me, and I'm going to be there for them. That is my job, and that is more important than anything else, even my own sanity. The next person tells me to take time for myself is  getting a hearty laugh and two middle fingers in their face. \n\nRant aside, I'm sure quite a few of you fellas have felt stuck in a situation like this- any advice or words of wisdom would definitely be appreciated, I'm kind of out of ideas at this point. Just never expected to be so disappointed by so many people so much of the time."
  },
  {
    "post_id":"kmsc3r",
    "title":"Expecting again after loss",
    "body":"Hello fellow dads!\n\nWe found out we're pregnant again this week after miscarrying over the summer. We also have a 2-year-old little boy. Our baby is due in late September, and the one we lost would have been due in May.\n\nFor those of you who haven't experienced it, miscarriage is difficult. I find myself crying and grieving even now, months after our loss.\n\nI know that it's something that just happens, and that nothing we could have done would have prevented it. I'm not seeking validation, just cataloguing my grief.\n\nWhat I did not expect was the news of a second pregnancy to shake me like it has. I'm hopeful and excited and happy, but I'm also terrified of losing this one too. It's brought back the grief over the baby we lost, made it fresh again. And for whatever reason, the knowledge that this baby would not have existed if our last one had survived makes me feel... almost guilty.\n\nAnyway, would love to hear from fellow dads who've lost babies. And prayers and positive vibes for an uneventful full-term pregnancy resulting in a healthy infant would be stellar."
  },
  {
    "post_id":"121riqv",
    "title":"I don’t know what to do",
    "body":"My kid just freaked out when I picked her up and started hitting me in the face. This isn’t the first time she has freaked out or the first time she has hit me in the face. She’s close to 3 now. She has always been more drawn to her mom and it’s not like this all the time but she only does it to me. \n\nRight now my MIL is here and it’s always worse when she’s staying with us. My daughter loves my MIL. She helped us out for the first 8 months of my daughters life because we both work, so she is very close with her grandma. \n\nThe problem is I hate this woman. Absolutely hate her. My daughter would not exist if she had gotten her way 10+ years ago. She tried repeatedly to break us up. She and my FIL would not give their blessing when I asked to marry their daughter and went no contact for a year trying to pressure my wife into choosing them over me. \n\nSo it’s extra hard to see my daughter unconditionally love my MIL while I’m getting hit in the face. I don’t know what I did wrong. I don’t know why my daughter is so mean to me. My wife is so confused as well. \n\nIt breaks my heart though. I love this girl more than life itself and when she does this it makes me extremely depressed. \n\nHelp me dads. I’m feeling very lost and crushed right now."
  }
]