[
  {
    "post_id":"h0bm67",
    "title":"I lost a friend yesterday because he was posting that biological sex is essential, and now I’m feeling very confused and alone",
    "body":"First time posting here but I’ve just been really struggling with this. I’m an AMAB nb, I came out to most of my friends about a year ago. My friend from high school, who has been my best friend for a long time, was posting in defense of JK Rowling and basically mimicking her views on biological sex etc. This isn’t the first time he’s expressed this, he knows I’m nb, and basically just won’t accept that it’s transphobic because he “hold[s] no hate in his heart for trans people, but think[s] gender identity and physical sex are different.” I told him he was being stubborn and ignorant and he said that he isn’t sure he can be friends with someone who sees him that way. \n\nIt just sucks really bad. He and I play games together constantly and it’s long been my main source of relaxation, and we’ve been friends for 10 years. He made me feel like it’s my fault for being so ideological or rigid, but I’m really hurt by all his bullshit. I don’t know if I’m asking for advice or sympathy, but I’m so depressed I just don’t know what to do or how to feel. Sorry for the long post or if I used the wrong tag"
  },
  {
    "post_id":"n7pnb2",
    "title":"Am I non-binary?",
    "body":"I'm 28, assigned female at birth, and never had a problem with that. I was raised in a very religious town, and I had barely heard the word \"gay\" before high school. I'd certainly never heard of trans, non-binary, or any other gender identity. Then my best friend came out as trans when we were in our early twenties, and I started reading up on it. I brought up to my boyfriend (now fiancé) that I thought I might be agender. He essentially laughed and said \"no, you're not\".\n\nI put it away. I was happy with my body. I was happy presenting as female, though tomboy-ish. I still am. But lately, I've been feeling extremely uncomfortable with the word \"woman\". I don't know how to explain it, other than that it feels wrong. It doesn't feel like me. But female pronouns feel okay, which just makes me more confused.\n\nI'm looking for some insight, I guess. How did you know you were non-binary? What does it feel like for you? Does my experience make sense?"
  },
  {
    "post_id":"t3hvto",
    "title":"Have you been told by your parents that you are \"abusive\" or \"insulting them\" by changing your name\/pronouns?",
    "body":"Kind of a rant, I'm afab and go by he\/him and a different name than my birth name. I HATE my birth name and I have expressed this to my parents, at first in the softest way possible. I have been kind and forgiving about coming out, but my family has stated that they flat out refuse to use my name and pronouns. They have called me \"mentally ill\", blamed my age for \"making me want to cope with trauma by changing my name\". They basically think it's a coping strategy, something the internet has convinced me to do, etc. It is so hurtful and annoying and honestly I don't even want to see them anymore. They deadname me and use the wrong pronouns. When I came out, my father told me I would have to \"choose between my bullshit name\" or essentially \"reject my mother and abandon the relationship completely\". Basically they gave me two choices: continue to use my deadname, or reject my family and use my new name. I was accused of being abusive and selfish for \"rejecting the name they spent so much time choosing\". They accused me of rejecting my family as well. It just honestly sucks. I feel like a jerk for continuing to use my preferred name, they've even told me that if they hear others referring to me as my preferred name, they will take all of my belongings away. Am I a jerk for insisting that others use my pronouns? Should I be more forgiving to my parents?"
  },
  {
    "post_id":"12lutug",
    "title":"Seriously reconsidering name change",
    "body":"(transmasc enby, he\/they)\n\nI’ve been using Roro as my name for over a year (initially it was just a nickname I used on the internet but I liked it too much). I truly wanted to make it my legal name, even though it’s not popular: there’s no info on it on Behind the Name, the only few examples are from Indonesia, and in my country (Poland) no one has it as the legal name.\n\nMoreover, I feel like it’s not treated seriously at all. My mother, when I came out to her in February, asked if I’m “living in some hecking anime”. I feel like people feel weird using it and would rather stick to my deadname. My paranoia and anxiety only keeps kicking in because I feel like people don’t take me seriously when I tell them my name. That’s why I’ve been considering name change, to something more “acceptable” and less “weird”.\n\nOn one hand, this feels like a safe option and this way, for example, I’d find it easier to introduce myself, without exposing myself to weirded out reactions. I think it’d also be easier to change my name if I pick something more popular and something that is more in use. But on the other hand, my partner really likes calling me Roro, and I suppose it’d be hard for them to change their habit.\n\nI’m feeling worse and worse each day, I have no idea what to do. I can also send my pics in comments if that helps."
  },
  {
    "post_id":"t07acv",
    "title":"Has anyone here ever had the experience of NOT always knowing they were non-binary?",
    "body":"I'm not really sure where to start with this question... \n\nI'm over 30 years old and have, for the most part, always been comfortable with my assigned at birth gender (m).  I also feel like I've had an incredibly present feminine side that I love about myself. I'm very self conscious about expressing it though because of how much unwanted attention it usually gets (for instance, I really like the way I look with more feminine styled clothes\/earrings\/etc). Most of the unwanted attention is usually pretty harmless but leaves me feeling like I have to explain myself.  And here's the thing - I just don't even know where to begin so I do whats easy and just conform to presenting as male.\n\nFor most of my life I didn't really know much about issues surrounding gender and sexuality.  I have a penis and *mostly* like women which seemed pretty normal and expected of me, so I just never questioned my identity beyond straight-male. I didn't know I could be anything other than \"straight-male\" or \"gay-male\" or \"trans-women\".  Out of the three, straight-male seemed to fit the best, but definitely not a perfect fit... Growing up, there was always people reminding me to not wear certain things because \"those are for girls\/women\", or making comments about how \"I'm sexually male, but intellectually female\" (whatever that even means).       \n\nThere's things I genuinely like about being male, but I feel like presenting completely as male paints an incomplete portrait of who I am in my heart.  I find myself wishing the people around me would just reject my gender completely but don't know how to even begin asking that of people who have known me my whole life. How do I ask my partner to do that after being together for 10 years? I don't want people to see me as a woman, because I'm not, but I also don't feel like I always relate to being a man.  \n\nI guess my question is - am I non binary if I mostly want to reject gender identity but still embrace things I like about my assigned at birth gender? Can I be born male and use they\/he pronouns? Is gender even real?\n\ntl;dr not sure if I'm nonbinary or just a guy with feminine thoughts... or maybe we're all just people? Any advice or wisdom would be appreciated."
  },
  {
    "post_id":"faice6",
    "title":"Therapist advice",
    "body":"So I’m a high schooler, and I’ve been wanting to go to therapy to try to make some sense of my gender (and a couple other things) but my mother will only set up the appointment if I tell her why I want to go. And I get that, therapy’s expensive, but I’m in the closet and I don’t want to tell her about the other mental stuff. She has a bad track record of taking anything I tell her I feel and making it seem either invalid or blown out of proportion or both. Any advice?"
  },
  {
    "post_id":"ftpa3m",
    "title":"I feel like such a faker",
    "body":"I have been questioning my identity for a while now. I think I’m non-binary, but I’m hella confused. I was AFAB and have a strong interesting in looking more masculine in the future (when I’m in my own). I don’t any dysphoria, but I feel like I would be so much happier living with a more masculine appearance and not having to be just a woman or just a guy. \n  \n    I started watching a trans guy YouTube channel for advice and knowledge about things like binding and T. I am not transgender but I wanted to look more\/feel more masculine. I’m hoping to get top surgery\/ start T in the future. I was really enjoying these videos until I got to one about a Transmasculine non-binary person on Instagram. \n   \n   I have always had such a strong fear that I was just doing it “for attention” or to “be special”. Even though I have told nobody, and my parents would kill me if they ever found out. \n     \n   So I’m watching the video and the YouTuber starts saying thing like  “You HAVE to have dysphoria to transition, or else you’re just doing it for literally no reason.” “Why would you EVER change your gender and go through these things if you didn’t have significant distress with your body.” Everyone in the comments and in the video we’re making fun of them saying that transmasculine is not real, like you’re either trans or you’re cis.\n  \nI was heart broken after hearing this. All my fear of faking it and doing it for attention came back. I had to stop watching because of how upset I got. I feel even more confused now.\n \nI don’t understand why I can’t just be happy as just a girl or at least have a clear answer on who I want to be. Why I keep wanting to change myself even when I don’t have dysphoria. I just think I would be happier appearing more masculine. \nDoes anyone else feel like this? Any advice would be greatly appreciated."
  },
  {
    "post_id":"fknj18",
    "title":"What would you choose?",
    "body":"I live in New York City and my family lives upstate. I’m currently having a hard time deciding whether to stay here or go, since we might be enacting essentially a lockdown of the city. Our state governor is currently against that idea, but that also might change at any time.\n\nI live independently in my own apartment as a grad student. I don’t mind being here by myself. I’m actually enjoying it, really. I’m allowed to work from home and have been doing so, so I have a steady income so far.\n\nI’d feel horrible if I decide to stay here and not go though. My mom worries a lot, and I know she’d want me to go stay with her and my family.  I love my mom and my sisters and I do miss them and I know they miss me too. Problem is that they are the only ones that honestly call me by my pronouns and actual name. It doesn’t matter to my stepdad or extended family on his side. Everyone misgenders me and deadnames me constantly even though I’ve been out for 6 years. They are very conservative and are trump supporters, so I’m terrified to defend myself any time they start talking about anything trans related. I’m honestly tired of being expected to hide how I’m feeling by allowing people to treat me poorly just to make them more comfortable. Hell, my uncle even told my little sister (she’s 7) right in front of me that gender and sex are the same thing and that people who think differently are wrong as if he was trying to teach her to hate me. It’s not like I barely see these people: we are constantly around them. Even being home for a week for holidays just makes me feel like absolute garbage.\n\nBefore I’d just ignore it and try not to let it get to me personally. I’m tired of it though. It just makes me feel awful and sad and hurt because these people obviously don’t love or care about me enough to even call me the right name. I used to struggle with depression and anxiety and I have finally gotten to a good place about six months ago. I don’t want to start feeling that way again just because I’d be forced to be around people like that. I haven’t even told them I’m nonbinary. I only discovered that less than a year ago, since I used to think I was trans. I’m never going to tell them I’m nonbinary because getting the binary trans thing is already this difficult. I don’t want to make things worse. \n\nSo I guess, what would you decide? Would you stay in New York City to keep yourself happy, or would you go stay with family upstate to avoid a potential lockdown and to make your mom happy?"
  },
  {
    "post_id":"19e6fnn",
    "title":"had to leave my job today because hr refused to stop deadnaming me",
    "body":"i (27AFAB) am pretty inconsolable right now. long story short, kept getting deadnamed at work despite putting my preferred name on my app. kept correcting everyone but kept getting the \"whoops, it slipped\". decided to talk to HR because it's been two days and i was so tired of being triggered left and right. \n\nverbatim, this was HR's assistant manager on the subject: \n\n\"If you want people to call you something else then change your legal name. People can call you whatever they want to despite you telling them otherwise.\" \n\ni was completely fucking floored. baffled. this isn't my first job by far. it's NEVER been an issue. she said \"it's your legal name, company policy, i can't help you.\" \n\ni told her it's never been an issue before at any other workplaces and she shrugged her shoulders. i said \"what's the point of there being a preferred name on the application if you don't use it?\"\n\nshe looked so BLANK. as if SHE was shocked. i felt like i was in the fucking twilight zone or an episode of black mirror. what the fuck? she was like, \"i don't know. i don't know why we have that on there. you can tell people what you want to be called but they dont have to call you that.\"\n\ni just cut the convo off and stormed off. later, once i'd collected myself i decided to get a hold of the HEAD of HR, thinking that what she told me couldn't POSSIBLY be company policy. literally on my first day in orientation they had an entire segment about inclusivity, sensitivity, gender, pronouns, sexual orientation, etc. \n\nwell. the head of HR doubled down. adding, \"well, your legal name is (so and so). if someone calls you that, you WILL answer to it.\" \n\nI saw fucking RED. i could not breathe. i hung up on her, had a panic attack that still hasn't quite dissipated. i don't think there's anything else i can do, but i'm so hurt and embarrassed. i can't stop crying. i'm so scared to apply for another job because this HR department has honestly traumatized me. i'm so scared of this happening again at another place. i don't know what to do."
  },
  {
    "post_id":"7lz2w9",
    "title":"Any NBs get dysphoric being on T for too long?",
    "body":"I'm 1.5 years on T and post top surgery and I'm pretty happy with my appearence and voice as it is. I wanna stop T or at least go on a super low dose. But I'm holding off because I need to make a decision apropos of my eventual hysterectomy.\n\nBut just the thought of becoming MORE masculine is panic inducing in me and triggers intense dysphoria. I almost don't want to go outside because I'm afraid I'm too much of a man. I'm not a man I just kinda look like one and in filled with fear that I'm going to be on it too long and be too far transitioned."
  },
  {
    "post_id":"1dkl1yw",
    "title":"Would it be hard to get breast reduction?",
    "body":"I have like, a b cup so they're already pretty small, but having breasts makes me wanna kms so I want them to go down to an A or a B. I'm 18 btw."
  },
  {
    "post_id":"hr1sjd",
    "title":"I’m Struggling.",
    "body":"I’m pretty certain I’m nonbinary, but as a highly analytical and sciencey person I’m struggling with a 24\/7 argument in my head trying to find concrete proof of the fact. Has anyone else been through this and gotten through it? Could you give any tips of how I can stop the internal debate and accept it? On another unrelated topic- how long after you realised you were nonbinary did you come out? Any response to any of this is massively appreciated because this is really quite awful x"
  },
  {
    "post_id":"1d1f9io",
    "title":"I was assaulted today and I'm scared for the future (TW: sexual harassment)",
    "body":"I came out as a trans man at 13. I always knew I was nonbinary, but I tried to come at as bigender early in my social transition, and everyone rejected me. I was androgynous before T because of untreated PCOS, so I never had a huge issue passing as male if I put a little effort in. I've been harassed and abused by partners and people who know I'm trans, but I didn't get much flak from random cis men because they used to think I'm one of them, unless they think I'm gay. Even then, it's never been this bad.\n\nEvery time I've presented as anything but a typical cis guy, I get relentlessly baraged with harassment. I don't know why. Most of them seem to want to have sex with me. I presented more femininely from 16-17 and got hit on by my dad's male friends, as well as by totally random older men. I have now officially come out as nonbinary and am dressing how I want. I already have a very distinctive appearance that I cannot change, and I have added hair dye and new clothes with different cuts and accessories to my look. I don't look or sound like a cis woman. I love my appearance now, and I'm having so much fun, but people look at me more than I want. I'm not sure if they think I'm a butch woman, a feminine man, a trans woman, or a trans man, but they know I'm queer. I've thought about making myself look masculine again, or at least dress casual, but I don't want to! I would be so sad.\n\nI had a date with a woman scheduled today. I was taking the bus, and a big guy sat beside me even though there were lots of seats. He reeked. Not of B.O., but of the same smell (?) as other people who have harassed me. He said a lot of homophobic, sexual things and pushed me. He shoved his hands in my face, and I grabbed his phone (he was trying to write slurs on his Notes app and show me) and threw it across the bus. The driver made him stand, but didn't kick him off. He kept talking about me and calling me Satanic (already got Calvinist Guilt, so thanks?), and the other people told him to shut up. He still kept going. \n\nI'm safe. I went to a café I'm familiar with, and they let me hide. There were these two very muscular people who stayed until I got into my Uber. My friends have all rallied around me.But I'm shaken and sad. I feel like giving up. I want to look how I want, but I feel like all the horrible people see me as a target. I live in a very progressive area, but I'm scared now, just as I was when I've been followed or threatened years before. I feel like I can never escape. If I don't dress in jeans and a T-shirt or something like that, I get followed and harassed and assaulted. It feels like I can't even go to my favorite fried chicken place without being stalked by scary people, or walk down the street without men calling out to me.\n\nIs there any light at the end of the tunnel? I feel awful. I feel like I'll never be safe from sexual harassment and assault as long as I live. Can I never be androgynous and happy?"
  },
  {
    "post_id":"vzrkxy",
    "title":"Depressed after starting T",
    "body":"I’m gonna talk to my doctor about this if things don’t improve\/get worse but checking in here first to see what others have experienced. \nI started taking T and am on 2.5 g of gel, 1%. I feel more grounded(?) in my body and really am looking forward to some physical changes and mild voice deepening. Today is my 6th day and the first day I felt calm, but after that I’ve been depressed. Not like I wanna not be alive depressed but like unmotivated, crying spells, etc. Depression isn’t new to me but I don’t like feeling like this.  I’m wondering if maybe my dose is too high? Or I just need to wait it out and let my levels settle? I told my doctor I wanted to go slow and wanted a more androgynous\/non-binary transition instead of ftm and this is the dose he prescribed. I’m trying to wait things out because it hasn’t even been a week but ugh, it’s difficult because I don’t have any people in my life to support me through this. Anyone relate or have any helpful information?\n\nEdit: Thank you everyone for the advice\/support. I had a gyno appointment today and luckily the doctor I saw was super trans friendly and let me know I could take half the gel or take it every other day or work out something else with my doc. It was super helpful to learn that this process is gonna look different for everyone and I can work with my doc to sort this out. I’m gonna reach out to my doc about that and lowering things a bit and I’m starting therapy next week so hopefully all that’ll help. Gonna leave this post up in case it helps anyone."
  },
  {
    "post_id":"18vchav",
    "title":"My partner came out as non-binary and I’m struggling to accept it.",
    "body":"I’m a cis female married to my partner AMAB for 4 years. When we got married they identified as a male. I grew up in a high demand religion that teaches there are only 2 genders and is quite homophobic and transphobic. 2 years in my partner came out as Bi to me then now another year later non-binary. I felt I tried to adopt their pronouns and tried to picture how this new relationship would work but in my gut feel uncomfortable with it. I feel pretty uncomfortable when they experiment with dresses and makeup and appear more feminine. But I see how happy they are and they’re a new person in a good way- which makes me really happy for them. But they’re also a new person. We went to counseling together and counselors said it’s ok if you’re straight and the relationship doesn’t work for you but I’m having a really hard time accepting that as truth. I’ve been trying for 10 months to shake this feeling of discomfort, don’t get me wrong, I could have done things a lot better but I felt like I was holding them back and hurting them because I’ve had this thought that a queer relationship doesn’t work for me, that now we’ve been separated for about 3 weeks. I feel terrible and unsatisfied because I feel like the relationship itself didn’t necessarily change and was going well.  Now I’m torn. Is it possible that I can challenge myself and this “off” feeling, this feeling of discomfort can go away? I love my partner with all my heart but I also feel like everyone around me doesn’t want me to give myself up for the relationship. Would that be considered giving up my own identity to make it work? I’m just feeling really heartbroken and stuck."
  },
  {
    "post_id":"9gjjrz",
    "title":"I don’t think I’ll ever be happy being me",
    "body":"Ever since I realised I was nb, I’ve been ridiculed and misunderstood both on and offline. Afterwards I just said I’m a trans guy, because I’m afab and leaning to masculine, and then the criticism came from the trans community itself (was part of a fb support group who bashed me for not hating my body parts).\nI wanna look more masculine, I’m constantly seen as a girl and it hurts. I don’t know where I’m going with this post, honestly, I just feel alone and sometimes I’m just not sure if it’s worth it.   \n  \nAnyone feel similar? Or just wants to talk? :\/"
  },
  {
    "post_id":"lq3588",
    "title":"I'm just scared",
    "body":"I was gonna make a different post but I couldn't get myself to even type it. Even getting this one out is hard. I'm only out to 2 people that I know because I'm scared people aren't going to believe me or are gonna just tell me I couldn't be because of how I look(I guess I'm conventionally attractive by some standard, I don't see it,) so of course I couldn't be unhappy with my gender identity. I hate being seen as a cishet man and I don't want to seem that way everywhere I go but I'm just terrified, but since I've started calling myself non binary I've never been happier with anything I've been called. I don't know if all of this is just really circular logic but I'm just scared. Does anyone have any advice or anything? I don't want to just hide forever."
  },
  {
    "post_id":"ae7gsu",
    "title":"How do you know who you are?",
    "body":"Hi my name is Giovanni I’m new to this so forgive me if I get any terminology wrong. I’m not sure where to begin but I feel lost and I’m hoping I can find my way with your guidance. I was legally born male but I don’t feel that title fits who I am. So far in my self discovery I feel I’m in the middle which I find bothersome because I’m not feminine or masculine i guess I’m some what androgynous. For some that might be okay but I feel stress and anxiety because I have to balance two lives. Before I would try and lean to my masculine side and I felt like I wasn’t true to myself and lately I’ve begun exploring my feminine side wearing makeup and I feel pretty comfortable like this. I feel people generally have had positive vibes about it and it feels amazing because I don’t feel like I’m trying to do anything except be myself. I still have masculine features about me but I feel they both make up who I am. What does that make me though? I’m feminine I like men so am I gay or non binary? It’s all so confusing and I’m not 100% where I want to be . It’s really complex I’m trying to be as brief as possible help please :\/. I’ve thought to myself what my life would be as a woman and part of me feels I’d be happy. I’m kinda comfortable having my “man bits” though and I don’t have major body dysphoria. That could be because I learned to kinda just accept myself because I don’t have the features I wish I had or the money to fix it. What does that make me? I kinda feel I could be trans but how do you know for sure? Please help, I constantly feel lost and ask my boyfriend “how do you know who you are? Sometimes I don’t know."
  },
  {
    "post_id":"tcucu9",
    "title":"Advice on head shaving",
    "body":"Trigger warning: depression and anxiety\n\nI really want to shave my head because having hair doesn’t feel like it matches my gender identity and because I have depression which makes me not able to muster enough energy to wash it every week but my family member won’t let me and keeps forcing me to get it washed. They told me “I don’t think you’d want that” when I told Them before as if they lives a day in my life. I’m scared of getting in trouble but I want to do this because I want to live life the way I want to and not live how others want me to. It is about 50% the causes of my daily depression episodes and s word thoughts (I’m not gonna do it so please don’t send me the s word hotline number) and anxiety but I told my family member I wanted to shave my head because I didn’t feel like doing it, which should be a valid enough reason you shouldn’t have to do something you don’t want to that’ll not effect your life in anyway your hair doesn’t pay your bills, get you to work everyday or feed your family so why is it so important to some people to force this on them? I know they only does this to me because I’m AFAB and if I was AMAB they’d probably buy me a razor and do it for me. I was thinking of doing it as an impulse one day but I still get anxiety thinking about it doing it and the only razor I have is a shick intuition women’s razor. What should I do? I need this so much."
  },
  {
    "post_id":"192udka",
    "title":"I feel like my partner has different expectations and ideas of what non-binary means than me?",
    "body":"I've been seeing a friend of mine for a few months. It's been going alright, but there is something that keeps irritating me:\n\nOn several occasions my partner has by default adressed me in ways you would adress a person who is the binary gender that is not my AGAB. When my partner makes me compliments, the compliments are gendered, again stereotypical compliments for the gender that is not my AGAB. \n\nEven sex has changed. While we were trying many different things in the beginning and spent a lot of time cuddling, my partner now asks specific acts from me. Those acts require me to take on a rather clear-cut role. I emulate body parts that I currently do not have. That in itself would be fine, but it kind of breaks my heart to see my partner get more pleasure out of that, than out of everything else we did before.\n\nIt feels like my partner is imagining me as a gender I am not. I am non-binary. I feel like I have a bit of all genders in me, and none at the same time. To me, non-binary does **not** mean \"the mind has binary transitioned, but the body hasn't\" or something in that order. Right now it feels like my partner treats me as \\[opposite of my AGAB\\] in the body of an \\[AGAB\\].\n\nLast week we had a small disagreement. My partner wanted to cut my hair sometime soon. But I changed my mind about it. Hairdressing is kind of a big deal for me (I'm autistic and have sensory issues with my hair). I've only had another person cut my hair once in the last 11 years. And when my partner said that I needed a more \"non-binary\" haircut, I didn't feel like it anymore. To me \"non-binary\" is not a specific look and I don't like the idea that I have to look a certain way to be seen as my gender.\n\nAnother potential problem is that my partner's friend group doesn't accept my identity. My partner is binary trans and so is most of the friendgroup. My partner told me that the friends misgender me when I'm out of earshot. And that one of the friends disliked me at first, because I \"looked too basic\" and they assumed I must be binary trans based on that. Some of them use non-binary as a label for \"non-passing\" binary trans people.\n\nI like my partner and there are many good things happening between us. But all of this is ringing my alarm bells and starting to stress me out. I tried talking about it, but it was kind of brushed off with a general \"But you know I accept you the way you are, right?\". I do have a hard time articulating what I need. But it becomes even harder to do that, when there is already an assumption in place that I need to counter.\n\nCan someone here understand this? Am I being too much in my own head? I'd really appreciate any outside perspective, but it already helped writing all of this down."
  },
  {
    "post_id":"6agc96",
    "title":"Am I nonbinary if I want to be conventionally attractive by feminine standards?",
    "body":"Honest preface: my gender and sexual identities are things that I try not to think about or recognize because I really don't want to be \"different\" and I wonder if I'm just trying to stick extra labels on myself since I already have a number of mental illnesses. I'm also afraid my MIs (CPTSD and BPD) are making me think I relate to identities that I'm actually not.\n\nI wrote a long post somewhere else but got insecure and took it down so here's kind of a brief summary... I'm afab and like (androgynous leaning) female fashion, makeup, etc. I desperately want to be considered conventionally attractive.\n\nI also (maybe because of my lifelong abuse and trauma) never felt like I fit in with other girls or women. Sometimes I feel like cis women are living a totally different life than I am (except maybe rn I'm just being a whiny cis woman lol if so I apologize.) I've never really had a close female friend. Whenever I'm around other women\/female friends I feel uncomfortable and like I'm missing something and don't work properly as a \"woman\". Oh, and I don't really feel comfortable applying the words \"woman\" or \"girl\" to myself. I hate having \"good girl\" said to me but I like \"good boy\". When I have stuffed animals I always call them by male pronouns.\n\nBut I don't really feel like a guy either. I was neglected by my father, bullied by my brother and abused by an older man. I'm afraid of men. But my closest friends in life (ie the people I've felt most comfortable around) have been androgynous or feminine leaning men.  \n\nI used to say I wouldn't mind being reborn as a boy but now I don't really feel much of either. It would be really nice if the world suddenly became genderless and everyone were somewhere in between, because those are the people I'm most comfortable around. I wouldn't feel comfortable asking for non-gendered pronouns but I think it'd be nice if they were just implemented for everyone. \n\nI definitely feel like I'm in my own awkward not-real-woman corner, just a person. I definitely don't want to identify as \"both man and woman\", more like neither. Except I still like feminine (somewhat, more androgynous is better) fashion, makeup, and care a lot about becoming \"prettier\". \n\nWhat am I? If the answer is just a cis woman who needs to stfu, please let me know gently. I'm also a victim of intense lifelong child abuse which may be giving me the confusion but that means I have trouble handling the idea of people being angry at me. Thanks for your patience. "
  },
  {
    "post_id":"8cnbln",
    "title":"Confidence help (pls push me off this cliff)",
    "body":"Hey y'all, I have been IDing as nb for about 4 years now, but done nothing but suffer for it. I have in another tab the contact info for a gender specialist, and I KNOW I should call them, the HRT would help me immensly, but I am absolutely terrified. The only people in my life who know are my friends and my fiancé. I really need some positive words to help me get over this cliff and actually call them for the appointment and start on the road to looking like how I feel!"
  },
  {
    "post_id":"1bfmnlw",
    "title":"NEED HELPS: How do I (AFAB) know I \"actually\" have a chest dysphoria",
    "body":"Warning: Gender dysphoria, CSA\n\nI'm really confused lately and I need advice from other people who have been in a similar situation or have chest dysphoria. For context, I've only come to realize that I'm non-binary for about 4-5 months but I've always known that I don't feel aligned at all with binary gender since I was a child. Coming to terms with my gender identity is one of the happiest moments in my life and helps me grow as an individual. But as I become more and more acquainted with myself, I figure out that I may have chest dysphoria. \n\nI've recently only come to my senses of body image and body sensation because due to my past trauma of being sexual abused as a child, I dissociated with my body all the time, like it is not even there. My mental health has improved significantly from last year, giving me the chance to finally look into who I am and who I want to become. Physically presented, I lean toward the masculine side (I love having a buff and masculine body, my shoulders are wide compared to my body frame as well) and dressing androgynously but my chests always destroy that image, it stands out like a sore thumb and looking at myself in the mirror makes me feel dysphoric. I've always fancied a more man-like body to myself with a muscular chest and not the female breast and sometimes I feel so hard to breathe knowing my actual body doesn't match up to it.\n\nI've talked with my mom about this problem, she told me that whatever decision I make regarding the removal of my breasts, she will support me. But now I know I have the choice to go through surgery, I become horrified of the possibility. What if I regret it? We are talking about cutting off a part of the body. What if afterward I suffer the dysphoria in a different way and I can never take back the decision I make? These thoughts keep me up at night and I feel so suffocated. \n\nThere are moments I just know I will be better off without these breasts, when I put on my T-shirt looking at my broad shoulders when I want to be shirtless at the beach. I've already ordered a binder to see how things will go from then but I'm still really confused and scared. Can anyone give me any advice or willing to talk more about this? Should I inform my GP about this (I'm an international student studying in the UK)? \n\nThanks in advance"
  },
  {
    "post_id":"1aunkkb",
    "title":"Am I non binary or just traumatized?",
    "body":"For me, puberty was the beginning of a pretty severe existential crisis, and said puberty started really early. I already had hair and breasts at 7 or 8 and I got my period at 8 or 9. But that alone is probably a good reason to feel strange and uncomfortable with your own physique at that age. What is certain is that I tried as hard as I could for as long as I could to ignore all physical developments and hide them later. My mum always described it that way, it's in my doctor's letter from my first hospitalisation (I think I was 12 \/ 13 then) and I'm regularly asked about my pronouns very unexpectedly and randomly (which doesn't necessarily mean anything at first). But I have the feeling that I only have a partnership of convenience with my body and am only forced to accept it. But I don't think I'm \"suffering\" either.\n\nAt this point, however, I always remind myself that I have a very negative relationship with my \"visible femininity\" due to repeated rapes of varying degrees and too many sexual assaults and that I am not really able to differentiate thoughts and feelings appropriately in this context.\n\nIn any case, I have had very pronounced and detailed violent fantasies about my breasts for years, which occasionally manifest themselves in dreams. I feel wrong, disgusting and I don't know what to do.\n\nWhat can I do apart from talking to my therapist? I need help. Is there a way to get rid of my titties without paying thousands of euros?"
  },
  {
    "post_id":"1c3z7te",
    "title":"Feeling completely androgynous sucks",
    "body":"I (16) am a non-binary person who feels and wants to present completely androgynous. And it fucking sucks.\n\nNothing except casual everyday clothes make me feel good or completely like myself. I never know what the hell to wear to a fancier event, because both a full dress and a full suit make me feel extremely dysphoric. Anything remotely feminine or masculine makes me feel like shit, but there's really no in-between that I've found.\n\nI'm afab and have pretty big boobs that also make me super dysphoric, and I'm looking to get top surgery. However, recently I got another fear — what if a permanent flat chest also makes me dysphoric because its too masculine? I bind pretty much every day, but this fear has definitely risen to the top of my mind lately.\n\nWhat am I supposed to do? Am I supposed to just live my life forever never feeling completely like myself? Honestly I wish I was just either transmasc or transfem so I'd have at least some sort of direction and goals I'd want with my transition (Not trying to dismiss their struggles of course, I know it's hard for you too). I honestly can't really see much of a happy, fully transitioned future for myself like this.\n\nDoes anyone have similar experiences? What am I supposed to do about this?\n\n"
  }
]