[
  {
    "post_id":"iguu2v",
    "title":"Help! Baby fell of the bed!",
    "body":"Hi, my baby just fell of the bed and he doctors office isnt replying. She has a bump forming on her forehead and is still whimpering. The bed is 44cm high. Should i take her to the er? We have an influx of covid cases now, but not  so high as other places.\n\nShe is 4 months old."
  },
  {
    "post_id":"z9djw5",
    "title":"My mom kissed LO in front of me and denied it & physically touches him too much (imo). How serious is this?",
    "body":"I told my mom explicitly many times to not kiss my baby (4 months old) for hygiene purposes and it also just grosses me out. I have many bad memories of her making me kiss her on the cheek and lips and it makes me feel so so gross because I didn’t feel like I had a choice when I was little (and I didn’t want to). She also used to tickle and bite me a lot, she literally chased me around the house and did this to me on her bed and I screamed for my brother to help me get away but my mom took it all as a big joke and didn’t stop until I was old enough to physically stop her. She is a school superintendent (for little kids) so I always figured she was right to do this to me (obviously she wasn’t). \n\nAs LO gets older I’ve stated noticing more concerning things she does. She seems to be getting more confident about her actions. Yesterday she was sitting with my baby and she kissed him on the top of his head. I was shocked and immediately said something like ‘you cannot kiss LO, you just kissed him’ and she said ‘no I didn’t’ and acted all surprised. She also started to poke and tickle him and when I told her to stop, she asked why, I explained (bc even though he’s a baby he probably does not enjoy that; he just can’t control his arms enough to swat her away) and she rolled her eyes and disagreed but she did stop. \n\nHow seriously should I take all of this? Am I just being an overly cautious FTM? She’s also made comments in front of me about biting his legs, and when I told her she can never do that she told my infant son that mommy needs to leave him alone with grandma for a while. \n\nI’m huge on consent and always ask my son if I may kiss him on the belly or cheek before I do. I say the same thing ‘May I give you a kiss?’ and he knows what it means and usually smiles big and giggles, and if he ever doesn’t enthusiastically smile when I ask, I don’t kiss him. Some people laugh at me but I believe babies really can communicate this way. \n\nUp until these comments and kiss, she was our only trusted babysitter. But now I don’t want to leave LO alone with her anymore. Am I overreacting? Is a kiss on the head no big deal if LO Is already 4 months old\/is this it’s normal grandma behavior?\n\nETA She is amazing with LO otherwise, he smiles bigger when he sees her than when he sees me. He’s obsessed with her. These physical oversteps just started within the last week (he’s 4 months old) so I don’t know if he understands or cares."
  },
  {
    "post_id":"q0k7tf",
    "title":"Help with sick baby.",
    "body":"6 month old getting covid tested on Tuesday as a precaution but the way she is seems like just a cold. Her wake hours go up to 6 hours and it’s 8:38am and she’s been up since 4am. She won’t eat, I don’t know what to do I’m losing it. \n\nIs she too hot? Is she too cold? Should I put her in a onesie, a pajama? What should I do? Her doctor said just continue with normal routine no medication. Hello help me I can’t do this"
  },
  {
    "post_id":"wa687i",
    "title":"why does he hit me so much",
    "body":"Anyone else's toddler just hit them for no reason at all? As soon as he (20 months)  wakes up I get a smack in the face, holding him and he is all sunshine and rainbows and then suddenly *smack* or he violently grabs my glasses off my face and throws them. He demands to be held and then headbutts me in the nose and grins like he has done some wonder thing. \nAll day I'm just getting beaten up by this kid and I'm starting to really have trouble dealing with it, especially because it's just me he does this too. \n\nMy partner and I don't know what to do. We have been as gentle as possible, we tell him it's not ok to hit me. I put him down or walk away from him as soon as he does it. I've grabbed his hand mid air to stop him and tell him not to. \n\nAnyone else going through this? \nPlease send help!!"
  },
  {
    "post_id":"1gm0agl",
    "title":"Do you ever hate your life?",
    "body":"Do you ever hate your life? Like hate your husband, hate your kids, hate everything about your life? Do you ever miss what life was like before kids? I love my kids so much, but it’s a LOT, most days are great but there are days where I regret everything. I regret getting married, I regret having kids, I regret quitting my job, I regret giving up my social life my body. Everything. Like it’s all too much. "
  },
  {
    "post_id":"fs9cha",
    "title":"Guilt about supplementing with formula...",
    "body":"Hey mammas, I have a nearly 9 week old and have been EBF so far, but needing to pump to keep up supply and the night feedings\/pumping are starting to take their toll. \n\nI originally intended to bf for a year, as soon as she was born I realized that was an insane notion, so hoped for 6 months. But it’s just so hard. So hubs and I agreed 3 months minimum and maybe by the time I got there I’d be able to keep going. \n\nJust over 3 more weeks to get to that benchmark and I am absolutely ready to let my supply dwindle if only to be able to get a full nights sleep without nursing or pumping. \n\nI feel like I’m losing my mind in isolation. it feels like half my day is spent nursing or pumping and I get no reprieve in the outside world anymore which was keeping me going before. \n\nBut I can’t stop the guilt either. I have a type A, all or nothing mentality so I feel like supplementing is a failure (completely my own neurosis I know). And I know it will cost more and make travel harder (if I’m even able to travel at all this summer with covid), and I just feel like I should be able to do it. Like I’m being selfish for wanting to stop. \n\nHow do you get past these feelings...?"
  },
  {
    "post_id":"8nt8j5",
    "title":"Afraid of kid #3",
    "body":"I have 2 children already, age 2 and 4. I didn't want to have another baby but nothing ever turns out as planned. The father wants to keep baby #3, I do not. When i first found out i was pregnant I was pretty set on not keeping it. My relationship with the father of my children is an unhealthy one and I was planning on leaving him. I have finally gotten to a stronger mental state where I feel confident enough to raise 2 kids on my own...but 3... \n My appointment for the abortion is in a week but I feel guilty. I have had an abortion before when I was 20. But now that I have two beautiful babies and know the potential of this little one in me, I'm torn and scared.\nAnd before anyone says it, I am very careful. I am on the pill and do use condoms... so talk about shitty luck...\nI do have the help of family, but I live in a 1 bedroom apartment and own a small Prius... all the added expenses of a 3rd baby. I just don't know...\n\nI came here to see I'd there were other single moms of 3 who have managed... how they managed... maybe I could manage....\n\nEdit:\n\nWow I didn't expect so many positive responses! I honestly needed a place to vent and reading everyone's comments has helped me feel a little less burden. Thank you all.\n\nAs for the relationship between me and the father of my children. He is a recovering addict and just 3 months ago started drinking again just 2 months shy of his year of sobriety. His reasoning: \"Drugs were my problem, not alcohol.\" I finally opened my mouth a few days ago about how he messed up and if he didn't stop I would leave him. He threw away all the bottles he had bought. However, finding out I was pregnant is a kind of wake up call for me. I don't want to be with man waiting for him to convince himself that one drink, or one anything, won't hurt.  I"
  },
  {
    "post_id":"7s1kjj",
    "title":"How do I make this baby sleep please help me",
    "body":"As many of you can imagine, I am at my wits end. My healthy baby boy just does not sleep. He’s king of the cat naps. He’s two months. He’ll take 15-20 minute naps 2-3 times a day and that’s enough I guess???? Then at night we can usually get one decent 2-3 hr block out of him and then the second half of the night is a very fit full sleep where he’s kind of up and down the whole time. Now we’ve struggled with reflux but we’re using a formula now that has helped a decent amount. And we know what it looks and sounds like if reflux is getting him up and it’s not that very often anymore. Plus that I can understand. It seems like he’ll have one day every 3-4 days where he sleeps like what I imagined babies sleep like- 3 nice long (2-3 hr) naps and then 2 decent blocks at night with two wake ups for food. Then the rest of the days are all cat naps and very little deep sleeps. We’re sleep deprived but mostly just at a loss for what the hell to do. He’s thriving, gaining weight, super healthy appetite. Besides the reflux, which is semi under control now, there’s no obvious concern. We’ve got every sleep option you can imagine- swing, vibrating seat, bouncing seat, inclined sleeper, flat bassinet, co sleeper... we’ve swaddled and unswaddled. Lights out or dim lights, soothing music or silence, white noise and sleepy lights projected onto ceiling. Baths before bed, lavender bath and sheet spray. I’m a FTM and admittedly clueless, but come onnnnn. I’m going back to work very soon and I’m panicked I’m going to be a mess from the sleepless nights. Everyone keeps saying ‘oh the first 3 months are brutal and then it gets better blah blah.’ But I feel skeptical. And what the hell am I supposed to do until then? And what if the promised relief doesn’t come? Do people survive this?! \n\nHELP ME MAKE THIS BABY SLEEP PLEASE!!!!! \n\nAddition- my mom seems to think that the baby is not satisfied by this ‘thin’ formula we are using. It seems like we feed him hourly. We always looks at each other and say ‘he cannot be hungry again!’ And he latches onto the nipple like we’ve been starving him for weeks. I’ve even started using premie nipples to slow down his guzzle. She suggested rice cereal in the bottle but the Internet has some horrible things to say about doing this. He’s only 2 months and I’m worried it’s way too soon to introduce rice cereal. There’s also reflux\/spit up prethickened formulas- anyone have thoughts on these? \n\nThanks "
  },
  {
    "post_id":"1b4zxid",
    "title":"Why is it as the mom, I have to power through my illness but my spouse doesn’t?",
    "body":"Rant incoming\n\nThis past week I (29F) have been sick with a fever, chills, body aches, a terrible sinus headache\/migraine and cough. My husband (30M) works 12 hour days and weekends, so I have been home with our 2yo and our 4mo. All this past week despite being sick, as the stay at home parent I’ve had to power through and take care of our kids, cooking meals and making snack boxes so my husband has food to take to work for his long days, giving my kids baths, doing the bedtime routines, the grocery shopping, the laundry, the dishes, the overnight wakings and feedings with our 4mo. Then a few days ago our 2yo came down with a fever so I was waking up with her overnight too. Finally the weekend came and my husband promised it would be my turn to rest since I hadn’t had a chance all week, and he knew I was still sick and exhausted. Well, naturally he comes down with food poisoning or some type of stomach\/gastrointestinal bug and is having diarrhea and vomiting all night. \n\nSo I continue waking with our infant overnight into the morning and then my husband took over from about 8-10:30. During that time he got both kids up, dressed, fed our toddler breakfast, fed our infant, fed our 2 dogs, let the dogs out and that was it. I wake up to the sounds of him yelling at our toddler to stop fighting him during a diaper change, and him calling me saying he needs wipes because she had a blowout and he doesn’t have wipes. I bring down a pack of wipes and discover our toddler’s blowout left poop on our infant’s sit up chair which is hand wash only because it doesn’t come apart, and our infant has had a blowout as well in his mamaroo which my husband didn’t notice. I ask him if he has checked our toddler’s temp because she has been running 100-102° temperatures and he admits that no, he hasn’t but he has checked his and he doesn’t have a temp of his own. Which good for you but I’m more worried about our child who can’t advocate to get medicine on her own if she’s not feeling well…\n\nMy husband then falls asleep on the couch after the diaper change, and I’m left to hand wash the sit-up chair, and handle the baby’s blowout and clean the mamaroo insert. While my husband is napping, I empty the dishwasher, bring down and wash all the bottles from overnight, check our toddler’s temperature, reload the dishwasher, check the baby’s temperature to make sure he’s not getting sick, take my own medicine, and get our infant’s laundry started. Maybe I’m just looking for a bone to pick but I’m just feeling so frustrated because it feels like I’ve had to power through this whole last week being under the weather, having no choice because our kids need me, but he’s home now and he’s here and capable and I get that he doesn’t feel good became same, but he can’t pick himself up just a little bit and show up even a little bit? Like am I asking or expecting too much? Am I being unreasonable or unfair? \n\nTL;DR \nI was sick this whole past week but because husband works 12 hour days, I had to take care of our 2yo and 4mo by myself while sick. My husband promised when the weekend came, I’d be able to rest and he’d watch the kids. Naturally Friday night he comes down with food poisoning or a gastro bug and ends up having diarrhea\/vomiting all night and has spent all but 2 hours napping. I’m frustrated because what was supposed to be my turn to rest is just more of my time spent taking care of the kids while sick and exhausted. Am I being unreasonable or unrealistic in expecting and wishing that my husband power through his illness like I do mine, to parent our kids?"
  },
  {
    "post_id":"1ank182",
    "title":"Did I make a huge mistake",
    "body":"My boyfriend (27m) and I (29f) moved in together awhile ago with my two young children. I moved to his city for a job that pays pretty well. Like well over $5000 a month. I planned to pay off a lot of my debt and get my kids and I a lot of fun stuff we’ve always been wanting. After a few weeks though my boyfriend stopped waking up in Time for work. He claims he just can’t wake up. He has no idea why except he stays up till 2 am playing video games and watching tv every night. No different than before we lived together. After awhile he was making no money cuz he was just skipping work days. We decided he would just quit bc he got into a web dev program that’s supposed to be done in 9 months. I was happy at first because I figured I’d have more time to spend with him. But he won’t wake up. He says he “cant” wake up. If he agrees to take my son to school in the morning I have to set an alarm to wake up myself wake up my son and get him ready and then I have to wake my boyfriend up because “he cant” supposedly even though he had no trouble at all before we moved in together. Meanwhile I have been footing his outrageous bills. I have two kids and my bills are nil. His are over $1000 a month. Which I’m fine with but he stays in bed till I wake him up and I have to repeatedly do so. He watches my kids over the weekend while I work nightshift 6pm to 7am. I don’t get home till 8\/830 every morning and I’m exhausted. I come home to an absolute disaster in my home and my young child being up for hours without supervision bc he will not get out of bed. I’ve worked really hard to get where I am and I work tirelessly to keep it nice and tidy in our home but he hardly lifts a finger. When he’s with us, he’s on his phone. He plays with my kids sometimes. But for the most part he’s lost in his phone. I’ve repeatedly asked him to help more around the house bc I’m tired as hell and physically my body is breaking from all the work. But nothing has changed at all. I think that if I work 40+ hours, do all the housework and most of the parenting, then he can do 20 hours of school, an equal amount of housework and parenting but evidently that’s too much to ask of him? According to him he “cleans a lot” but I don’t see it. There’s trash everywhere, unfinished food sitting out, piles of unfolded laundry, dirty floors, full sink no matter how much I do, I feel like I’m just being shit on at every turn. There’s a lot more issues but this is the main one. I have a two year contract at my company and he watches my kids or else I wouldn’t be making as much money. I’m only 6 months in to the job and I want out, I want to go back to being just me and my boys."
  },
  {
    "post_id":"1graw46",
    "title":"I can’t handle my cats since having my baby and I don’t know what to do",
    "body":"Before my son came along, my cats already gave us issues, though we loved (love?) them so much. I’ve never been able to keep dog beds in the house because they pee on them or the dog blankets. But ever since we had our son last year, their behavior is off the charts. They’re on very expensive— we can barely afford it— urinary stress diet food, our female has had bladder stones removed and they’re both checked out for them every year. But every day it seems I’m cleaning something with cat pee on it and I’m just so, so, so done.\n\nMy couch, the couch cushions while the couch covers are in the wash, the dog blankets (again) my clean laundry basket, my baby’s play mat, I’m telling you… everywhere. I can’t catch up.\n\nThey eat well, they have access to plenty of water, they have their own space away from our dogs and the baby, they have multiple litter boxes scooped daily and completely overhauled every month. I’m so over my head and no amount of Zoloft can make this okay for me. I get no help with any of this from my husband either since he works 60 hours so I can stay home and take care of all of… this. I’ve tried rehoming them but no one wants 5 year old bonded cats. They only want to give advice which I’ve taken. I’ve tried it all. For a year. \n\nAre the dogs and baby too much for my cats? Would they thrive more in a home without so much going on? Is this their way of telling me? I just dont know what to do. I love them, but I swear to god if I have to wash one more thing with cat pee on it I am going to combust.\n\nEdit: Thank you so much for all of the support and understanding. Before I had my baby, my pets were my life. My babies. I foster failed these kittens because I couldn’t handle giving them away, and it’s not any easier now 5 years later. If I had known then what I know now, I would’ve adopted them out as kittens. Hindsight is 20\/20. My husband and I now have a very difficult decision to make. "
  },
  {
    "post_id":"1hhlii8",
    "title":"11 month old refusing bottle and it's killing my mental health",
    "body":"This is mostly a vent because I have no one else I can talk to about this. \n\nMy 11 month old has recently been refusing bottles. No idea why, just started about a week ago. He refuses to drink them at daycare and barely tolerates them at home. This has been causing me a lot of stress, especially because he lost a lot of weight when he was first born and I struggled with nursing initially. The first few weeks of his life were super traumatic for me and I realize I'm still carrying a lot of that.\n\nThis has also resulted in him waking up super hungry at night when he didn't used to, which is hardest on me because I handle nights since it's easier to just nurse him than heat a bottle that he might reject anyways. \n\nMy husband is great and tries to be supportive, but it frustrates me that he just doesn't take this seriously. He thinks I'm stressing for no reason, and even seems annoyed when I talk about it with him because I bring it up constantly. He can't empathize with where I'm coming from and he doesn't deal with the consequences directly, so I feel super helpless and like I need to just suffer silently and alone.\n\nI don't know what I'm looking for here. I guess reassurance this gets better? That maybe it's a phase my baby will grow out of? "
  },
  {
    "post_id":"1gpslpo",
    "title":"Daughter got hand caught in elevator ",
    "body":"She is fine, we went to the urgent care and she got x-rays. It looks like there may just be some bruising.\n\n(Quick explanation, we were waiting for the elevator, and I had the dog leash in one hand and I was holding her hand with my other. Somehow she still was following the elevator door as it opened with her hand, and her hand got caught in between the wall and the elevator. It happened so quickly) \n\nI’m having a really hard time getting past the whole  “what could have been” thing. I don’t want to burden my husband with this because this whole situation really isn’t about me, it’s about her, but I’m having really depressing thoughts. \n\nHow do you get past the “what if” thoughts as a parent after an injury? This was her first emergency doctor visit (she’s 19 months) and I’m feeling serious thoughts of despair. I could have just ruined her life if the injury was worse or god forbid it was a fatal accident. I can’t even type the thoughts I’m having because it’s just too stressful. \n\nPlease any advice would be so helpful for me. Thank you "
  },
  {
    "post_id":"uo4pwy",
    "title":"I need help...",
    "body":"Hello all,\nI'm writing because I desperately need help\/advice\/emotional support.\n\nI'm a 27 year-old mum, I work from home 100% and I have 2 children: a 3 year-old son and a 6 month-old daughter.\nMy son goes to school but I pick him up for lunch. My daughter doesn't go to daycare as I'm home (and appreciate saving money). However... Things are getting harder and harder as my husband can't really help when he's home. He starts his shift as a delivery man at 4am and is usually home around 3:30 or 4pm, exhausted. He falls asleep around 6pm (when I finish my shift) and so, after having worked all day on the computer (+ looking after the kids in the meantime), I'm alone for the evening to take care of the kids, do the cooking, the cleaning etc.\n\nI'm... Just... So tired and mentally drained. I feel I don't have 5 minutes for myself.\nMy mental health has never been great and it's getting super challenging right now and I don't know how to feel better... I'm crying basically everyday, because I'm so tired and overwhelmed.\nI don't find pleasure in anything, I don't even know what I'd like to do if I had the time! I've lost interest in everything...\n\nI feel so isolated, I don't know how to improve things, I feel horrible.\n\nSorry if my English isn't great at times - I'm French!\n\nThank you for reading and for any advice you could provide me with!"
  },
  {
    "post_id":"18g5k9n",
    "title":"Is my best friend jealous of a toddler?",
    "body":"My best friend and I have known each other 20 years, and during this time, we have taken care of each other, gone on trips, engaged in creative endeavors together, and allowed ourselves room to grow, but I gave birth three years ago, and this year my husband lost his job. In the time since, things have gotten incredibly tense at home, and I have gone on a heavy medication regimen to deal with my anxiety and bipolar disorder. I have become disengaged from my home life and I have become too involved in my best friend’s life. I have absorbed their problems, and not addressed any of my own. My husband recently got another job, and with 2024 on the horizon, I knew I needed to address this issue with my best friend.\n\nRight after my husband lost his job, I invited my best friend over my house on Wednesday nights for dinner and while it was enjoyable at first, over the course of the last few months, my best friend would come into my house and immediately unload about the work day in front of my toddler, sometimes would have emotional outbursts, and I would take care of them and ignore my daughter. I didn’t realize how much I was doing this, but I did notice that I was beginning to get uncomfortable around my best friend. I couldn’t figure out why I was feeling uncomfortable, or distant, and I just kept talking to them as if nothing was the problem. My best friend had done several things over the course of these last three years that have crossed boundaries, the biggest one being posting pictures of my daughter online (I literally cut my dad out of my life because he couldn’t agree to keep my kid off Facebook), and I never brought it up because I am afraid to. I am having these revelations now, and after speaking with my therapist, she recommended slowly backing away, which isn’t something that will work with my best friend. They’re enmeshed in my life, and I needed to inform them that I had to change my behavior.\n\nDuring a phone call with my best friend on Thursday night, I expressed to them that I had been prioritizing them over my husband and child. To start, I told them that the Wednesday night dinners needed to end because my daughter is going through a sleep regression and having a guest over on the week is really making the process more difficult. Once I said that the conversation got more tense. Eventually, once I said that I need to prioritize my husband and child, my best friend said that “how is that my fault?” Which is not the answer I was expecting. I stuttered and stumbled over my words. I didn’t know how to speak to them. They were crying, I just wanted to let them know that I need to put my daughter first, and in between cries they went “I know obviously, it just hurts.”\n\nI’m angry, quite frankly. I didn’t expect this reaction and I don’t know where to go from here. I’m not saying anything that isn’t a fact. I love my daughter more than my best friend because yeah, of course I do. I gave birth to her. She’s the priority. I haven’t been treating her like one and I need to make the effort now. \n\nDuring the conversation, my anxiety was so high and I didn’t know what to do, so I just said that we’re both in a bad place so it makes sense that this confrontation happened. I told my best friend I just needed space to be with my family and to work to heal together. Like I said, things are rough at home right now and I’ve been ignoring my problems to deal with my best friend.\n\nI received texts everyday since that conversation, and I finally told them today we need to talk in person. What do you recommend I say? What is the brain space of someone who is hurt by the sentence “I need to put my daughter first”? This is my closest friend so to not be allowed the space to focus on my family is just gut wrenching and I just want to simultaneously scream and yell and cry. Why are they acting like this? We went to different colleges and didn’t talk every day and still called each other best friends over a decade ago, so to ask for space now and to not be given it, I don’t know what to do."
  },
  {
    "post_id":"12tw0a4",
    "title":"I’ve returned to work and I feel numb and disconnected from my baby",
    "body":"I’ve not long returned to work after taking 7 months maternity leave. My partner is staying at home with my son for the next 4 months, until he goes to daycare. \n\nI don’t know what’s happened, but I now feel completely disconnected from him. \n\nI’m exhausted from doing three feeds a night, working, studying (trying to finish my masters degree), pumping **all the fucking time**.  Now when he sees me he just wants to breastfeed. If he’s near me he’s immediately agitated, pulling my shirt and grabbing my breasts. If I don’t feed him he gets more and more upset and crying. He doesn’t even want to feed, just be attached to me.  I’m always a patient person and I’ve never felt frustrated with him before, but now sometimes I feel so hurt and angry. He’s happy and giggly for everyone else, but with me it’s not like that **at all** anymore. My baby just wants my boob. He can go from perfectly fine to seeing me and wailing in 2 seconds. It’s every single time, every day, and it’s just breaking me.\n\nI feel numb. I know it’s not his fault. I know he wants to be close to me, but I just feel like a source of nutrition. It’s so hard to see him only be my happy boy with his Dad.\n\nIt doesn’t help that I have in-laws staying and you can cut the tension with a knife. It’s not helping hearing about all the little things each day that he’s done and how much fun he was. I know I should be glad, but I feel worse. I feel like I’ve lost something special.\n\nI don’t know what to do. Has anyone been here? Does it get better?"
  },
  {
    "post_id":"11r7bak",
    "title":"I’m an alcoholic and I don’t know what to do.",
    "body":"I’m an alcoholic and I don’t know what to do.\n\nI drank heavily before I was pregnant. I was completely sober two weeks before , during my entire pregnancy, and a few weeks after my pregnancy. \n\nI’ve had a few instances of misjudging my tolerance since having my daughter. \n\nShe’s been going through a sleep regression and we have had bad weather. I bought two bottles of cheap wine and drank them both after I put her to sleep. I haven’t slept more than 5 hours in the past 48. \n\nMy partner and I got into a huge fight. Mostly because he saw the empty\nWine bottles. He ended up leaving the house for a few minutes. \n\nNow I’m letting him sleep but I can’t sleep because I fucked up  so badly."
  },
  {
    "post_id":"1ak95hd",
    "title":"5th childhood disease, I'm pregnant, help?",
    "body":"I need to calm down, please help. I'm 26 weeks pregnant and have a toddler. We've been to check out a daycare for her, because it's possible we would need it around the delivery.  \n\nNow we got told they have a case of the 5th childhood disease there (they're mandated to disclose things like this). We've only been there for approx 30 minutes, my daughter didn't come into close contact with any of the kids, but she did play with the toys in the room while they were outside. \n\n\nThe reason I'm panicking is, the 5th childhood disease is horrible for the health of unborn babies. Like The disease you wanna avoid, similar to Measles. \n\n\nCan somebody calm me down a bit? I have health-anxiety I've dealt with for a while and can feel myself spinning... \n\n\nHave you encountered the disease? How likely is my daughter to catch it? And then how likely am I to catch it? I'm trying to not Google too much because either sends me down a doom spiral.\n\nIt doesn't help that my daughter has her father's skin and is super prone to redness and all kinds of rashes all the time.  She has a soft tiny, skin coloured rash at a couple of spots on her belly now and I'm freaking out. The pediatrician will not see us until Thursday and the ER in my country is not like the US. You can't come with anything to get quickly checked out, you have to have a specific acute problem like an injury, or they just tell you to wait for your normal doctor, so there's nothing I can do before Thursday."
  },
  {
    "post_id":"ykp48b",
    "title":"Intense guilt over the love and care I give my child.",
    "body":"Hi moms. I (39) am a full-time working mom of a 2.5 yo. Around 6-7 months post partum, I was suddenly hit with the thought from out of nowhere, while kissing and cuddling with my baby, that there may be another baby\/babies like him who may be neglected, abused and unloved right that moment. It was a gut-punching guilt and for another couple of weeks, I had it in my mind 24x7. I tried donating to local charities caring for kids and Non-profits back in my home country but it obviously didn’t help. This kept happening on and off until he started daycare at 13 months, at which point, I became too busy with work and I almost stopped having time for anything other than routine life. \n\nBut 2 nights back, while cuddling and talking to my son while putting him to bed, he had his usual belly laugh and all of a sudden the old guilt came back. Since then I haven’t been able to sleep normally. During the day, while working, I have to listen to some music to keep my thoughts distracted. Last 2 nights and tonight, I am watching some crap on YouTube until I tire out to sleep. \n\nHave any of you had similar experiences? Is this normal?\n\nUPDATE: Thank you all so much for your advice and sharing your experiences. It felt better to know that a lot of us go through this. I met with my Doctor last week. Ended up breaking down and crying in her office. Got referred to a therapist. Will be meeting her next week."
  },
  {
    "post_id":"nrdiup",
    "title":"Feeling like a bad mom",
    "body":"I’m not sure how to get a grip on myself to stop feeling this way. I feel like I’m never doing enough for her but also I NEVER do enough for me. She is an only child and I am CONSTANTLY being asked to play. I’m so freaked out that I am doing some deep psychological damage by telling her I’m tired or that I don’t want to play anymore. It’s utterly exhausting. I’m completely burnt out. I try to have some form of schedule throughout the day but that doesn’t give relief to my now depression. I don’t have many mom friends so getting out for play dates doesn’t usually happen. But I also feel like just in general I’m kind of an oddball out. Like...I feel as if every other mom is definitely a mom and I’m just a woman with a child with no room to speak. Lol what do you guys do with your kids all day? How and when do you set aside time for yourself? How do I quiet this mom guilt? I’m a stay at home mom so this doesn’t feel good."
  },
  {
    "post_id":"bopgd4",
    "title":"Need advice from other stay at home moms",
    "body":"I'm 19 and a momma to a lovely 7 (almost 8) month old infant. I'm a stay at home mom and my fiance works. On his days off I would like a little break from caring for our child but its always a fight. I don't even want that much. I just want an hour or two alone. He says he deserves more free time because he pays the bills, but I'm going crazy here. I don't have my license so the only time baby and I get out is if we go for a walk or weekly grocery shopping. I'm so tired of fighting with my fiancee about who takes care of the baby. We tried to establish a 50\/50 system where we each take turns doing diapers or feedings but then he gets annoyed by doing \"so much\" (mind you, he isn't the stay at home parent 😤) and then he says things like \"I don't pay for fair, I pay for the apartment.\" \nI should add I have a few mental illnesses I'm unmedicated for. Anxiety, depression, PTSD (from my abusive ex) and bipolar. I am trying to get into therapy but having a little trouble with my insurance on that front.\nFiance expects me to take care of our baby, clean the house, cook. I'm only eating once a day as is, no family to help. My inlaws HATE me. I just feel so trapped and I just need some advice! Anyone else here a stay at home mom? What did you do to not go crazy?"
  },
  {
    "post_id":"umrmhi",
    "title":"I’m barely hanging on right now",
    "body":"I’m currently six weeks pregnant with a two-year-old. I have never in my life experience what I’ve gone through in the past eight days with this “morning sickness”. I honestly would rather have Covid again. The nausea has been nonstop from morning to night along with my entire body feeling like it just got over an intense sunburn. Recently found a morning sickness pill that has helped somewhat but I still feel horrible throughout the entire day. I only drink water and ginger ale ( saw a website that recommended it) and I’ve been avoiding any type of greasy or grilled food. \n\nI have a doctors appointment on Friday for something else so hopefully they can prescribe me something then but until then can anybody recommend anything please."
  },
  {
    "post_id":"1bak1mv",
    "title":"My DH called me an “entitled b****” and doesn’t see why I can’t forgive him ",
    "body":"I’m getting so tired of feeling unappreciated. I’m a stay at home mom for our 2 toddlers. We recently opened up a restaurant and last night was the first live music night. Guess where I was? Yep, home with the kids. \n\nI’d done my best to try and find a sitter but I couldn’t. And DH didn’t say anything about a sitter too, just that it sucks I can’t be there. I could have… if he tried to find a sitter, too. Or at the very least send videos of the performance, instead I saw pics and short clips on FB and Insta. \n\nTo say I’m crushed in an understatement. I don’t get to go out a lot already and I stressed how much it’d mean to me to be there for our first ever live music event to DH. I think I’m understandably upset. \n\nSo when DH asked me why I’m so bummed out this morning I told him I feel a little left out and sad I couldn’t be there last night. Lately I’ve been struggling with not working anymore and even just not being there to help with service fills me with so much guilt. \n\nWell, he took it personally. Like, hard. He said I have no reason to complain as we both tried and it didn’t work out. “You’re acting like an entitled bitch for not getting your way.” I could see it in his eyes as soon as he said it he didn’t mean it, but the damage is done. \n\nI’m an entitled bitch for feeling left out. Okay. He apologized for saying it, he didn’t mean a word of it he just got caught up in the moment, but I didn’t believe him. He’s disrespected me before in arguments. This is the last straw. I’m not leaving him or anything but damn, that hurt. A lot. It’s going to take some time for me to even look at him without wanting to cry. I know it’s not true but it hurts knowing he thinks that about me. \n\nI gave up so much to be a stay at home mom. I worked 2 good jobs, aspired to attend college or uni, I used to be a decent author… that all stopped when I got pregnant with our oldest. And ever since having our kids my health has gotten so bad. I usually don’t complain, it’s just that lately it’s been hitting me hard that outside of having my kids I have no real achievements to celebrate. Woo, I made it out of poor family situation as a kid, yay! But I wanted to much more for myself. Grief is a fickle thing, I’m only human and I can’t help it. But I’m entitled for feeling bad? For leaving left behind at home? \n\nIdk. My heart hurts and I don’t know how I’m going to face him later. I can’t stop crying, even after taking my prescribed anxiety meds. How I do I move on from this? Can we? "
  },
  {
    "post_id":"23h18v",
    "title":"Homicidal Thoughts About My Newborn, Is This Normal?",
    "body":"Recently, I've been having some low moments during the day, but it's only been the last 2 days where I've found myself waking up in tears after dreaming about killing my newborn son. The first night I dreamt I was stuffing all sorts of fabric objects down his throat and watched him suffocate. The second night I dreamt he was restrained on a metal table, and I watched him being tortured with knives, cut all over his body and he was just screaming. I'm ashamed to be dreaming this sort of thing especially since I've recently become a Mum, and I'd never EVER hurt him. It kills me to know I've been dreaming that and I'm going to speak to my GP about this because I am convinced that this is not normal and there's something severely wrong with me mentally. Any help\/advice? I'm desperate to resolve this.."
  },
  {
    "post_id":"9io0mb",
    "title":"Postpartum anxiety",
    "body":"Hi moms! Do any of you have any experience with postpartum anxiety?\n\nI was on medication for anxiety for many years, although I'd stopped for a few years before I got pregnant. I was expecting to see my mental health tank while pregnant, but I was pretty stable overall actually.\n\nSince having my baby and going solo on maternity leave, I've felt my anxiety increase in ways that I think are beyond normal new mom feelings. It started with intrusive thoughts, which got more intense and intrusive as the weeks went by (and are so irrational and terrible they are not worth repeating). Now I'm noticing it spike right at bedtime and it comes with physical symptoms like a racing heart and shortness of breath. Last night was the first night I woke up in the middle of the night because I was so anxious (and stayed awake). I'm finding it more and more difficult to emotionally motivate myself to get out so I'm staying in the house for days at a time.\n\nWhen my anxiety was very high before I was pregnant, it manifested as panic attacks, insomnia, and generalized stress that kept me in the house. I felt worried about things when my baby aS first born but they were rational and didn't control me. Now it feels like the anxiety is taking over, and it feels like it's newly-developed.\n\nI've read a lot about postpartum depression but not so much about this anxiety. Any other moms go through this? What did you do?"
  },
  {
    "post_id":"ove57l",
    "title":"I brought home baby and feel like I'm losing my toddler.",
    "body":"My heart is broken into a million pieces. I just need to post for support. \n\nI brought home newborn baby 2 nights ago and it has been so hard on his 22 month old sister. She has been with grandma while I was at the hospital and was having a great time; but now that I'm back she desperately wants mama to herself. She constantly wants to be picked up and sit on my lap and when she doesn't get her way she breaks into long, intense tantrums. She cries every time she sees me. My husband and mother in law are insistent that she cry it out and I don't give in and give her the love she needs, but it is breaking me. I feel like it is too much change too fast, and that we need to be gentler with her and the transition. We can work on teaching lessons once her mom love cup is filled up and she knows that I am still here and love her unconditionally. \n\nI should be napping but instead I am in bed crying, feeling like like I've gained a baby boy but lost my little girl in the process. \n\nFor context: I had been on mat leave with our toddler for 18 months throughout the pandemic, with very little help or socialization nearby. Of course we are extremely attached. \n\nWhat do you think I should do? If I stay strong through the tantrums will it get better? Open to any and all advice on how to get through this. \n\nThis mom thanks you for the support.\n\n\n\nEDIT: Thank you all for taking the time to share your experiences and reassure me that it will get better. Husband has stepped up immensely and is spending all day every day with toddler doing fun activities. In between I am spending as much special time as I can with her and the crying is less and less every day. She is learning to be a big girl, with mom and dad helping her every step of the way. My hormones have leveled out and I'm no longer the sobbing fit I was when my milk came in, thank God. Next week my mom is coming to help and then its going to be just myself and the two babies figuring it out together. As hard as its going to be, I am looking forward to being just the 3 of us so the toddler knows that she is not being taken away from mommy and that she is a vital part of the team, taking care of baby. Until then I'm trying to rest up as much as possible because I know it's going to be the biggest challenge of my life, keeping both alive and happy! Wish me luck! \n\nThank you again for all the support. Feeling the love."
  },
  {
    "post_id":"1d8h5hb",
    "title":"Breastfeeding vs antidepressants ",
    "body":"I was on 300mg of Wellbutrin as well as a rather high level of xanax up until I found out I was pregnant. Quit cold turkey as soon as I found out it could be harmful to my baby.\n\nNow he's born and a few months old, and I am struggling HARD. The only feelings I seem to have are sadness\/despair, anger, or numbness. I know I love my child, but I don't feel love, happiness, joy, or anything like that. My milk supply has dwindled noticeably the two times I have tried to go back on my antidepressants, soI haven't been able to take them.\n\nI feel like I'm being forced to choose between having some modicum of mental stability with my meds, or continuing to pump milk for my child. I want to do what's best for him, but I am absolutely miserable and cry all the time.\n\nWhat should I do?\n\n(Yes, I'm in therapy, but it doesn't feel like it does  anything but make me feel worse)"
  },
  {
    "post_id":"42uhny",
    "title":"Medical condition forced me to never have another pregnancy, am now depressed and needing support.",
    "body":"Hello everyone, this may not be the right sub for this post so if you know of a better place I would be happy to post there instead! Also, I'm mobile right now, so please forgive any formatting errors. \n\nI am a married 27 year old mom to two girls, ages 7 and 3. During my last pregnancy, I was very sick and ended up being diagnosed with a very serious connective tissue disorder. I got through that pregnancy by the skin of my teeth and was then advised to never have another pregnancy because the chance that I would die was very high. I was sad, but knew that I couldn't martyr myself to give my girls another sibling. I had a tubal ligation shortly after my youngest's birth and then had a total hysterectomy last year. \n\nFor awhile, I was okay. I knew (and still know) that this was the only decision that I could come to logically, that anything else would be reckless. I still know this, but lately I have become so, so sad. My youngest turned three last week and I'm thinking of all the things I'll never get to experience again. I'm sad to see my breast milk starting to dry up, sad to think of never feeling little baby kicks again, sad to never be able to give my husband a son. My heart aches so badly and I don't know what to do or who to speak to about it. I am hopeful that we can adopt one day, but I still feel like a part of me is missing now. I'm wombless and I feel so robbed. \n\nHas anyone else gone through something similar or have any words of advice for me? Or know of a place I can go for support?"
  },
  {
    "post_id":"1cttt7s",
    "title":"I completely lost it tonight ",
    "body":"I have an almost 7 week old daughter and for the last couple of weeks, she has been screaming bloody murder around dinner time and beyond. Legitimately inconsolable. She will turn almost purple and sound like she’s not breathing because she’s crying so hard. It will last anywhere from 30 mins to 2 hours. \n\nI don’t know how to keep my calm during these moments. My anxiety immediately spikes to uncontrollable levels. \n\nTonight, I got so frustrated and overwhelmed that I threw a spaghetti-filled bowl (from dinner) as hard as I possibly could onto the kitchen floor and the food splattered everywhere - on the floor and walls. \n\nI truly try as hard as I can to keep my cool but I lost it tonight. Granted, it’s been a hard day. Scratch that, it’s been a hard last 2 months. Having a newborn is so, so hard. There’s no escape. I just want it to get easier… please tell me it gets easier! "
  },
  {
    "post_id":"1dpfue7",
    "title":"Am I overreacting by pulling child out of daycare? Need some support\/insight…",
    "body":"I didn’t really want to put my two year (26 mo) old in daycare but money is tight and the state would float it until I could get a job. I decided to listen to my family and try it out. \n\nFirst day, at pickup, the daycare worker informs me my baby didn’t eat all day. I’m assuming she didn’t drink for eight hours either, because she had a hard, dehydration-induced poop stuck halfway out that hasn’t been changed. I provided them (and mentioned) a large full sippy cup that never moved from where I put it. I noticed the room seemed filthier than I remembered and perhaps the director scheduled our tour during lights off nap time for a reason. I also noticed only two stressed daycare workers for 20 two year olds, well below regulation ratio in this state. My family told me I was overreacting to be worried and to give it another try, basically that I’m hysterical and overprotective.\n\nI took her back the next day and she seemed so terrified, and the one daycare worker in the room so overwhelmed, that I noped out and just walked right back out with her. My Grandpa passed today, so I dropped her off again today to make some funeral arrangements, wanting to give them one more chance and pick her up after just a couple hours, and lo and behold, a worker at that very daycare was arrested THE DAY BEFORE for assaulting a child! \n\nSo since my family is still calling me crazy, I’m totally reasonable for telling this daycare we’re done in the morning and then reporting them for all my observations, right?? Right? My boomer dad went on some speech about how back in his day there were 35 elementary schoolers in a classroom and it worked fine. I think it’s time to trust my intuition and my intuition only from here on out because these last few days have me just reeling. So upset I ever put my baby there. "
  },
  {
    "post_id":"okzor0",
    "title":"I dream about leaving",
    "body":"I keep coming so close to just getting in the car and leaving the kids and their dad behind. I love my husband and my daughter, but I just can’t stand my son. \n\nHe’s 3. He is naughty. He’s my first child so I have no idea if his level of naughty is normal, but I just can’t take it any more. \n\nHe doesn’t respond to punishment, praise, gentle parenting, taking toys away, nothing. Nothing works. It takes hours of him messing around, getting out of bed, jumping on the bed, sometimes hitting us, to get him to go to sleep. \n\nI’m beyond frustrated. I know everyone is going to say it’s not forever, but it might be. My brother has caused endless stress and heartbreak for my parents. I can’t live like that. I don’t think I can even get through and next 7 weeks until he starts preschool. \n\nHis attention span is next to nothing. I know half the time he’s naughty to get attention, but I can’t play with him every second of the day, and why is he after attention when he’s meant to be going to sleep? Is he on the spectrum? I can’t cope with that. \n\nI just don’t know what to do. He’s so rarely sweet that all I see is this horrible child and I wonder what I did wrong to make him that way. How do I fix him? I just want to leave."
  }
]