[
  {
    "post_id":"1ayyayi",
    "title":"My ex asked me to take her to inpatient care and I mistakenly called her parents in the process. I would really like some female perspectives on this.",
    "body":"So my ex had some serious trauma. She was raped by her abusive ex after we got together. I wasn't close with her family but they seemed nice, the problem was my ex kept a lot of things to herself, I had to work hard to get her to open up.\n\nThings became too much at some point and she called me from her therapist's office to get her care. Unfortunately she had two kids with her ex and we needed to get them looked after. With no one but me and her family, I had to make some calls. She knew they were going to be mad but I didn't believe her.\n\nHer parents came over unannounced and her father almost immediately attacked me at the door to get inside, mind you I only asked to speak outside and have never done anything to upset this man, but he had only recently found out about his daughter's rape.\n\nThings became very tense very quickly. They disregarded her feelings, demanded she go with them, said she couldn't see me again, could never go to inpatient care, that mental healthcare was worthless, and told me that it’s a man’s job to tell a woman when she isn't thinking right.\n\nI tried to stand up for her, but it's clear my ex wanted this to stop and started agreeing with him. I didn't know what to do and was suffering from some pretty serious trauma so I called the cops.\n\nA few days later she called me over, her father was there, she told me I shouldn't have tried to keep her family from her and tell the cops she was crazy, she said she had never been suicidal and that she never wanted to go to inpatient care. When I questioned her on this her father said, even if it was true, I should have told you not to go.\n\nAfter leaving her ex, her parents were responsible for her apartment, car,  job, and savings.\n\nIt's been about 2 months and I'm still shattered. Things got messy from there and I don't deny that my emotional state caused me to make several mistakes while trying to help her and figure out what was going on.\n\nIf you lovely ladies have any thoughts you could share, either to tell me off, give me a new perspective, or anything I would be grateful."
  },
  {
    "post_id":"5nv11p",
    "title":"My sister is losing her baby, and I feel pressured to take over even though I know I can't.",
    "body":"Just looking to relate to someone, or possibly for some inspirational advice.... Anyways, my sister recently gave birth to my first niece who I have yet to meet because I live so far away. I am supposed to be going back \"home\" very soon to meet her. She has been in the hospital since she was born because my sister did drugs throughout her pregnancy and the little angel has had to detox from drugs for the last... almost 3 weeks. The two months before she was born my sister was on the right track, in an outpatient rehab, and staying on medications to help her not do heroin (still not good for the baby, but it was a step). But the damage had been done and DCFS and the state are all over this case and are now ready to take the baby... My mom wants to take care of the baby but would be required to quit working which isn't possible. She passively hinted at me moving home to help her take care of the baby but I kind of laughed it off. It is something that I think about often though..  what if I have to step up and raise this baby? I can't just pick up this life I've made for myself and flip it upside down... but what kind of sister\/daughter\/aunt would I be if I just let them take the baby away.... Is it the selfish side of me thinking that it is ME that needs to save the day? This is the most conflicting thing I have ever gone through and no matter what, the outcome is going to be difficult... help."
  },
  {
    "post_id":"1h331ht",
    "title":"Made appointment to talk to OB about sterilization. What are the chances I can obtain a hysterectomy?",
    "body":"Hey all. As the title says, I have a consultation set up to discuss sterilization with my OB. I’m in my late thirties, married with stepkids and not planning to have any bio kids. Because of this and the recent election, I’d just prefer to get sterilized and not have to worry about birth control anymore. I also have a family history of uterine cancer and, to be honest, am not interested in menstruating anymore if I’m not going to have children. My periods before BC were very, very unpleasant (heavy, lasting weeks at a time), but I’ve been on BC in some form for nearly twenty years so there isn’t a medical record of that. My periods on BC, say towards the end of the life cycle of my IUD, were also difficult but more manageable. I’d prefer to not have to remain on BC post procedure.\n\nIs there any chance that, given my family and personal history, my OB will perform a hysterectomy? Has anyone been successful in getting this to happen? My OB is wonderful and very supportive, but I expect this to be an uphill battle regardless."
  },
  {
    "post_id":"s3kp9q",
    "title":"I hate the fact that I was groomed. If you were, how do you cope?",
    "body":"Tl;Dr at the bottom. \n\n\nGrooming is one of those topics I see pop up here every so often and it's shocking how common it is. I myself am just one of many cases and it continues to haunt me more than 15 years later. \n\nI [now 33F] was 12 and he was 22 and we \"met\" online. I told him in the beginning that I was 16 (as if that somehow made it better) but eventually told him the truth about my age and the \"relationship\" continued. Until I was 17.\n\nMy parents were getting divorced, I was lonely and felt neglected and it was nice I could have someone to talk to. Even if it often became sexual. \n\nHe often talked about marrying me, what our children would be like and painted this whole life together. He eventually became very possessive and would often force me to stay up into the wee hours of the morning on the phone with him even though I might've had school the next day. \n\nMore than once I tried to break it off with him and explained that I felt like I was being robbed of my childhood. His response would always be something manipulative and I would remain with him. \n\nMy parents knew. Maybe not the full extent of things since I wasn't comfortable to come out and say these things aloud (I'm still not). After my parents divorce, I stayed with my mom. She never tried to put a stop to it or explain why this relationship was wrong. I don't think this was due to negligence or shitty parenting - I think she just didn't know how to handle it and had so many other things going on at that time. And I wonder, if she had taken the time to sit down and talk to me about it, would I have listened? I don't know.\n\nYears later it still bothers me. Most days I don't think about it. I'm in a much better place in my life, in a good and healthy relationship, and have a better relationship with my parents now that I'm older and they're thankfully long divorced. We never talk about it and tbh I don't want to talk about it. It always makes me feel a little nauseous and dirty.\n\nSince it's disgustingly common, if you or someone you knew was groomed, how do you live with it? How do you forget about it and move on with your life? All I want is for it to be buried so deep it becomes forgotten. But here I am - 5:30 in the morning making this post because I woke up and for whatever reason, the memory of this horrible experience popped into my head.\n\nTl;Dr - was groomed. Scarred for life. Asking others that might've been in a similar situation how they live with these *feelings*?"
  },
  {
    "post_id":"13fhtbs",
    "title":"Gosh i need some help here, ladies",
    "body":"So, to make a long story short, me and my fiance have been together for 9 years. We have a son whos 3. \nIve finally gotten a job i really love after two years at home with my son. \n\nI really feel ive grown so much these three months that ive had the job. Its like ive found my old self again and Im good at this job! \n\nSo, i work in a male dominated field. And ive met someone, hes a coworker and were the two youngest here, so naturally we talk. \nI feel like theres this strong chemistry, and I think about him a lot. We were at a work thing two weeks ago where we talked a lot, probably flirted a bit too... We were two of the four last people to leave. \n\nRight now its truly only a work crush, we chitchat and glance at each other many times in a day. \n\nI believe that this crush has happened because things at home isnt the best right now. We are both so busy and tired at night. We never have sex anymore and when we do, i have to initiate. I feel like we have become roommates. \nIm sure that if things had amazing at home, then my crush probably wouldnt have happened. \n\nIm so frustrated and sad right now, and I dont have anyone to talk to about this. Has anyone been in my shoes? Like, what do I do?"
  },
  {
    "post_id":"3cny68",
    "title":"Best friend (22f) about to start seeing the guy I've been in love with. Is it immature of me (21f) to want to walk away from this friendship?",
    "body":"She is a 22f, I am a 21f and he is a 25m. \n\nI met him over a year ago in class. We were friends who I thought were pretty close. We hung out, I knew his friends and have met his family, and knew each other really well. We shared a lot of personal stuff. I considered him to be one of my best friends. I fell in love with him a few months after becoming friends with him. However, I knew he wasn't into me like that, plus I'm working through a lot of issues (PTSD and trying to get a bachelors [also a mental illness, imo]) so i know any serious relationship isn't right for me right now. Fast forward a year. He met my best friend. Had a crush on her instantly. My best friend knows how much I was in love with him. Just every choice she's made since then has been selfish from my eyes. Such as, being all over him in front of me. He cut me out of his life shortly after, completely shocking and devastasting me. He essentially told her (paraphrasing) when they afterward went on a date, \"I'm not attracted to her. Never have been. I knew she liked me but i like you so I dropped her. She was trying to make you look bad to win me over anyway, I want to date you.\"  She seems to be ok with this and is giving him a chance. I am devastated. I don't even know what to feel right now. She says I'm being immature and dramatic and I should just be happy for her. But I'm reeling from the loss of who I thought was one of my best friends-and his false accusations of me. And I'm also feeling shocked and kind of betrayed from her as well. Am i being immature or is this a bad friendship?\n\nEdit:\nIf this detail matters, she doesn't have a crush or any real interest in him. part of what makes it feel selfish to me. She is moving next year and just wants to have a \"fling\" relationship in the meantime. She gets plenty of male attention so I feel it's insensitive. "
  },
  {
    "post_id":"1cw794c",
    "title":"Rape in movies",
    "body":"I (20F) was raped by my then boyfriend at the age of 16. I don’t remember everything, but I remember how I felt during the ordeal. How panicked I felt, my heart racing, how I froze on the spot. How disgusting and used I felt afterwards. When a rape scene is shown in movies, it’s always violent. The rapist pins them down while the victim tries to fight. Watching these scenes makes me feel less than. I wasn’t pinned down, he wasn’t violent. I didn’t fight, I just laid there and let him rape me. I don’t have horrible nightmares or constant flashbacks like the characters on tv. I feel so invalidated, like what I went through wasn’t that bad. I hope someone can relate to me. I feel so alone."
  },
  {
    "post_id":"hmgmcd",
    "title":"My bf(17m) might’ve sexually assaulted me(17f) and I don’t know what to do",
    "body":"\n\nSo me and my boyfriend have been together for 6 months but we were really good friends since we were little.He doesn’t have any history with sexual assault or anything like this and mostly he has been very gente and careful with me even if he may rush things a little. \n\nWe have discussed before about sex and he said that he was ready but I told him I don’t feel ready yet but I wanna have sex with him when I would be ready and he was very understanding and said that he would have patience with me. I went over to his place and we started doing things and he put a condom on and I told him that I didn’t want to have sex with that day because I didn’t feel ready but still he tried to but I was too nervous and my body didn’t let him in. After this he acted hurt and shit saying that he wasn’t attractive enough or whatever but really I felt like shit and now I don’t wanna have sex with him or do stuff with him. I told him that I felt like he didn’t care about what I told him and he said he knows that he went over the limit and that he is sorry and that it will never happen again but I really trusted him before and I would have never even thought he wouldn’t stop when I told him no and now he really lost my trust. \n\nNow I don’t know what to do because he says he really loves me and I love him too but this kinda made me reevaluate our relationship and I wanna give him another chance but I don’t really feel good anymore but he thinks I moved on and that everything is good.\n\nedit: actually I told him again that I was bothered that he cared so little so we talked about it again and I told him how I felt and I had no reply and he only said he is sorry and understands what he did wrong. After that we went in self quarantine because in his friend group there was a person with COVID, ( luckily he doesn’t have it) and in that time I thought I didn’t feel anything for him anymore and so I tried to broke up with him but he insisted on seeing eachother one last time and now I’m reconsidering going back together because I will miss him and I’m not ready. I know what he did was wrong but I am just not strong enough to break it and I need advice\n\nand also he is really emotional and I think this might break him bc he started crying begging for a second chance when talked through the phone and met and he said that he loves me more than he ever loved and that we would rather never have sex than to break up and that he is willing to change everything to be back with me and I don’t know if I should believe him or not"
  },
  {
    "post_id":"8yq24p",
    "title":"I'm afraid of my rapist, I'm sorry I get downvoted on every sub but I REALLY need advice someone help me",
    "body":"I was raped by a complete stranger in march, who then followed me to my building. At first he just started appearing at the store near me, trying to make smalltalk etc. But I kept running away so now when I've tried to leave the building I see him outside and I have to turn back and cancel my plans. Luckily I'm a student and I don't work, so I can just miss some lectures. Last month he got my phonenumber. I still don't know how, and I changed it. He found it again. Then he found my facebook account (might have been earlier, I don't really use fb). I deleted all of my social media accounts, and started ordering in groceries. But in two weeks I will have to leave my apartment again to study. The police are really doing their best and I'm thankful for them, but I don't know his name, he keeps using different fb accounts, different phone numbers and emails. So before they find him I'd like to stay hidden. I've been living in my current apartment for 5 years now and I love it so much, moving is my last option. Is there anything to do so he would just forget about me, like faking my death?"
  },
  {
    "post_id":"2ma0dz",
    "title":"My sister suffers from self destructive behavior, I have no clue what to do anymore.",
    "body":"I suppose it isn't really a surprise that this happened. Her birth was the perfect recipe for disaster. First off, my baby sister is adopted. One day, her biological mother just came into my mother's office, unceremoniously plopped a baby carrier onto a desk and asked the people there if they wanted a baby. None of them wanted the baby, but then my father walked in, took one look at the baby and decided to bring her home. \n\nEveryone in the family knew, but I suppose there's some kind of stigma in being adopted (I don't get it myself) somehow somewhere it was decided that we wouldn't tell her. -I suppose that was mistake number one or was it. I have no idea. \n\nshe was a good kid growing up. A little bit of a quick temper but nothing that really stood out. I was around 13 years old and she was 3 when my father left to work overseas (it's been 15 years since I've last seen him) we talk on the phone every few weeks but he's never been much of a talker and never been much for displays of affection.. so I guess she never had a father figure- that probably makes it factor no. 2.. \n\nthen in 6th grade something changed. Suddenly she was cutting school and drinking with older boys. 12... 12 years old... it was such a sudden shift, I didn't know what to make of it. One reason I think (I only learned this years after the fact) was her varsity volleyball coach- who got a little bit handsy. He tried to kiss her and get her to do things.. (I never knew what else happened since she just stopped talking) so this might be factor number 3.\n\nwhen she was 14 she came out as a bisexual- and our entire family is hardcore catholic... so I guess that's factor number 4\n\nSo to recap, she somehow found out she's adopted, then hits puberty, got molested by her volleyball coach, found out she was bisexual- in a family that doesn't really care for it.. poor kid never stood a chance. \n\nAfter that (sixth grade), it has been a parade of trouble. Cutting classes, talking back to the teacher. Drinking. petty theft.. in 4 years she's been to 5 different schools in two different cities. She's been cutting herself and often times I've seen her suffer from rage episodes where she just punches herself or the wall.. \n\nnow, I've been advocating counseling\/rehab for the past few years now. Trouble is, my mom doesn't want the trouble, my dad doesn't believe in counseling and won't pay for it. That leaves my older sister (who is crazy in love with a guy in new york - nothing else exists outside of her quest to be united with her love) and me (currently jobless, depressed and currently in another city) \n\nI kind of get how she feels like her druggy friends are the only ones who can understand her, we're in the front page of 'family issues magazine'.. I feel like I'm the only one who cares anymore. Everybody else is treating her like she's a bad person, that she was born that way *whispers 'cause she's adopted'\n\nshe's stopped listening to me. She has tuned everybody else out and one of these days, I'm afraid she's going to do something monumentally stupid that could land her in jail or worse in the morgue. \n\nTL\/DR but honestly I have no idea what I'm gonna do. no one else is taking this seriously. \n\n"
  },
  {
    "post_id":"6f4wmj",
    "title":"Weight gain on birth control",
    "body":"I was wondering if any of you have experienced this or have some advice. Every time I switch birth control I've gained about 15-20 pounds in a few months and have a very very difficult time losing that weight. First I tried multiple types of pills but I forgot to take those often. \n\nAbout ten months ago I switched to Nexaplon, which is the little implant that goes in your arm and lasts for three years. I've had no bad side effects like I used to get (I.e. Migraines, mood swings, loss of libido) except I gained 20 pounds again! This is such a hard thing for me because I really struggle with body image issues and now I'm 180 ponds with a frame that is at a healthy weight around 135-140. \n\nSince starting birth control almost four years ago I've been at least 150 pounds. Basically I'm wondering if any of you have experienced a similar issue and if you have any suggestions for how to combat this side effect. Any help is appreciated! "
  },
  {
    "post_id":"2vr4wx",
    "title":"My bf of 8 years cheated on me out of the blue. How do I get over it?",
    "body":"I really need help I don't know what to do with myself ):\n\n\nWe moved in 7 months ago and I found out last week that he had been cheating on me with a girl from work for the past few weeks. I kicked him out of the house and told him I don't want to see him again. He has been lying to both of us about it, I don't even know if he was ever going to tell me.\n\n\nAnyway I'm heartbroken and single for the first time ever. How do I start to get over it? I've never had to get over someone before. I know he is a horrible coward and I deserve better but I miss him. It's such a frustrating feeling.\n\n\nAny tips would be appreciated <3"
  },
  {
    "post_id":"1ghge73",
    "title":"Did my bf SA me or was it just miscommunication?",
    "body":"Context: been together for 2 years, I sleep over at his house every weekend\n\nA couple of times I have woken up to him touching me\/grinding on me\/stimulating me in my sleep.\n\nBecause this has happened multiple times and I’ve never verbally said no when I have woken up to it and kinda just let it happen (idk why but I just stay still and wait for it to be over) I don’t know if I can call it SA because I never communicated that this was a problem or that I didn’t like it, but everytime it happens I feel so violated. I never said no and let him keep doing it so I feel guilty for being so disgusted and angry with him. \n\nCan someone provide some insight on this? Anything is helpful. Thanks"
  },
  {
    "post_id":"4hbuvm",
    "title":"Just diagnosed with HSV-1 on my genitals",
    "body":"I'm a 24YO F and I was just diagnosed and I feel like crap. I've been with the same man for a year now and before him I was with my previous SO for 4 years. I've never had any symptoms down below until about 5 days ago. I'm not sure if I could have contracted it years ago from a previous relationship like when I was 15?, Can it lay dormant for that long?, and didn't know or is it's more likely I received it from my current relationship. I'm just very scared and ashamed. I had a sexual experience with a girlfriend of mine about two months ago, which my BF was aware and part of i just was the only one who had intercourse with her, and am worried I could have given it to her but because I'm not sure when I contracted it I'm very confused on a length period of how long the virus can lay dormant, like I said I'm not sure if I had it when her and I hooked up she's said nothing about having anything unusual down below. My SO and I both have had cold sores of the mouth before so I know he has the virus  I just want to know more info about this and if we both have the virus is it safe for use to have unprotected sex with just each other or will it cause it to turn into something worse. Any information you guys can give me will be greatly appreciate."
  },
  {
    "post_id":"293072",
    "title":"Worst cramps ever...please help me",
    "body":"Im a 21 year old woman who's never been regular, and the last time I went in for a check up,  I saw a different doc who suggested PCOS. I have no idea if I have it as of yet, but I'm cramping worse than I've ever thought physically possible and I have to work today. Walking around and doing physical work for 10 hours. Please give me some suggestions and help ladies this is ridiculous and I can barely move! Nothing I have done is helping, please give me some advice! \n\noh yeah, I haven't actually started bleeding yet, either. "
  },
  {
    "post_id":"69h6kh",
    "title":"Really starting to feel the pressure",
    "body":"Hi all! \n\nI hope this is the right thread to post in, if not feel free to point me in the right direction.\n\nA little back story: I'm a 22F, live in a fairly large (also fairly liberal) city, have a job at a tech start up, and no college education. \n\nMy boyfriend and I moved to this city a couple years ago after being together for 3 years (at the time) and things just sort of started falling into place. Well, I recently decided to completely switch my career path and enroll in college to become a K-12 teacher. This came as a big surprise to my partner but he has been amazingly supportive. After telling my family and friends about my new endeavors I got some responses that really threw me off. i.e: when will you have time to have kids, why haven't you gotten married, what if you don't make a lot of money, and so on. These responses have gotten me thinking I'm doing something terribly wrong and that things will just fail miserably.\n\nI just wanted to ask all of you if you've experienced something like this. If so, how'd you feel about it? What was your answer to get things on the right track?\n\nTL;DR being pressured into marriage, kids, etc. while trying to pursue a passion. Causing A LOT of anxiety and uncertainty. "
  },
  {
    "post_id":"3qajyb",
    "title":"Hey twox, I think I was drugged yesterday while I was visiting my bf at work and I'm not sure what to do...or what I'm supposed to be doing.",
    "body":"Yesterday, I had some free time during the day so I decided to visit my bf at work. He works at a hardware store in the \"bad\" part of town, but it was daylight so I walked over and surprised him. \n\n\nHe only had like an hour and a half before he finished work so I decided I'd stick around and wait for him to finish and we'd walk back home together. \n\n\nHere's where it starts getting weird. I was feeling fine when I got to the store. I mentioned I was hungry and he showed me where they kept the coffee. I drank a cup and sat down in a chair in the front part of the store to do some work on my laptop. I finally got bored and grabbed some more coffee and walked around the store until it was close for him to go. \n\n\nThen I had to use the bathroom, so I left my stuff (backpack, coat and coffee) with him up on his podium thing and asked him to watch it while I went. \n\n\nBy then, it was time for him to clock out and he came back with my stuff to the area where you clock out, but he had left the coffee cup on the podium. It's just a cup btw, and has no cover thing on top of it. \n\n\nThe podium is out in the middle of the store, next to the registers and anyone can walk by it easily. I wanted to tell him to go back and grab it real fast, but I didn't and so I waited for him to clock out for a few minutes in the back, and then decided to go back and grab it myself. \n\n\nI grabbed it and start sipping it, and he comes out from the back and we start walking back home. I drink about half of it, and then it's cold so I throw the other half away. About five minutes after I started drinking that cup though, I start getting really giggly. Which isn't really that strange to either of us at the time, because I can get really giggly\/hyper sometimes for no reason.\n\n\nBut then things get really weird, even for me. I get super tired and lay in the bed almost paralyzed. And I'm starting to say delusional things.. Like how he's an angel and how I must have died and gone to heaven. And it's not like in a cute way. I really did believe it. And then, we start getting touchy (sorry if tmi) but a friskiness starts followed by some intense orgasms. By then, I'm so tired I can't even speak properly. I keep zoning out and start feeling paranoid and some anxiety hits. I'm seeing shapes on the wallpaper patterns. My jaw gets all clenched. Like really clenched. Like every time I try to keep it still, it snaps closed. I'm slurring my words like I'm drunk and can't form proper sentences.\n\n\nBy then, I tell him I really don't think I'm okay. I tell him it's not like other days where I'm just zoning out. We have a hunch that something must have happened to the coffee while we had left it unattended at the podium. Anyways, I get some bad nausea and vomit a little, drink some water and ride out the night. \n\n\nToday, my bf goes to work and asks the lost prevention team(security) to check the footage to see if anyone had messed with my coffee on the podium for those few minutes. They take a look at it and tell him there was a man who walked by and \"waved his hand over it\" for those 2-3 minutes while we were gone.\n\n\nThey said there was no one else who came near it, but then go on to say they say they aren't even sure he had done anything, because according to them, he was really \"inconspicuous\" about it. They said he had just walked by and waved his hand like he was scratching his head when he came near it. \n\n\nIt just doesn't make sense to me. It was barely busy when my bf and I went to the back of the store and left the coffee. A lot of the registers were open, so that there would be no real reason to walk by the podium. And we were only gone for like 5 minutes tops, so what are the chances of someone just walking by and waving their hand in front of the coffee during that time by chance?\n\n\nThey also said they had seen him in the store before. To me, this means that he might be familiar with the store and known where the cameras were and what to do to not look too suspicious. To them, they're saying they can't do anything until the guy walks into the store again. They said they'll watch him if he does come in again but pretty much, it's out of their hands until he comes back in again.\n\n\nI just don't know what to do now. All I know is that I was not feeling okay after I left that store. And I was lucky enough to have my bf with me to walk me home and make sure I was okay.\n\n\nI don't want whatever had happened to me to happen to some other person who may not have someone to walk them home or make sure they are okay...\n\n\n"
  },
  {
    "post_id":"w0yv0v",
    "title":"Sexual Harassment at Dinner. I'm so frustrated.",
    "body":"I went out to have dinner tonight with my little sister. Our table was near a window with me facing the window and thankfully her back towards the window. Our entrées arrived and we began eating. Shortly after, I saw a man in the window facing towards me. I thought it was strange that there was a man just standing in front of the window but I ignored it at first because maybe he was just waiting for someone. I take a few bites of my food and look back up at the window and the man is standing up and jerking off, taking his thing in and out of\nhis pants. I didn't want to draw attention to it, especially with my little sister (14) eating with me. I tried my best to ignore it but I came home feeling so depressed, angry and frustrated. I feel like I should have told someone. Is this more than sexual harassment?\n\nThank you for listening"
  },
  {
    "post_id":"mdxioa",
    "title":"Ex BF family sues me for imaginary child they think I have",
    "body":"I originally posted this on r\/legaladvice bUt someone suggested I post it here for more woman perspective. If anybody has any tips or help on what to do I would really appreciate it. \n\nEdited: I know I wasn’t the best partner ever but this is insane how far they’re going to ruin my life. I don’t get why there are people going this far to cause harm. \nIt was because of this past relationship that I to seek out therapy, and this is making so fearful for my future and giving me crippling anxiety. \n\n\nThrow-away account obviously.\n\nI escaped an abusive toxic relationship over a year ago, broken hearted. A couple months ago my ex’s brother calls me and says that my ex died and he want me to know how much he hated me and that I am not welcome to the funeral and that everyone there hates me. Completely uncalled for but still hurt a lot. Now yesterday I get served paperwork’s for a lawsuit my Ex’s mother filed for a child she thinks I had that i never did. I can’t even get pregnant. I don’t even think my ex is deceased, I think they’re going out of their way to torment me. I don’t know what to do. They think I carried a child when we broke up and now sued me for custody I’ve been freaking out. I don’t want more trouble. And these are insane white rich people that have hired two attorneys for this lawsuit. I built up the courage to try and call the attorney to explain that this must be a mistake because I don’t have a child and I’ve never been pregnant. All they did was yell at me and not let me speak telling me how bad I’m going to have for not complying. When I managed to get a word in saying I don’t have a kid they insisted I put it for adoption and how screwed I am for doing this. I don’t know what to do I don’t have much funds to hire a lawyer and I’m completely ignorant of the process. If anybody has any tips it would mean the world to me. Sorry for making this half a venting too. Thank you."
  },
  {
    "post_id":"18wcvhy",
    "title":"Unemployment in Relationships",
    "body":"Unemployment in Relationships\n\nI feel like I’m at the end of my rope and don’t know how to handle this situation. \n\nI (26F) have been with my husband (29M) for 10 years. We started dating when I was 16, he proposed when I was 20, got married at 24. He’s always had a passion for computer programming and graduated college to be a software developer in 2019. He got a job with a start up company right out of college and loved it there, but his boss and him didn’t see eye to eye, and after a year or so he was laid off for the company “not having enough work” and needing to cut back their employees. \n\nHe got another job shortly after but it was a temporary position working on a project. Only lasted a few months. \n\nWe got married in October 2021, and he was laid off from that temp position in December 2021. He hasn’t had a job since. \n\nI 100% believe he’s trying his best, he’s had countless interviews with software companies and others that are a bit out of his scope, but he was desperate. He’s applied to retail\/minimum wage jobs over the last year as well, because he needs SOMETHING, also with no luck. I know the job market where I live right now is ridiculous, and even more ridiculous in his field since COVID, but I don’t know how much more of this I can take. I physically don’t make enough money to support the two of us. The last 2 years I’ve taken a higher paying job and have been working insane amounts of overtime just to get bills paid, but as of a few weeks ago, overtime is no longer available. Today was the first time we flat out couldn’t pay bills, and he was upset with me for not budgeting better. \n\nI truly love this man but I can’t keep living like this. We already live with my parents in a cramped basement and we’re both extremely depressed. This isn’t how I wanted my marriage to start out. I feel myself slowly building resentment towards him for this situation."
  },
  {
    "post_id":"ydd1ux",
    "title":"TW: sex without consent - Had a really negative sexual experience last night",
    "body":"I know I could post this on r\/ sex, but this community seems super supportive so I felt like griping here. I (29F) went on a first date with a guy (36M) who is getting ready to record an album, so I invited him over after drinks to do some singing and maybe make out a little since I’m on my period. One thing led to another and while he asked for consent to kiss me there was no other consent - suddenly he’s putting on a condom and getting inside me. Penetrative sex is extremely painful for me (I’ve done lots of PT and meds for it but that’s another story), and I usually have the opportunity to communicate that before it happens, but I didn’t get the chance to this time. Thankfully it was over after around six thrusts, but then there was no discussion about pleasuring me, just pillow talk. I was shedding a few tears during that time but he didn’t seem to notice. It wasn’t until after he left that I sobbed and sobbed. Still crying a lot today. The worst part was that I didn’t feel like I could communicate how I was feeling because it’d already happened. That’s my story, just looking for some support if anyone has some to give. Thanks folks~"
  },
  {
    "post_id":"7qx4lr",
    "title":"My Son was raped and we're struggling.",
    "body":"I wasn't sure where I could discuss this, and I hope it's okay if I talk about our situation here. I'm a mom of three boys and a girl. My twins who are 26, my third son who is 23, and my young daughter, 12. They're all precious to me and I'm so proud of them. I was relatively young (22) when I married my husband and had our first children, but more than anything I love being a mom and raising my twin boys was such an amazing experience, and my husband and I always planned on three children, and after three years we welcomed our youngest son into the family. By nature my third son 'C' was so gentle, well-behaved, creative and a little shy, in contrast to the boisterous and outgoing personalities of his older brothers, 'A' and 'B' (daughter is D, and the fact their first names are in alphabetical order is entirely coincidental). All in all he was an extremely happy boy. By the time our boys were 14 and 11, hubby and I agreed on having one more child, and I finally had a daughter, which I was ecstatic by to have a little girl. Around that time, C started to become a lot more introverted and unsociable. He was so excited about being a big brother, and he's always so protective and caring of D, she thinks the world of him, so I knew jealously didn't alter his behavior, but he at an age where puberty was starting to hit so I wasn't really alarmed. However through his teen years he appeared to be getting worse. His grades were falling, he didn't appear to have many friends, and he was so reserved and secretive and he rarely spoke. He was never aggressive, he just always appeared to be sad. I was worried that he was being bullied be he wouldn't talk to me, every time I asked it was always just \"I'm alright\" and \"I'm doing fine\" followed by a false smile. I tried my best to help him, and he did pass school and went on to college, and for awhile it seemed like he was doing better to come out of his shell but there was still always part of him on the defence. When he was 22 he came out to me as gay, and I was honestly so relieved when he did because I thought he was finally opening to me and that this was the reason growing up seemed so difficult for him. He's fully out and open to everyone now, and seemed somewhat happier but he still had a very quiet and reserved side to him that at this point I believed was just his nature, but he was still really struggling in college and depressed. Last year after arriving home from work, my husband told me that C was upstairs and he had something extremely important to tell me. We went to his room and he was distressed and in tears, trying to hold it together. After a little time he finally confessed that he was assaulted sexually when he was 11. I don't know many details, all he's told me so far is that it was more than one stranger, and that it was violent. I cried so much with him, and I of course told him that this happens to so many people, it happens to children, it happens to men and it is never the victim's fault. He's seen a doctor, and he's been seeing a therapist for about 2 months now, but I can tell this is so hard on him. He still tries to put on a happy face most of the time but he's struggling. Every day I'm so afraid for his safety and well-being. \n\nI'm finding this so difficult to cope with myself. I feel like a failure for not protecting my child. I should of seen all of the early signs that something wasn't right. I want to be able to fix this, I want him to have his childhood back, but I know I can't do that, and it makes me feel useless. I'm ashamed of myself, I'm hurt that he felt like he couldn't trust me enough to tell me when he was still 11. I don't know how to fix an adult. I don't know what I'm asking for here either, I just need to cry and vent. Does anyone have advice on coping? Or is there anyone else here any experience with being the parent of a rape victim? \nI love him so much it hurts. \n\nEdit: I truly want to thank everyone who responded with such kindness and excellent advice. On my off breaks I have been looking into counselling for Myself and C's dad. This weekend we will have a serious discussion about our options. My Son is a strong, nurturing, intelligent and beautiful young man and while I know No one can take on and fight this turmoil for him (even though he needs a break), he won't be alone. We will support and love him. His best friend knows as well, so he has support outside this household too. "
  },
  {
    "post_id":"2jae6i",
    "title":"I think I'm losing my mind. Need to vent incoherently to feel better.",
    "body":"I'm at a loss here. I have been in a relationship with the same guy for nearly four years and I'm experiencing a lot of issues. I know it's normal to discover that one's partner is imperfect, but I'm at a point where the \"imperfections\" are wearing on me. Since I don't post often, here's some background:\n\nI am a 27 year old female, he's a 31 year old male. We met at my place of employment when I was still working in bars. I'm in an office now and I work hard at my job. I have bipolar disorder, am a survivor of assault, and am actively trying to cope with these things. \n\nIn any case, I'm starting to think I'm losing my mind here and I guess I just need confirmation that I'm not alone with the boyfriend-related things that are driving me nuts. Sorry in advance for the rant. Here's the list:\n\n1. He will argue for the sake of arguing. Seriously, he'll argue about how I put his clothes away when I'm the only one who does it. \n\n2. He expects me to call him, then has nothing to say.  Um, I pretty much hate being on the phone unless there's a good amount of conversation going on. \n\n3. He lies to my face about ridiculous things and then tries to backpedal when I catch him in it. Yet he still thinks I'm the one to be wary of (probably a result of his parents'divorce)\n\n4. On more than one occasion, I've caught him looking at porn in the same freaking room I'm in\/looking at other women when we're out together. I hate to be judgy, but I can't help but feel like that's really pathetic. It's also really offensive and disrespectful to me that he'd behave that way around me. Of course, I'm of the mindset that he can't possibly love me if he hates women enough to objectify an entire gender at every opportunity. \n\n5. He's a lazy, unmotivated slob with no future- which it's something I could overlook pretty easily if #4 didn't grind my gears so much... But his behavior is really starting to rub off on me. \n\n6. I love him but I don't want to live with him anymore. He's a totally horrible roommate. \n\n7. Going back to the porn, I'm sure that's the main reason why he never initiates any physical activity with me anymore. \n\nI feel gross and unappreciated. Do you think there's any way to save this or should I cut my losses and move on? Is it reasonable that I'm annoyed\/bothered by his behavior that it makes me really question being around him? Sometimes I look at him and he just looks like another person, nothing special... Like the emotional connection has shorted out. \n\nSorry for rambling. I just need to sometimes. Bring on the downvotes for my hatred of pornography use by my boyfriend and his other misogynistic tendencies. "
  },
  {
    "post_id":"it7w0v",
    "title":"I'm finally going to share my sexual assault story with my partner of 2 years. I need some support.",
    "body":"*Trigger warning* *Abuse*\n\n\n\nAs the title states. This is my main account and I've decided I have no reason to hide. \n\nI've been with my partner for around 2 years. He's really great and makes me feel calm and loved. We are looking at getting a new place together and the topic of proposing has come up once or twice. But our relationship has felt a bit off recently, and it's ME. I've been guarded and in my own head. He says that he isn't sure what I'm thinking and can tell I'm dealing with something but figured it was due to stress from a recent surgery and the pandemic in general. \n\nBut it's because I've never shared my story of the abuse I faced in my last relationship. I've had about a million opportunities to tell him and could never get the courage or find the 'right time' but it's affecting me so much lately, I feel like I'm going to explode.\n\nMy ex would abuse me in my sleep. I researched his behaviour early on in the relationship and learned about something called sexsomnia. He was never diagnosed over the 7 years we dated but I always made the excuse that he had a 'medical condition'. I couldn't talk to anyone because I rationalized it as his business that I didn't have a right to share. I was an idiot. He was never fully conscious while he assaulted me, at least to my knowledge. I would wake up in the morning if I slept at all, to him happy and rested, seemingly unaware of what the fuck he did to me the night previous. I would share with him what he did and his usual response of \"so sorry!\" eventually turned into just straight up blaming me for him being repressed sexually, y'know what could I expect when he wasn't getting any?! (I have Endometriosis and sex is never a guarantee day to day, my pain always interfered.) It escalated over the years and by the end of our relationship just the thought of him touching me in anyway shape or form disgusted and horrified me. I cringed when him or anyone touched me. I eventually women'd up and got the fuck out of that relationship, but never took the time to heal and never looked back.\n\nI didn't think I was being abused at the time, but after working with a therapist I realized he was *never actually diagnosed*  by a medical professional. He actively and knowingly violated me for years. And blamed me for it.\n\nMy partner deserves to know before we get deeper into this. I finally texted and told him I needed to share something with him tonight so I couldn't wuss out and not say anything again. I'm freaking the actual fuck out and I don't know how to tell him. I wanted it to be in person so that if he had questions I could explain myself. If anyone has any advice or is willing to share their story, I would be eternally grateful. Thanks for reading if you took the time xo.\n\nTLDR; I want to share my sexual assult story with my partner before our relationship gets more serious."
  },
  {
    "post_id":"4i3gjo",
    "title":"I'm not sure where to post this, but I need some help and advice. I'm in my 20s and I want\/need a hysterectomy.",
    "body":"I've asked this here before, but was met with a lot of vitriol, but I'm hopeful I can explain my situation better and be met with more advice than down votes. If there's a better sub to post this in, please redirect me and I'll cross post. When I was 12 years old I got my first period. I spent three days lying on the bathroom floor, alternating between throwing up and sitting on the toilet, unable to think clearly I was in so much pain. By the fourth day, I took 4 ibuprofen in a row and was able to get up. I started going through a rather interesting puberty when I was around 13. My voice broke and deepened. I began growing a beard and hair on my chest and stomach. My acne went bonkers. My boobs grew in, oddly. They are not full, and even if they stayed this small, they are stuck at a rather immature, half grown in phase. From age 12 to age 17, I thought everyone had to leave school when they got their period. I thought everyone was overdosing on pain killers as their cramps started at their backs and went down to their feet. I thought everyone had killer hot flashes. But then I went to college and found out none of that was the norm. First gynecologist visit. I talk about my body hair, my facial hair, my random periods (one month, skip two months, then get it one week then a week later get it again), the pain I had during sex, how scary it was to poop while on my period because it hurt so bad, etc. She decided to take an ultrasound of my ovaries. My ovaries are littered with cysts. But it's not the worst she had seen. And it didn't explain all of my symptoms. Most, but there were a few lingering. So they do another ultrasound, looking not at my ovaries but around my uterus and surrounding organs. What they find isn't pretty. It's endometriosis. I was having such horrible pains because it's attached itself to everything. It wanted to be friends with all the organs I guess -.- I get put on birth control to help control it. We try a lot of different medications. My ovaries are making testosterone, my utuerus is acting clingy to all my organs and the symptoms go away while I'm on it,the second I miss a pill\/meds or try to stop it, I'm back on the floor 12 years old, wondering why it hurts this bad. I'm sorry if I'm ranting. I'm trying to give the full picture. I desperately wanted to be a mom. I knew even when I was young, I wanted to become a mommy and have kids. Thats' what I put up with it. Those periods were worth it because one day they'd result in children and I'd be happy. I kept telling myself, as I slept with ice packs and I popped pills, one day I'd look back and be grateful. Then my gynecologist tells me, with PCOS, endometriosis and type 1 diabetes of my entire life, I should not have kids. That I should consider a hysterectomy. I might be infertile. Even when off birth control, sometimes I've had unprotected sex and I have never gotten preggers. I've used plan B before, but not every time, and even statistically, on birth control you'd think it'd at least happen once in 7 years of being sexually active and not 100% sexually protective. But now, even if I did get pregnant, I likely wouldn't survive the pregnancy. My diabetes is a bitch to control, my hormones even controlled make it go wild. I'd have to get an abortion, because I don't think or trust my body to survive that. This utuerus isn't even safe for me to have, why would it be safe for a child? It kills me saying this. Writing it all out and admitting that I spent years of my life convinced all the pain was worth it. Now every period is a new agony. It's an agony knowing it's not worth it. Years of pain, hot flashes, cramps that rival contractions, and now three different doctors have all recommended hysterectomies to me. I've been friends with older women, childfree, who had endometriosis, not even diabetes and PCOS just endometriosis and they say it was the best decision they ever made. It tears me up, but I know it's what would improve my life. Going through a period is hell. If I miss a single pill, bam bleeding. Bam cramps. Hot flash! cramps, irritable, anger, frustration. The hysterectomy doesn't tear me up, but facing the reality that I will never get pregnant on my terms or be able to be healthy with it is frustrating. I reacted to this by becoming as masculine as possible. It's only now I've come to terms that I may lose the possibility of pregnancy that I've accepted being feminine. Three doctors. I need to find a new ob\/gyn who will do this to me, and I just don't know what to do. It's hard enough to find a doctor who will do this to a 40 year old. Why should it be like this? Why should I be reminded every month that my body can't do what I always wanted? Who do I talk to? How do I get them to listen? Can I ask them to let me keep my ovaries? The last doctor said to take out my uterus but to leave my ovaries, as they aren't too bad now (the cysts are less than there was before). I would have to keep taking hormones but I'd no longer bleed. I'd no longer have to fear the off-chance they're wrong and I get pregnant and then die. I don't know. I'm tired. I want to not be in pain for most of the month. I want to live my life. I want..."
  },
  {
    "post_id":"2ilir1",
    "title":"Guy jokingly told me he wanted to rape me...",
    "body":"So today I was at work (I work on my college campus) and two guys I've talked to a few times came in.  I was helping one of them with what he needed, and was chatting and making jokes with them at the same time.  Eventually we had everything sorted out, so the guy who needed help (we'll call him Guy 1) went to sit down in the \"lobby\" which is a few yards away from my desk.  His friend (he'll be Guy 2) stayed at my desk to talk to me.  Guy 1 said something I didn't understand, and this is how our conversation went.....\n\nMe:  What did you say, Guy 1?\n\nGuy 2:  He said he wanted to race you.\n\nMe:  Like... in his car?\n\nGuy 2:  Yeah!.... at least, I think so.  He might have meant the OTHER \nfour letter R word he could do to you.\n\nMe:  .... Uhm, I would really hope he wouldn't want to do that to me.\n\nGuy 2:  Hey Guy 1, did you want to RACE her... or do the other four-letter R word to her?\n\nGuy 1:  Oh, I want both.\n\n....... and then he looked and smiled at me in a sly way.  I felt like I had to try and be professional because I was at work, so I responded (also keep in mind I'm absolutely SHOCKED anyone would ever say this to me) by saying, \"Uhm... wow.  Okay, don't EVER say anything like that to me again.\"  They both just laughed it off and kept trying to make conversation with me.  I think they could tell I was upset, so they eventually left.\n\nI'm just extremely upset.  I was shaky the rest of the day, and one of my supervisors thought I should report it.  Another of my coworkers told me I needed to calm down because, \"he meant it as a compliment.\"  But what kind of compliment is that?\n\nI guess I'm looking for advice.  What do I do?  Should I talk to him?  Should I ask the school counselor for advice?  I feel very uncomfortable and don't even want to go to the class I have with him."
  },
  {
    "post_id":"zvp1ib",
    "title":"My boyfriend’s ex keeps texting him and it makes me feel horrible",
    "body":"[19F] so my bf and I have been together for almost a year, long term, complex relationship with a long past. Literally haters to lovers type of things. Something really strong. I trust him and I know he’s not going to do anything.\n\nHe has this one ex who he dated for only a month almost a year ago. \n\nHis ex first texted him a while after we got together, they texted for a bit and he told her he has a thing with me (we weren’t official yet) but not in a way she got the hint. Afterwards he blocked her and they didn’t talk for a while, that was more than half a year ago.\n\nTwo months ago she texted him again through her friend’s account (because she’s blocked everywhere) and asked him for closure. He talked with her a bit and told her he’s taken (we were official so he literally wrote her he’s in a happy, healthy relationship) then blocked her again and her friend’s account and asked her not to contact him again. \n\nA few days ago she texted him AGAIN, now being more bold and telling him she’s still in her mind. We once joked about sending her a picture of us the next time she texts, but I didn’t feel comfortable with that because I thought it’d be super insensitive.\n\nHis ex had a complicated life and she suffers from multiple mental illnesses, so I’m being more sensitive about it but still, I get sick to the stomach when it happens. I’m very insecure about myself and I’m trying my best to be the best girlfriend and I can’t help but think she’s so much better than me. I struggle with expressing and talking about how I feel and the fact she just can say it through text makes me feel horrible that I can’t. I can’t be affectionate as she is and she might’ve been a better partner than I am. I literally have these thoughts everytime it happens despite knowing my boyfriend loves me and that he’s not going anywhere. And it makes me feel like a bad gf and a horrible person. \n\nHe told me about everytime she texted him and showed me the conversation before deleting him saying he wants her out of her life and regrets the relationship with her, so it’s not his fault that I’m super insecure and get panic attacks everytime it happens. I literally feel sick to my stomach and can’t eat anything and I feel like it impacts me too much and I don’t know what to do. Any advice?"
  },
  {
    "post_id":"1cxxf5c",
    "title":"I (29M) Got My Heart Broken By the First Girl I ever Opened Up to",
    "body":"I wanted to make this post because I am in a lot of pain after things ended with a girl I had been seeing for a few months\n\nFor context, I dated a lot in college but was emotionally unavailable during that time due to early childhood trauma and being on SSRIs and ADHD medication my whole life. I never really learned to feel feelings until I went off meds after college. I also got Lyme disease after college and didn’t date from 24-29 because of it. So I had never truly opened my heart to someone until I got off meds, treated my Lyme, and did a ton of work in therapy.\n\nFast forward to March 24’ - I met this beautiful girl through a mutual friend and we went on a few dates and hit it off pretty well. I invited her over for dinner on the second date and cooked her a really lovely meal which she enjoyed! We had been flirting over text prior and it seemed like we were both of the mind that physical intimacy was on the table that night, but I didn’t plan to have sex because I wanted to take it slower. We made it to the bedroom and she informed me that she had an STD, to which I didn’t really know how to respond. We were both drunk at that point and I got excited, ignored my original intentions, and tried to have sex anyway without really asking her about her condition, which was not smart I realize. I struggle with ED and even though I didn’t intend to have sex with her, I was able to get it up so I figured “oh shit I have to act on this moment, but as I was about to engage, I couldn’t and I mentioned I got “thrown off” by her comment and we decided to just cuddle instead. I followed up with her the next day and tried to be as much of a gentleman as I could, explaining that it takes a while for me to be vulnerable and I wanted to take it slower with her, but I had a lapse in judgement that night. \n\nWe ended up going on a few more dates and finally engaging in physical intimacy. She also told me at one point after the STD mixup that she liked being single.\n\nAfter our fourth date, I started being more intentional with her - being more forward about seeing her, and dropping in nice comments into what was mostly sexual banter between us. She didn’t respond well to that, even noting that one of my nice comments “was the worst thing I’ve ever said”.\n\nCome the fifth date, she is super distant and even says to me “I’m going to ghost you after this”, and made it clear that she didn’t want me to meet her friends either. After that date I followed up with her to explain how I was feeling, and we decided to move on.\n\nI can’t help but feel like I was “fuck-zoned” and thrown away by this girl who I really fell for, and in the end she was super unkind to me. Our mutual friend told me from the start that he was worried about how she might treat me, but I ignored him because I was smitten with her.\n\nThis was two weeks ago and I am still in a ton of pain. I wanted to post this here to try and get a feminine perspective on the situation. Thank you!"
  },
  {
    "post_id":"6cipjs",
    "title":"My period is 2 weeks late & angry at my BF of 5 months. Please help.",
    "body":"Hi all, \n\nIn short, because of some very stupid decisions made during sex between my boyfriend and me, there is a chance I am pregnant (I'm 18 years old). Please, please don't bash me for this because I already feel terrible. My boyfriend and I have been together 5 months and usually have sex with condoms (even so, he's not allowed to come inside me). Sometimes, though, in the heat of the moment we'll have sex without condoms... I've had to take Plan B about 4 times in 3 months! Usually this happens because we'll be messing around and he slowly puts it inside of me without a condom but the consent is murky, and this past time I'm not sure I've consented to him putting it in me without a condom. \n\nBut now my period is 2 weeks late and I am incredibly angry at both him and myself... angry at him for not putting on condoms and angry at myself for allowing it to happen and not saying \"no\". I've already taken 3 pregnancy tests that all said not pregnant but I'm still terrified because I took those only a few days after possible conceptions. \n\nI'm even angrier because while he's a sweet, respectful guy, if I do have to get an abortion there's a chance he'll be states away and not physically be there for me. He'll be with his family in New York while I'm stuck with the physical pain and worry in a southern state that hates abortions and girls who get abortions. I don't have anyone to turn to if I need a ride or a stay after getting a medication abortion. My boyfriend is willing to drive down a few cities to help me out as long as he's in the same state but I'm angry at him for not willing to help me out if he's in a different state. I'm angry because it's mostly his fault (I say mostly because I didn't explicitly tell him NO) for not using a condom this last time, and for not going out of his way to buy a plane ticket and find a way to get to me if I do end up having an abortion. \n\nPlease, please help me with some advice... do I stay with my boyfriend? What do I do about the potential abortion? Is he terrible for not willing to leave states if I get an abortion or am I expecting too much? Thank you.\n\n"
  },
  {
    "post_id":"58ia59",
    "title":"Any advice for a young mother who wishes to give up her life and her job and house and her 8 year old daughter for a month to travel abroad?",
    "body":"I am 25 years old I have an 8 year old daughter whom I split custody with her father. I work as an RN working on my BSN. I rent a nice house for us. Ultimately I want a home and family. But to cut the story short. I just got broke up with and ...this is a repeated pattern. I'm ready for a change. As much as I want to stay here and find love its not happening. So I'm ready to travel. I really need someone to talk to. I have no idea what Im doing or where to go.  I have already talked to a friend who will let me stay in his house for 2 months while I continue to work and save up money. I realize I have a car payment\/insurance, two cats and a cell phone bill that I will need to pay at least three months in advance. \nThis is the hardest decision I have ever made, but I need advice and encouragement. \nI assume I will be able to do my online  courses from abroad. \nIs there anything I should prepare for?\n\nMy next steps include. Telling my landlord about this plan ( he wont' be happy)\n\nAnd telling my boss I need a month off of work. ( A very feasible possibility)\n\nPacking up all my stuff \n\nAnd then ulitimately leaving my daughter for 30 days while I do what I need to do in order to discover what will make me happy\n\nI mainly want to know how to use my cell phone. I called my Us cell company. I have a galaxy s7. I was told about how expensive it can be. So I thought maybe I could just maintain that line..while getting a rental? Or possibly even buy a phone card?\n\nMy next dilemma is where I'm going to go or stay. As a smaller female.. I am scared for my safety but right now .. I just want to take that risk to see Rome  and also travel to France as well. I thought about couch surfing. Are country to country flights cheaper within Europe? Any advice is very much appreciated. Leaving my daughter is so hard for me to do. She is the only one I have in my life. My mother is not  there for my and my father is dead. But i'm so depressed I feel I HAVE to do  this to make myself happy. "
  },
  {
    "post_id":"6gq1cy",
    "title":"I can't get over my ex...I can't move on in life",
    "body":"My ex and I broke up about 8-9 months ago (October 2016) and I can't get over it. I've attempted another relationship since then but it just doesn't compare to what I had. I thought I would marry this ex. This is the second time in my life, over the course of 11 years I thought I would marry someone. I'm losing hope. I don't think I'll ever find someone. Please help, I don't have any hope and it hurts..."
  },
  {
    "post_id":"1f65ouy",
    "title":"School staff member looking at my chest area.. Need advice!",
    "body":"I don’t know if this is the right space to ask this but I really need help, so I am a 14F (9th grade) and there is this person who works at my school, i’m not really sure what she works as but i mostly see her in the deans office half of the time. When i was walking to class, she asked if i needed a bra, I told her no and that they made me uncomfortable so I don’t wear them as much. She kept pressing about it and said that she looked at my breasts yesterday but didn’t say anything. I was very uncomfortable at the fact that a grown woman was staring at my breasts two times in a row, She told me that she’ll get me one knowing that I told her specifically that they just made me uncomfortable and I don’t wear them as much. There’s no dress code for this or anything, just don’t wear anything inappropriate basically. I was wearing a black shirt that covered basically everything and I don’t do anything to pull attention to my chest area. so, another day comes  and it’s really embarrassing because she literally put bras on her computer and called me over to her computer when there’s people in the office who can see and tell me to choose one that I would want, and she just kept pressing about this and pressing over and over again. It has overwhelmed me a lot. So, when the package arrives, she gives it to me infront of like two other students in the office and another person who works there, so i’m feeling a bit humiliated already. She tells me to try them on, I go in the bathroom and i try it on and it is extremely tight and uncomfortable. Before that, I asked her if i had to try them on because in my head i would much rather just try them on at home in a private space. She tells me yes and that she’ll love me forever if i do. I tried it on and yeah it was uncomfortable. So, I just leave the package on her desk and quickly leave because I am feeling overwhelmed and embarrassed. I didn’t leave the bra on because of how tight it was so i just put it back in the bag and left. The next day, I tell her that it was uncomfortable because she had found me in the hallway and she told me to come to her office again next Thursday to pick out another few. this has been going on for weeks and like she just won’t stop even after I show her my uncomfortableness. I told my mom about it the first time it happened and my mom agreed with her, my dad was the only one who found this weird. I asked my boyfriend what should I do and he told me that I should just deal with it. I mainly wear baggy clothing and I remember she called my mom and told her that if she noticed that I wasn’t wearing one then boys could’ve been looking at my chest too. so I have been self-conscious about my chest ever since and I don’t leave anywhere without a jacket on even in hot weather. I barely know this woman , I only spoke to her a few times throughout middle school, but it was never like being THIS comfortable with each other. she won’t stop and it has made me not want to come to school because I know that she’s going to make a comment about my breasts, because now that’s the only thing she’s even talking to me about. so I hope I’m not just being dramatic, but I really do need advice on how to navigate this because I’m very uncomfortable with this whole entire situation and I don’t know who to turn to."
  },
  {
    "post_id":"2q40c3",
    "title":"Abusive ex hacked into old dating profile and is baiting men to harass me. Terrified and alone.",
    "body":" When I was 19 and fresh out of inpatient treatment, I met a 25 year old man on Okay Cupid. I wasn't in a place to date him seriously, as I was transitioning from having no control at all (treatment) to finally figuring myself out. However, he pressured me again and again to date exclusively, and we ended up in a two year, horribly abusive relationship. \n\nThe first red flag:  one of the first times I spent the night, after passing out drunk, he took my phone and went through all my texts. A male friend texted me. In the morning, he threatened to kick me out. \n\nThis set a precedent for the rest of our relationship; he systematically found any social media account I had ever had, read what he wanted into my email and texts (male friends texting me; e-mails from photographers asking if I was comfortable with nudes) and would harass me about the information found afterward. When I say harass, I mean unending verbally abusive texts about me being a slut, untrustworthy etc, him never being able to trust me again. Calls and calls and calls. Unending. When I once told him I was changing all my passwords, he told me that was unacceptable because he \"needed\" them in order for me to prove I was loyal to him. \n\nI never cheated once. Not after he fucked me multiple times while I was passed out (I remember waking up in bed next to my best friend to him thrusting inside of me). Not after he shamed me for my clothes, telling me I was eliciting too much male attention with this shirt. That dress. Those shoes. Not after reducing me to only my sex. Not after shaking me and intimidating me during our arguments. \n\nAnd then it came. Two years, a horrible eating disorder, shattered self-esteem later...we broke up. I thought I could finally rest and order myself together like I've honestly needed to since I was 19. Nope. Last night, he broke into an old dating site of mine. He swept through everything. He texted me non-stop about what I whore I was. Said he was glad to know he was right all along, that I wasn't to be trusted and I betrayed him. Note: every message sent on that dating profile occurred after our break up. Further note: his betrayal refers to us talking about how we would use the time a part to work on ourselves and become healthier people. A part of that was not pursuing anyone romantically (though no mentions of sexually). I wasn't pursuing anyone. I have very low self-esteem and when I am alone I use online men to validate what I perceive to be a disgusting, unloveable girl.\n\nHe has locked me out of it so I can't delete it. I have been getting increasingly sexual text messages from men I don't know all day. I am afraid he is impersonating me and baiting them into harassing me. I am so overwhelmed. \n\nOn top of this, I have a severe eating disorder and social anxiety, which our two years together only made worse (i.e. him reducing me to only the sex I was or was not having). I feel worthless. I feel afraid, of him, and of his words - what if he's right and I really am just a whore? I honestly don't know what to do. \n"
  },
  {
    "post_id":"5lzkev",
    "title":"I am a healthy weight, but mom won't stop body shaming me?",
    "body":"I normally don't post things like this, but I have nowhere else to go. I am 5 ft 3 in and around 130 lbs. I'm home from college for winter break, and am at a loss. My mom, who has always body-shamed me and told me to lose 5-10 lbs, is more aggressive than ever about it. I'm getting married in 5 months, and she is constantly on me about my weight and my 99 lb sister has also started a little too, albeit more gently. My own father even told me I could stand to \"lose a few pounds\" and my mom even cried when she saw me in my wedding dress, not because I was beautiful or grown up, but because I had \"gained so much weight.\" My wedding dress is a size four and fits me perfectly. I've always had body image issues (wonder why lol) so I have been trying to practice body love and list out things I do like about myself, and this morning was feeling pretty good about my body. I casually remarked that I'm skinny and my mom immediatly retorted \"you aren't skinny. You aren't fat, either, but you're definitely not skinny.\" Then she plays the victim when I get upset and says I'm \"too sensitive.\" Our family dynamic is very involved, so I can't just walk away without being guilted by everybody in my family and breaking my mom's heart, because she honestly believes she's helping me. I have tried everything and am at my wit's end here. I'm afraid I won't feel beautiful in my wedding because of the constant put-downs. I can't bring this up with my fiancé either, because he is already about to tell my family off, which would alienate us both because my family is very traditional. Any advice on how to move forward?\n\nTL;DR: I am healthy but whole family, especially mom, keeps body shaming me. "
  },
  {
    "post_id":"1cryrra",
    "title":"Terrified for Internal Ultrasound!! Help :(",
    "body":"A few weeks ago I found out I was pregnant. I have only ever been with one person sexually and I have never been to an obgyn. Tomorrow is my first appointent and they have \"US endovag ONLY\" listed for my ultrasound on mycharts and I have been in panic mode ever since. I was kind of expecting it but having a stranger stick a wand in me or their fingers even or even just looking at me is a fear worse than death for me. Does anyone have any advice that would help me calm down a little or help me through it? my bf and I are going out to watch a movie and eat dinner after to distract me but i am still so terrified by the thought of someone looking at me or sticking something in me. \n\nEveryone keeps telling me now that I am pregnant its not about me anymore and I know I have to go in for this ultrasound to make sure my baby is okay but it doesnt make it any less terrifying. Everyone tells me its not a big deal and downplays my emotions but god im mortified anf i dont know what to do. I guess wish me luck. a little overdramatic i guess but when i found out i sobbed and had a panic attack for an hour and a half. never been touched nonconsentually but for some reason people keep assuming this is my problem when i tell them im terrified. thank you all for your help!! "
  },
  {
    "post_id":"bojf8w",
    "title":"I don't know if I should leave my terminally ill husband.",
    "body":"I'll try to be as detailed as possible\/try to explain as best as I can but I'm forgetful and might have to edit to elaborate.\n\nI'm in an abusive relationship; my husband is physically, sexually, mentally and financially abusive. I'm 19 years old and my husband is 30. we met and started dating when I was underage (I was 14) but I was isolated and alone, none of my family cared about me so I didn't have anyone to tell me that maybe this relationship was wrong. We got married the week I turned 18, and this January, we moved up north, close to the border of Canada, in the middle of nowhere. And I mean NOWHERE, the nearest store is 15 miles away, the hospital is even further and I'm wheelchair bound and can't drive.\n\nso I'm trapped and isolated, and I have a 3 year old son, and an 8 month old baby (both are his kids). and this week, I found out that I'm pregnant. so I'm feeling even more trapped, especially because I don't work and he makes all the money. even if I could physically leave, I have kids, I'm pregnant, I'm disabled and I didn't graduate high school so my job choices are slim to none.\n\nfor more context, I'm disabled because, over the last couple of years, he has repeatedly dislocated my hips. And, the last time he did it, when we moved, he kept me from getting medical treatment, so the bone started dying. there's no way to reverse it, just slow it down and help deal with the pain, which I can't do either because he won't let me go to physical therapy.\n\nalso, I can't go on birth control. the pill has really adverse and severe side effects, and Im very forgetful so I miss days, which negates the whole point of taking it. and this pregnancy actually happened while I was on the IUD, so even long term birth control doesn't work. I dont know why. and because I can't go on birth control, I have had multiple pregnancies, one after the other, but most have ended in miscarriage because of all the stress and physical abuse.\n\nBUT, the main reason leaving has been an option recently is because in March, my husband was diagnosed with something terminal and was told that he probably had 2 years left. 5 maybe; a 20% chance he'd make it to five years. and I dont know if I should just stay with him for the rest of his life, or if I should just leave him. it would seem cruel to leave him while he's sick, but he's not himself lately because of the medicine he takes. I managed to get a job babysitting my neighbors kids (its only 20 dollars a day but I can take my kids with me) without him noticing because he's either at work or asleep. that never would have happened before; he's always maintained a firm grip on my freedom and finances.\n\nso, like I said. I don't know if I should leave while I can or just wait it out. it seems cruel to leave. but there's always a possibility he'll make it to 5 or even 10 years, and if he continues to be as abusive as he always is (or even worse), I'll probably die from the physical abuse (he's actually nearly killed me multiple times and my throat is permanently damaged because of it).\n\nedit: the one thing I forgot to mention was that I have reported him multiple times to the police and to doctors. every time, he managed to get the police to believe him and not me, even when I was a minor. he'd purposefully hurt me in ways that looked like self injury because I have a history of depression and suicidal tendencies. he even once had me involuntarily committed to a mental hospital after I tried to leave him; he had told the doctors that I was suffering from postpartum psychosis (this was after I had my 8 month old) and they believed him because he works in the medical field.\n\nedit 2: this is a crosspost r\/relationship_advice"
  },
  {
    "post_id":"2g75r7",
    "title":"We took the decision to have an abortion in a panic and now my wife focusses her sadness as anger towards me. I need help to safe our mariage and family.",
    "body":"To give you all the background this is going to be a long story, but your help will be most appreciated.\n\nWe are a married couple, 34 and 37 years old, with two beautifull children, almost 2 and 4 years old. We are from western Europe, but now live in Japan. We came here 1,5 years ago for my job, a big opportunity to create more security for our family, but my wife had to give up her job for my career. This is not the issue, we have been very happy for the last 18 months here, but it is important to realise that she made a great sacrifice for my career and financial security for us as a family. \n\nAfter a great holiday back home with a lot of hapiness came the shock. After not getting her period we became worried and a few days later found out that my wife was pregnant. Both her and mine initial reaction was panic. I will try to describe why we panicked. It is very expensife to have a child in Japan and even though we have some savings, they would be completely wiped out by having another child. Also it is very impractical to have 3 children in Japan, this country is not set up for large families. We both felt that the strain this would put on our family would be very big and that we would be able to offer our 2 children much less. Then I mean things like going to the park, sports lessons, music lessons and international school. Then there is the medical condition of my wife, she has chronic high blood pressure and the previous 2 pregnancies have been anything but easy. The whole generation of her father has died before the age of 45 (all 7 brothers and sisters!). Somehow this was only a concern for me and she did not take this into consideration. \n\nBoth our initial reaction was this is never going to work and that we need to have an abortion (we are from a liberal country and are not religious and she had an abortion 12 years ago when we were students). We discussed the situation and what to do for a few days and my decision tended to take an abortion. I made it clear to her at that point that thats how I felt and that I felt this way mainly because of her health. All the operational and financial issues can be solved, but i have a real fear that she will lose a few years of her life by having another baby. My biggest fear our whole marriage is losing her and being left alone with 2 children that we love dearly. I also told her that it was in the end her decision as it is her body and she would have to do all the work, whatever way we would go. Her decision was then to take an abortion, and to do it fast. So one week after finding out we were pregnant she had an abortion. This in itself was a very unpleasant experience. I could not be with her (not allowed by the clinic) and the staff only speaks Japanese, and she doesnt.\n\nNow we are 3 weeks further and the problems this has brought along are much bigger then I, and her, expected. Obviously she was very sad with what happened and the regret is very big for her now. I also have some regrets, for me the decision was something like 60\/40. The problem is that her pain and sadness has taken the form of anger towards me and in a lesser extend to our whole family. She says that when she sees me, she is reminded of her loss and that she feels that I have taken something away from her. Also she can not really enjoy time with our 2 children. She still loves them and takes care of them, but she says the hapiness is gone. I really want to help her with her pain, but she will not open up to me emotionally. I am afraid if we can not get this fixed it will break us apart and we will all lose what we love most. \n\nI have many regrets now. I should have told her about my worries for her health and life before and we should have discussed about having a 3rd child much sooner. We have been really stupid not really talking about this. I feel now that it was better to keep this baby. It would have been hard, but the current threat to our hapiness is much bigger. \n\nI would really like your advice in how to deal with this situation. How can I help my wife, and how can I reestablish an emotional connection with her? If you have any more questions about our lifes or situation, please ask, I will be very open. This is a throwaway so I dont have anything to hide."
  },
  {
    "post_id":"xd3yby",
    "title":"I might have the most insane case of internalized mysogyny",
    "body":"\nSorry for this rant but I really need to get this out of me. I truely hate the way our female bodies are. I hate the fact that we are basically alive incubators. Our pelvis is designed to shit out babies. Our vagina is lubricated so the male dick can slide in. Our boobs are for feeding babies and male looks. I sometimes literally feel dirty and repulsed bc i have boobs and a vagina. I hate that every man wants to get inside me and have sex with me. And we dont even orgasm that much from PIV sex, like you give us vaginas and then we cant even come from straight sex with men? What a joke, as least mother nature blessed us with a clitoris so we can have at least some fun out of life lol. \n\nOur design isnt even that good tbh. Especially when talking about pregnancy. Human pregnancy looks like something straight up out of a horror movie. Blood splashing everwhere, the mother is in incredible pain, the baby is crying, sounds like a murder scene but naw its Just how it is. Animal mothers give birth easily. Horses literally give birth standing up, and the baby is ready to go, it walks already. Our babies require non stop attention, you Gotta watch out for their mushy ass head and it doesnt even walk until like 2 years old. And our babies are TOO BIG they tear apart our vagina and we have to get stitches. Like, we could pop out a baby size of an egg and it could grow overtime but nawww its Gotta be BIG. \n\nI also hate the way women are naturally more submissive and shy and prone to manipulation. I hate how we are more emotional. I hate how weak our bodies are. Naturally. Male bodies are made for running, being athletic, strong, they develop muscles easily, we dont. Our bodies develop FAT easily. At least in animal kingdom females and males are more so the same in size and females are strong and hunt. For example lionesses, they are the hunters, they can fight of male lions if necessary. Female horses can fight off horny males by delivering a fatal kick in the head. But we are weak, we cant fight off rapists and murderers. I hate it. At least we could have some sort of barbed wire vagina, to prevent rapists but nawwww we cant have nothing. We rely on other males to protect us bc we be too weak. And they are our natural predarors. We are like gazelles and they are the lions. We should be wary of them but instead we are attracted to them. Its crazy. The gazelles hate lions but they want to be them. Bc Lions are in charge. \n\nIdk i really am sad. Sometimes i think, what did I do to deserve this. Why am I naturally like this. I want to feel better about myself but idk what to do. I want to feel good inside my body but I Just cant. Anyone else suffering from internalized mysogyny?"
  },
  {
    "post_id":"viyh2v",
    "title":"i feel sick after having sex.",
    "body":"hello, ive been with this person for about 5 years now. we've been through a lot of toxic stages. but now im atp im just chill, i feel nothing and numb. maybe because of my childhood traumas and traumas from him that it is hard to say ily to him. so during sex i dont feel so excited or aroused i just do it because he wants it and im here just going with the flow but after the sex i will just excuse myself to the wash room and tell him i wanna take a shower then i will cry. i feel so dirty in a negative way. why am i not happy. can someone help me."
  },
  {
    "post_id":"f04b75",
    "title":"My boyfriend of 7 years left me today because I wouldn't perform oral sex on him.",
    "body":"CW: Sexual assault, men\n\nThrowaway.\n\nI don't know where to start, I'm pretty angry and sad because I thought this was *the one* (I know, I'm dumb). We were together for 7 years (HS sweethearts) and in our 20's, we lived together for 5 years and have 2 dogs. Last night I went to sleep cuddled up on him like always, everything was normal yesterday and today suddenly I got hit by the \"talk\" after lunch.\n\nSo he's always loved the idea of blowjobs but since I was his first gf he's never gotten one, because my boundaries state that I DO NOT DO BJ'S. Why? Because I was forced to give them to entire groups of boys in junior high, I was coerced, they had pictures of me naked that I sent to someone I trusted. It started out with only one guy but he brought friends once and so on and so forth. I don't really want to go into any more detail. The issue is solved, police were involved.\n\nHe knows this is what happened and the reason I don't want to give BJ's anymore, at first he was ok with this but sometimes he would slip and ask me if I'd be willing to try it, I always said no. He respected that for like 3 years until late 2019 when he asked again and I again said NO. It made me sad, I would instantly cry when he brought it up and last year was no exception even though it had been so long since the last time.\n\nToday he sat me down and asked me if I still felt this way and when I said I did he asked me to try therapy. I asked for what? I don't *need* therapy, I just want to keep penises away from my god damn face. He said this was selfish and that if I'm not willing to fix my problems with penises that we could no longer be together, then he got up and left, told me to think about it and he will be back tomorrow.\n\nHe said he read various posts online about people in unfulfilled marriages and partnerships where everyone always replied to the OP that they should dump their partners because life is too short or something to be sexually unsatisfied. I don't think this is fair, it can't be that important to want to leave me. I'll do literally anything else he asks in the bedroom except for this, how can it be a dealbreaker?? Not like I'm not having any sex at all with him.\n\nAnyhow I'm super frustrated and don't really have anyone to talk to about this, it's just too humiliating. If anyone can offer advice I'd be truly grateful. Thanks TwoX."
  },
  {
    "post_id":"1apo4le",
    "title":"Friend got with me while I was Overdosing and I don't know what to do....",
    "body":"About a month ago, just after christmas, I found some klonopin in a draw. I called up my best male friend at the time and told him to bring some weed over. I told him how much I was taking (around 3mg without tolerance) and he met me at my house. He forgot the weed so I instead suggested we drink. I ended up having about 10 shots of gin, and he had around 7-8. As well as this, my stupid barred out brain told me to take a bunch of Tramadol and other assorted medications, Trazadone, a pack of hayfever meds etc... (I was in a very bad place and have struggled with my mental health for a while).\n\nAnyway, as would be assumed, I blacked out after that and have literally no memory of anything- until I was riding my bike along a highway at 2am to his house (I don't know why, I think he told me to). Once I was there I realised that I was no longer in my previous outfit, and was not wearing a bra or underwear under my clothing. Asking him about it, he told me we had made out and I had given him Oral, and my clothes had been taken off.\n\nThis was especially disturbing to me as I have never ever been into him or any other man, and have identified as a lesbian since I was around 12 years old, which we talked about alot and was very very clear to him. He, on the other hand, had made uncomfortable comments in the past about how I looked, and how pretty I was etc. I then blacked out again and remember waking up in my bed. I once again questioned him about what had happened and he responded with meme-y smiley faces and a comment of \"8\/10 Blowjob very good\". He also told me that he had said no at first to \"my initiation\" and then \"let it happen\". I have zero trace or memory of this happening whatsoever.\n\nFrom here, I felt very uncomfortable so I blocked him, and the next day I found a video he had recorded of me on my phone. It was him saying: \"I'm here with Glass-Session-1198, say it, say the word, 3,2,1, say consent\" to me. In the video I cannot keep my head up and cannot speak properly, but he is able to.\n\nI sent him the video and asked for an explanation, where he stated I was begging him to do stuff and he had rejected me several times before \"giving in\". Again, he watched me take several sleeves of medication and knew I was very very gay and not at all interested in him. He then claimed that I had done harm to him instead of the other way round.\n\nPS. I have stopped abusing pills, and I am underage, and so is the boy. He took me to his family christmas etc and we had sleepovers before this. I have tried my hardest to lay this situation out as bluntly as possible, as he goes to my school and seeing him makes me panic really bad. I don't know what to do and as a young girl I would really appreciate some help and advice."
  },
  {
    "post_id":"5geguh",
    "title":"I need help. I don't remember anything from a drunken night.",
    "body":"A couple nights ago I woke up next to a guy without any clothes on. As I was waking up he cuddled up next to me and then strolled off to the living room. The night prior I remember having one mixed drink, 2 shots, and played one round of beer pong. I know how much liquor I can handle and that was no where near the amount that makes me black out.\nWe made a beer run and got back and I noticed that this guy that I've met once before was there. Our last encounter was not very pleasant, in fact it was very strange. He got really pissed off that I didn't want to sleep with him. I tried to avoid him as much as possible. Next thing I knew I woke up next to him the next morning naked. As i was putting my clothes back on I noticed that my shoe was completely broken, the whole strap was 100% detached. \nI don't remember fucking this guy at all and that makes me so uneasy! I remember one snippet but it feels like a dream so I don't know if this actually happened or not, but I'm having flashbacks where I'm laying on my stomach and he's on top of me with his hand covering my mouth. Like I said, I don't know if that actually happened or not it feels like a dream. I feel so disgusting and violated. I came home that day and spent about an hour in the shower but I still can't stop thinking about it. \nI'm making this post because I was clearly intoxicated but I wanted to know your guys thoughts on intoxication and consent. Do you think someone who's obviously under the influence can give consent? "
  },
  {
    "post_id":"et3kgk",
    "title":"I was sexually assaulted by another girl when I was young- get the feeling it’s antifeminist to discuss and doesn’t fit cultural narrative of men hurting women. Ashamed.",
    "body":"Throwaway acct. Sorry.\n\n\n\n\nWhen I was 10, something happened with a 13 year old family friend’s daughter. It’s only recently that I’m able to identify it as assault rather than just an early sexual experience.\n\n\n\n\nI’ll spare the details, but I will say that I thought she was cute and I just wanted to cuddle and maybe kiss. Instead, she did something unwanted and something, er, tore. I thought I had started my period but I didn’t actually get it for another three years. Yet, I also experienced my first orgasm, and she told me not to tell anyone or they would think I was gay. (Spoiler alert, I am *now*, but I didn’t want to be that then!)\n\n\n\n\nI tried to talk to my wife about this, but she just said, “well, shit happens.” I can’t blame her, because she was abused by a male relative for *years*, so what happened to me is probably just a normal childhood day for her.\n\n\n\n\nBut the thing that bothers me now is that I can’t talk about this, even with MeToo having happened. It’s seen as normal and brave for women to expose and discuss the men who assault them- but where does the LGBT community fit in? I also feel that current discourse around sexual assault tends to paint women as blameless, like victims. \n\n\n\n\n\nSo what can one do when a woman or girl *is* the predator? I even struggle with the language surrounding what happened. I can’t exactly call it rape because of the lack of, er, a penis.\n\n\n\n\nHas anyone had a similar experience?"
  }
]