[
  {
    "post_id": "11adqg8",
    "title": "Son needs to grow taller immediately",
    "body": "My 2.5 year old has hit the exact height where when I pick him up for something, he kicks me square in nuts every single time. He clearly does not want another sibling"
  },
  {
    "post_id": "1aoddc3",
    "title": "Boy dad of a 2yo. Found out a girl is on the way. What should I know?",
    "body": "Feels like a lot more pressure but I can't explain why. What do I need to know?!"
  },
  {
    "post_id": "5e7om5",
    "title": "How late did your baby start eating regular food?",
    "body": "We're at 7 months and he's really not into it. Will take a few spoonfuls and the closer to the middle of the day is the most likely time he'll eat it (daycare). \n\nSeems to have no taste for sweet things like bananas or the pedialyte he needed this past weekend fighting a stomach bug. \n\nHe's a big boy and growing fine on formula, otherwise. "
  },
  {
    "post_id": "yn85xq",
    "title": "how much can your toddler eat?",
    "body": "I just witnessed my 17 month old eat a quantity of goulash that I would have served to a 10 year old boy. \n\nI gave him a half cup to start thinking he probably wouldn't finish but he kept wanting more until he finally was satiated at nearly 2 cups. \n\nHe doesn't usually eat that much! I'm slightly concerned but also impressed. \n\nWhat's the most your kids have eaten that surprised you?\nShould I be concerned?"
  },
  {
    "post_id": "oxvtuk",
    "title": "What song do you sing or hum to your kid to get them to sleep?",
    "body": "Just curious what other people do or if you have a random song you use.  I personally hum the Jigglypuff lullaby and that's always seemed to work for me."
  },
  {
    "post_id": "360rvv",
    "title": "So the lawer broke my heart... [update from yesterday's post]",
    "body": "I posted yesterday about my possible custody case.  I had a lot of great encouragement, and advice.  I went to the lawer this morning before work.  He said I had a good case for establishing 50/50 at least.  He said we could file for no contest since she probably won't be able to get a lawyer.  He said we could get visitation rights established within a week.  Then he told me my group legal would only cover 15% of the cost.  He told me the longer I wait, the harder it will be.  I can't even afford to drive to see him every week, let alone afford the lawer.  I had a panic attack at work,  cried in front of everyone.  I'm crying right now.  How do you guys do it?  How do some of you deal with a hole in your very soul? I'm just so scared and I don't know why."
  },
  {
    "post_id": "5jo4on",
    "title": "Anytime you feel like a bad parent remember that a monkey mom had five monkeys fall off the bed. Each time she had to call the doctor for advice.",
    "body": ""
  },
  {
    "post_id": "470nzj",
    "title": "Relationship question",
    "body": "If this isn't the forum for this, let me know and I'll repost elsewhere.  Kiddo is beautiful and about 2 1/2 months old, and parenting is going great.  \n\nMy wife seems to be avoiding sex though.  We've been to bed once since the kid was born and it was a baby interruptus.  How do you other new dads cope with a low-desire wife?  Sex life before kiddo was good.\n\nI want to fix the problem but talking about (no pressure, not hostile) it just seems to stress her out.  She seems to think just saying it'll get better will help, but when?  How?  \n\nUpdate: Good advice here.  Birth was a c-section so I was very mindful about the surgical recovery part.  I think the most helpful part of the replies was hearing that breast feeding can interfere with sex drive, which I have to admit I was ignorant about.  Oddly, understanding that makes things a little easier, because I know how valuable the breast feeding is, so it makes the whole no sex thing seem like \"it's for a worthy cause\". \n"
  },
  {
    "post_id": "8j3ugk",
    "title": "Daycare Killing Our Immune Systems",
    "body": "So, I need you guys to tell me this is normal. Or at least not to worry. \n\n\nMy wife and I have always been healthy people. Seriously. We never missed work due to illness in the last 10 years or so. \n\nBut the last 6 months or so, since our little guy started daycare, things have gotten terrible. \nHe's battled ear infections since February and my wife and I have been absolutely destroyed with coughs, walking pneumonia, ear infections of our own, everything but the kitchen sink. \n\nFortunately, our son seems to have a happy disposition and walks around smiling. \n\nBut will we eventually toughen up and develop our own immunities so we don't get so beat up? Is this pretty characteristic of daycares in general?\n\nThe facility has a great reputation around here, but we have nothing to really gauge it against. \n\nCan any of you fellas give me some advice/insight?\n\n\nThanks!"
  },
  {
    "post_id": "13w9r4d",
    "title": "Im afraid my marriage may be ending.",
    "body": "Something’s been off for a while. We have a long complicated history. There’s blame on both sides but the majority is on me. I’ve always struggled with honesty.  I thought we made real strides with therapy after our kids were born and while I haven’t been perfect I do feel like I’m a different and better person now than I was 6 years ago. I’ve been trying so hard but I think my wife has slowly come to realization that she’s not happy and she’s now allowing herself to feel those feelings and work through them. I think she’s fighting for it to work but maybe she’s just trying to figure out if she wants to fight. I can’t force her to try and it’s making me spiral to think about what may be happening. I don’t really have any close guy friends and while I have done much much better at communicating my feelings to my wife, she needs time to figure stuff out. I’m scared and frightened. I don’t want to lose my family."
  },
  {
    "post_id": "1e7yj5b",
    "title": "Stressing about no sleep during the newborn stage...dads who have gone through it, can you share your experience?",
    "body": "When I get too tired, I get extremely nauseous and have to fall asleep or I might throw up. I used to be able to handle 24 hour work shifts, but after I turned 30, I feel like an ancient carnival ride that works when the conditions are perfect, but sounds and looks reaaal sketchy? lol\n\nI'm worried that I won't be able to get through it. I can force myself to stay awake when it matters, but I don't want to make myself actually sick and make myself a casualty at the same time my wife needs rest too.\n\nWe have family that can help, but I'm not sure how much they'll be helping during the first few weeks? Is it normal to ask a family member over right away, or did you get family help a little down the road? I think my wife will be nervous about someone coming and going during RSV/flu season (baby due in November).\n\nLuckily I am able to take around 4 weeks off of work (USA lol... using all my saved up vacation time) so I can dedicate all of my time to just caring for the baby, my wife, and myself (in that order). I hope that helps get us through the first four weeks at least."
  },
  {
    "post_id": "1gw4akb",
    "title": "How do you get your kid to take medicine?",
    "body": "Any good tricks? 3.5yo with random fever. They won't take the liquid. I bought chewables and made the mistake of getting bubble gum.\n\nAny tricks on getting the to take this stuff or on how to hide it? We got one dose this AM with grape medicine in grape Body Armor. We are going to try a pouch next time assuming they have an appetite."
  },
  {
    "post_id": "1f2vv2s",
    "title": "Have any of you ever tried learning an instrument later in life?",
    "body": "title"
  },
  {
    "post_id": "6ov3ou",
    "title": "Places to go with a 1 year old",
    "body": "Hello Daddit, \n\nMy son just turned 1 today and my wife and I want to take him somewhere for him to have fun. Our original idea was the aquarium or the zoo but it's way pricier than I remember (probably because it's peak season) I was wondering why you guys would do, he's not quite walking yet so that might limit us to some things. Thanks everyone"
  },
  {
    "post_id": "1g0y0qd",
    "title": "Wife Complaining to Daughter About Me",
    "body": "I’m stumped on how to handle this one. My daughter just told me that my wife has been complaining to her about me. She immediately felt terrible because she was sworn to secrecy. My wife is feeling stressed because she’s back to part time work and doesn’t have the home time she used to have. I understand this stress, and have tried to take on as much as I can while also working a demanding job, but obviously things are more orderly in a house with a SAHP. I knew this would be a trade off for a 2nd paycheck, but this behind my back complaining to my 7 yr old daughter feels like such an incredible betrayal. Am I overreacting here? I do have sympathy for my wife, but I’m incredibly resentful of this situation. I feel like I can’t even bring it up to her because then I jeopardize my daughter’s trust, since she’s devastated she slipped and told me. I’m lost."
  },
  {
    "post_id": "1h4db0o",
    "title": "My wife is the breadwinner",
    "body": "Had a fight with my brothers and sister lately and just realized they have all look down on me for years because my wife makes more money than me.\n\nShe is the breadwinner in our family, and since she has a more demanding job, it's up to me to look more for our kids and house chores. I also have a full time job, but she makes like 35% more than I do. So honestly in our situation, I feel it's a 70/30 balance with our kids and house.\n\nSo they don't enjoy seeing me having the \"mom role\".\n\nIs anyone in here in my same situation and doesn't care?"
  },
  {
    "post_id": "11e46x4",
    "title": "Best movies about choosing your kids vs. career/self-realization/world-saving?",
    "body": "I was thinking about this when I saw Interstellar. What a cosmic gut-punch, seeing McConaughey &gt;!trapped in the fifth dimension, screaming to himself to stay with his daughter instead of going on a potentially Earth-saving mission!&lt;. You could see the movie as a reckoning with traditional masculinity, I think. McConaughey's daughter is his everything, his little soulmate. Yet he leaves her to go on this mission. To go work for NASA. And it's not only for altruistic reasons; he feels useless just working as a farmer, being a trained space pilot stuck on ground.\n\nI loved 80% of the movie. I cried several times. I find the message of the movie beautiful. But... When McConaughey is &gt;!finally reunited with his daughter, when she is an old woman and he's still in his 40's, due to relativity!&lt;, he decides that he needs to &gt;!fly on, and doesn't even stay with his daughter for more than 10 minutes... after missing her whole life!!&lt; Love was absolutely central to the movie's theme up until then. Then that gave way to him self-realizing, and instead of being sad about the people in the story I became sad about Christopher Nolan's stupid writing.\n\nAny better movies about men choosing family over self-realization? Or that choice actually Being self-realization?"
  },
  {
    "post_id": "w059fr",
    "title": "14mo and non-milk food advice",
    "body": "Heya fellow dads,\n\nAny advice on getting my 14.5mo boy to eat food? He's  refusing baby food that we know he likes, but drinks whole milk just fine. \n\nWe recently (1mo ago) transitioned him off of breasts milk over about 3 weeks, gradually adding increasing amounts of whole milk into his breast milk, reducing the breastmilk by the amount of whole milk (8oz -&gt; 7 and 1  -&gt; 6 and 2 -&gt;... -&gt; 0 and 8) now he drinks whole like a champ. And rarely he'll eat some mashed pears or similar, but he refuses almost every time, even a long time after milk, when he should be getting hungry. \n\nDoctor isn't much help.  He just said \"give him xyz\" \n\nBaby was born at 34.5 weeks (5.5 weeks premature) his gestational age (time from when he was due,  as opposed to born) is 13.3mo, has no allergies, is a fair bit anemic now,  due to being preemie and because he's off the breastmilk, and refusing to eat iron fortified foods among others. \n\nAt 6-8mo, he loved pears, carrots, banana, sweet potato, and various mixed berry/fruit baby food. He used to eat whole jars, now only a few infant spoons.\n\nHe's not super aggressive about refusing, no crying or anything,  just shuts his mouth tight and turns his head away. Occasionally he pushes it away with his hands. He's healthy,  apart from the anemia. Iron drops are in the mail,  so hopefully that helps. Occasionally he says \"*papa!* in an incredulous tone, but again,  not angry or scared,  just not eating enough.  \n\nAnyone else got a picky/hesitant eater? How did you handle it?"
  },
  {
    "post_id": "wtz7ch",
    "title": "Dads, I may have set my kids up for a big disappointment",
    "body": "So we have two cats that have been around since before the kids were born. They are awesome with the kids, and we jokingly call them their fur-siblings.\n\nSomewhere along the way, I made the joke that I can understand what the cats are saying. And it’s become a running thing that I can understand cats. I’ll randomly start talking to the cats about inane things, even if the kids are in the other room, to keep up the illusion. \n\nNow, to be fair, both cats are very vocal and responsive to stuff so it’s made my cover pretty decent.\n\nThe kids are now 8 and 6, and still thoroughly believe I can understand cat. My older one is skeptical of Santa and the Tooth Fairy, and thinks it’s a younger kid thing to believe in them. I woke up this morning to my younger one setting up traps to catch us (the parents) in case the Tooth Fairy isn’t real and it’s actually us putting money under their pillow.\n\nBut, they both still thoroughly believe that I speak cat.\n\nMy wife thinks this is hilarious. The jig is going to be up over the next year or two; how do I break it to them gently?"
  },
  {
    "post_id": "1daeaj1",
    "title": "Bday Party On Father's Day - Annoying?",
    "body": "My kiddo is in the second grade and earlier this week (I think Tuesday the 4th) we received an electronic invite for a classmate's birthday party on Sunday June 16 aka Father's Day.\n\nWas I going to spend Father's Day Sunday being massaged by many young maidens while being fanned with a palm frond and eating grapes one a time? Probably not.  But I wasn't planning on driving to a ball field and hanging out in the sun and stuff.\n\nWe're going but I am sorta a little miffed and am wondering if others would be too.\n\nFor additional context:\n\n* They can't have the party on Saturday, but they could have it another weekend.\n* I am fairly certain the parents are not American by birth, so it's possible they have less familiarity with the tradition. But they didn't get here last week either.\n* The party is from like 10am to 11:30am so it doesn't punch a hole in the entire day.\n\n"
  },
  {
    "post_id": "12q6kyj",
    "title": "Just found out my kid has cancer.",
    "body": "Never thought I’d have to explain to my four year old daughter that there was something called a “tumor” inside her which was causing her tummy to hurt. She’s only four and she has a growth the size of a softball on her right kidney. Of course, I’m kicking myself for missing what now seem like obvious signs like reduced appetite and frequent stomach aches. \n\nPrognosis is positive. Trying to keep being the silly playful dad for her because that’s what she needs more than the worried, concerned dad.\n\nNot sure really why I’m posting this, other than to scream into the void. Dads, hug your kids.\n\nEDIT: I don’t have time to respond to all, but trust me, your words of support are much appreciated. Wanted to share an update. They’re fairly confident it’s Wilms, which means she has cancer on her right kidney. It’s currently a little bigger than a softball. Prognosis is good, they will operate today or tomorrow to remove and then she’ll undergo chemo to prevent reoccurrence. The surgery is super invasive, they’ll slice her abdomen open from side to side and she’ll also lose her right kidney. But, importantly, full recovery is expected.\n\nEDIT 2: Once again, I’m humbled by the words of support and encouragement. It helps more than y’all know. My daughter’s surgery went as well as we could have hoped. The tumor did not rupture and they were able to remove it intact along with the right kidney, so she’ll officially be prone to walking in circles for the rest of her life. This was a super invasive surgery, so we’ll be in the hospital into next week. No food or drink tonight, unfortunately. They will biopsy the tumor to confirm that it’s cancerous (formality at this point) and start chemo this week. She’ll have 4-6 months of outpatient chemo. The goal is complete cure, nothing less. Cancer is awful, but we’re blessed things have turned out as they have."
  },
  {
    "post_id": "909qy3",
    "title": "Can you help settle a bet for me with my Daughter? What's faster in a tandem innertube? Big guy in front or big guy in the back?",
    "body": ""
  },
  {
    "post_id": "114msru",
    "title": "Auntie 'Rona came to visit...",
    "body": "We've been safe from day one. Followed all the guidelines as best we could, masked up in public places to this day, got vaxed and boosted, and still got the breakthrough infection. So far it looks to be just me and my 3yo, wife and MIL are clean. So I've been quarantining with her, just putting Bluey on loop while we rest and wait it out. Had a \"Daddy Sleepover\" where I slept in her room last night to keep it fun and keep her spirits up. We seem to be through the worst of it and it's milder than it might have been thanks to the boosters. \n\nNo advice or anything needed, just letting everyone know to do everything you can to keep the family safe."
  },
  {
    "post_id": "9ksvpp",
    "title": "Dads with guns in the home, how will you teach/explain why and keep your kids safe?",
    "body": "Hey fellow dads of Daddit, I was just curious if any of you have guns in the home and what steps you take to keep your children safe from them. \n\nI personally grew up in a household where we were explained that guns were very bad and scary things, so I don't really know how to explain to my child or keep him safe besides hiding a gun and keeping it a secret which I think could backfire on me one day. I'm thinking an open approach would be better with the explanation of how serious guns are and only point it at something that you have an intent to kill. \n\nMy wife on the other hand grew up in a family where guns were the norm, hence why she wants a gun in our home for just in case protection. However we both feel as though a son would take greater interests in guns than a daughter so we are both clueless about how to go about it.\n\nCan any dads out there offer some tips on how you keep your children safe around guns at home besides the obvious? \n\nThanks!"
  },
  {
    "post_id": "sckpic",
    "title": "Pregnancy app for future dad?",
    "body": "Hey, wondering if any of you found any pregnancy apps geared towards dads that you found helpful? Just found out we're pregnant and want to be as supportive as possible!"
  },
  {
    "post_id": "wzpx9b",
    "title": "A short story from the night shift",
    "body": "Hello fellow dads. I'm a new dad to an 8-week old. He's cute.\n\nMy wife and I are doing shifts during my dad leave. She does mornings and I'm the night guy.\n\nMIL made dinner tonight - scrambled eggs with potatoes and onions. A playful, but mysterious little dish. I loved it. I enjoy kimchi so I had a side of that, too.\n\nSince the little dude arrived, my skanky witching hour delight has been Pop Tarts and milk.\n\nOn this night, I warm up my Pop Tarts and as I sit down to eat them quietly and shamefully in the dark, an insidious twisting starts in my stomach like some kind of rotten bloom. The clock starts.\n\nI'm watching my kid while feverishly shoveling pastry into my face and contorting my body in creative ways as I tempt fate. I have shit my pants before - the threat was real, and the gods don't abide insolence. \n\nBut I can't \\*leave\\* my Pop Tarts. One doesn't re-warm a Pop Tart. That's gauche.\n\nMy friends, let me tell you. I made it. I finished my Pop Tart and didn't shit my pants, though I do have a newfound appreciation for the concept of event horizon. While the diarrhea was perishing, I feel, perhaps undeservingly, that my handling of this situation bodes well for what's to come in fatherhood.\n\nUntil next time. Godspeed."
  },
  {
    "post_id": "18mj231",
    "title": "Colossal screw up by me and my wife (mostly me)",
    "body": "My wife and I had to take our two boys (3y and 10mo) out yesterday, to a doctor about half an hour away. We were rushing of course, because that’s just life, and so I took my 3yo and my wife took the baby. We’ve been on very little sleep because we’re sleep training the baby. Anyway, I put the 3yo in his car seat and strapped him in. My wife has a bad back, so she usually puts the baby in his seat and I strap him in when I’m done.\n\nWhile getting my toddler strapped, she verbalized to me that the baby wasn’t strapped, and I acknowledged. As I was finishing, she asked me to run back into the house to grab some socks for the baby and some water bottles for us, so I did. \n\nCame back out, straight into the drivers seat, handed her the water bottles, and off we went. Drove for 30 minutes, mostly on a heavily trafficked stretch of highway, and made it to the doctor just in time. Wife and both boys slept on the way. \n\nYou know where this is going of course. My wife opens the back door and is horrified to find our baby unstrapped. To say I felt like the world’s biggest fuckup is an understatement.\n\nWe got away with it thank God. But it was a stark reminder that there are some mistakes you are just not allowed to make, or your kids could be killed. \n\nWe both agreed that whoever places a kid in the seat has to buckle him from now on, or at least not walk away until the other person swaps with them. \n\nNot sure why I’m posting this story exactly. Mostly to remind myself to do a better job in the future I think."
  },
  {
    "post_id": "1fybmlt",
    "title": "Snapped last night",
    "body": "My son is a great kid, 4, nearly 5. He is caring, shy, attentive to other kids needs. At home, he can act out,  and has major listening issues - not at school, just at home. \n\nBed time is always a chore for Mom and I. He fights it tooth and nail. One more thing, one more story, oh I need to tell mom something, or whatever. Pretty normal. \n\nLast night he was acting up, being rough with his baby brother (4 months) and just being in general wild.  He was belly flopping on the bed. We asked him to stop. He kept going. Mom losing patience, me losing patience. We continue to politely and calmly ask him to stop. He smiled. Did it again. Pushing. \nI said if you do that one more time, no stories, no cuddles, you go to sleep alone. I asked him to repeat what I said to make sure he understood. A second later he looked at me and did it. \n\nFine, sleeping alone, me and mom say goodnight and leave (left door cracked) and he lost it. Wailing, crying, screaming. Full meltdown. I came in and said that's enough, you chose this etc, I love you, good night. More ramping, and I lost it and began shouting.  I told him to shut his mouth and to lay down and not another peep. \n\nThis worked, but mom was not happy. Did I over react by using that language? My son this morning told me it's not nice to tell people to shut their mouth, he is right, and I apologized and explained my frustration. \n\nWife still angry with me. Bedtime should be happy, etc. Which I agree, but how could I have handled this different? For context, this has been an ongoing issue, I didn't just shout for no reason. Bedtime, listening and direct disobedience is a thing for sure. \n\nTldr. Kid looked me in my face with a smile after days of soft parenting and disobeyed. I took no pity in his tears and applied the known consequences. Shouted at them to shut their mouth and now mom is mad. "
  },
  {
    "post_id": "1dm76ow",
    "title": "I give up on bedtime.",
    "body": "Seriously, I surrender. I’ve got two kids, ages 2 and 4, and bedtime is a never-ending nightmare. Both kids are horrible sleepers. They despise going to bed, wake up multiple times a night, and then rise at an ungodly hour. The result? We’re all cranky all day, every day.\n\nI’m sick of hearing about the importance of establishing a “calm and consistent bedtime routine\" and other such shitty advice. There is nothing calm about bedtime in our house.\n\nWe’re not stupid people, and I believe most problems have a solution, but this has us completely baffled. How is it possible to achieve a consistent result to a problem that has so many variables? It's a complex system, not a complicated one.\n\nEvery day they eat different foods, which messes with their pooping, which disrupts bedtime, which leads to a restless night, which means their energy levels are all over the place the next day, making their appetite and mood unpredictable. One day, the little one skips his nap and is overtired, resulting in a complete meltdown at bedtime. The next, they fall asleep for two minutes in the car in the afternoon and are wide awake until 11 PM. A snack before bed helps them sleep through the night one evening but gives them a sugar rush the next. Then there’s teething, random fevers, nightmares, sleep regressions, and sudden growth spurts that throw everything off.\n\nEven if you manage some kind of routine for a few months, summer comes along and the sun is up till 10 PM. And with two kids, the difficulty isn’t just doubled, it’s multiplied. Just as one kid is ready to sleep, the other decides sleep is for the weak and wrecks the plan.\n\nSo yes, I give up on bedtime. I’m tapping out. If they refuse to go to bed, stay up then. Bother each other. I'll put my noise-cancelling headphones on and try to do my own shit as best I can. We'll live in chaos and sleep deprivation, with no end in sight. To all the parents out there still fighting the good fight, I salute you. May your battles be shorter and your victories sweeter."
  },
  {
    "post_id": "zxn2qk",
    "title": "My daughter is almost 4 years-old and still depends on diapers, potty training seemingly fails and she's starting school next year. I'd love to get some advice.",
    "body": "She's an awesome kid, pretty smart and talkative, but she refuses to let go of the diapers and I don't really know what to do. For context, we haven't been able to dedicate enough time to the potty training task due to our jobs. When we did try, she seemed to \"get it\" and we did well for a couple of days but then she forgot about it and it's the same cycle every time we go for it. \n\nHer nanny cannot do much since this kid flat out refuses to let people know she needs her diaper changed or that she needs to use the bathroom and when asked the reason why, she stays silent or changes the topic. Perhaps there's something we're not seeing so I kindly ask you guys for advice on the methods that worked for you in case you've gone through something similar.\n\nWe have also had \"accidents\" when we are out because she doesn't let us know she needs to go to the bathroom and it's rather puzzling since she can communicate quite clearly the rest of her needs or wants. I'll be home full time for the next 20 days and would love to reach some semblance of progress on this. Thank you."
  },
  {
    "post_id": "yrfx4l",
    "title": "Depressed Dads and Fun Withdrawal",
    "body": "I'm sure this has been brought up before, but I don't feel like reading old threads. Mostly, I just wanted to type this out as a form of therapy and see if anyone relates.\n\nHow many of you fathers out there find yourselves feeling low after stretches of particular fun times?\n\nI have recently been feeling very down after the passing of Halloween. It is a favorite holiday for our family. Returning to our normal routines has felt like a drag and I have struggled in engaging with my wife and daughters (3,1) for the past two weeks.\n\nI have noticed similar patterns after family vacations, birthdays, other holidays, or unplanned joyful days. It typically goes away with the next fun event, and with the holidays approaching, I am looking forward to breaking out of my funk. I've only been able to describe it to my wife as \"fun withdrawal\", where the fun times feel like an escape from our normal routines, not the norm. \n\nCan anyone relate? Any tips?"
  },
  {
    "post_id": "26giet",
    "title": "Recommended iPad games for toddlers?",
    "body": "My daughter is nearly 2 and we thought now was a good time to utilize the iPad we received as a gift for her. I've glanced through the App Store and tried a couple games, but haven't found anything that great yet. \n\nWhat do you guys recommend for educational and/or engaging games for this age group?  "
  },
  {
    "post_id": "1d4kmi8",
    "title": "Need advice from the dad's with foreskins",
    "body": "Hey Daddit,\n\nI'm circumcized, my son isn't. However I don't really know what's normal etc...\n\nHe's 4 now, and his foreskin comes over the top of his penis with a little sort of extra turtle neck fabric section I guess?\n\nAnyway, it seems really tight, the hole at the end is tiny, sometimes when he pees it balloons up a little.\n\nHe seems totally fine but I'm worried about phimosis and that he'll need intervention at some point. As I understand it the foreskin should be able to retract by the time he's gone through puberty?\n\nCurrently I don't see how that will be possible, because as I said the hole at the end, it's imperceptible.\n\nI'm not sure what's normal, what will resolve itself, what the points are where / when I should be concerned.\n\nAny advice from my unclrced brethern would be appreciated.\n\nThanks "
  },
  {
    "post_id": "1bso3ac",
    "title": "Dad’s _________ is/are the BEST!!",
    "body": "To the cooking / grilling / baking / etc Dads….\n\n….what’s YOUR dish? The thing that you make that your kids, family, and/or friends (and perhaps beyond) know you for? A dish only you make because, well, you make it the best.\n\nIs it…Steaks? Ribs? Chili? Brownies? Muffins? Is it your own creation or a family recipe?\n\nThis thought came to me as I was trying to tackle a lamb loin roast for dinner tonight. I make a mean porkchop. My wife always raves about her dad’s steaks and ribs (and rightly so). \n\nIs there something your kids prefer that you make and not Mom? Doesn’t matter if it’s Dino nuggets and mac’n’cheese. If it’s food related and YOU make it best - what is it?\n\nWhat’s your dish? \n"
  },
  {
    "post_id": "1gf354i",
    "title": "Seasonal Depression is Back, YAY!!!!! ",
    "body": "All jokes aside, don’t let your mind take over. Go for a walk and realize what is happening. I just go for walks as needed and vitamin D works flawlessly.\n\nWish you all the best dads, this depression will make you question your existence, feel free to talk about anything."
  },
  {
    "post_id": "1hmrhnh",
    "title": "How to help my partner to give up co sleeping with our son?",
    "body": "He slept next to our bed in his crib first months then around 4 months old he slept between us now after he started crawling at 7 months he has slept on mattress with my partner next to our bed.\n\nHe has started to roll around a lot now at 10 months, so she doesn't really sleep or wakes up good 5-8 times a night and i get verbally abused because she is tired all day. \n\nHow can i help her to give up on co sleeping and we can place him back to the crib in his own room? \n\nI am ready to stay up all night as many nights as it takes for him to learn how to sleep alone in his own bed, but she isn't.\n"
  },
  {
    "post_id": "ohrvqb",
    "title": "I Almost Dropped Him",
    "body": "Using my throwaway, because tbh the shame and guilt is pretty intense right now. \n\nFirst time dad. He's 4 days old. 4 days. Had him on the couch, was changing him. I don't know how, I guess I was fiddling with the awkward buttons and things, and the way he wriggled, somehow all of a sudden he was over the edge of the couch and my partner caught him. \n\nSeeing the fear in her eyes and she cried and held him, and knowing I caused that fear for her, broke me. She has been so amazing and strong and I've been a passenger cheerleader, and now I feel like a danger to my son. I couldn't even make it a week without screwing up badly. She has barely said a word to me since, and I don't blame her. I feel like every fear and anxiety I ever felt that I wasn't up to the job was right, and with my hubris I've trapped my partner and my son in a situation with a dad who can't be counted on.\n\nEdit:\n\nThe outpouring of support, advice, humour and encouragement on this thread has been utterly breathtaking. Myself and my partner are feeling much better now, and I want to thank you all very sincerely for playing a huge part in that"
  },
  {
    "post_id": "1bvrz8t",
    "title": "Wife and I bump heads on eating dinner together at the table",
    "body": "We have a 2YO and 4YO and I grew up always having dinner with my family, no TV or anything.  My wife was not like this, family ate in the living room usually with TV on.\n\nWe currently do separate dinners just because its easier for our routine (although I'm getting a little sick of making 2 dinners) and we always spend a good 2 hours with them after work and picking them up from daycare.  My wife feels that the priority of eating together at the table is an old tradition rooted in the fact that typically one parent (the father) would come home from work late and eating dinner together was the only way to connect, but now we spend time with them even if it means watching TV together and its not really needed.\n\nI find it hard to push this because she doesn't see it as a priority and I feel guilty pushing a routine that will make our current routine a little harder/different.\n\nMy fear is as they get older, they wont want to spend as much time with us (and be busy with their own stuff) and starting the tradition now will at least allow us to have that time together with no distractions. \n\nHave any of you clashed over this? Anyone with older kids find my wife's thoughts to be correct and find different ways to guarantee the valuable time with their kids?"
  },
  {
    "post_id": "3e04rm",
    "title": "Had the worst dream of my entire life and it seemed so real. I couldn't get halfway through telling my wife before she said she couldn't listen anymore. I have to share with somebody.",
    "body": "I had the worst dream of my entire life last Saturday night. It was one of those dreams that just seemed so real and has stuck with me over the last few days. So there I was in my dream at a family barbecue at an unknown location but with all my friends and family. I realize I don't see my two year old daughter Emily and look up to my wife and see she's not with her either. No big deal I though she's with grandmom, grand pop, an aunt or uncle or cousin as I have a big family. I start combing the backyard saying her name to no avail. The saying turns to screaming as my wife and family join in. In that instant I knew something was terribly wrong. I look over at the in ground pool full of people swimming and run over as fast as I can. There she is motionless on the bottom with her green pants and pink long sleeve shirt. I dive in and swim to the bottom and grab her but she isn't moving. I swim to the surface and as I break the water line with her in my hands I wake up heart racing in a cold sweat. It was a dream but I went through the worst emotions imaginable and I'm still not right. I hold her extra tight and have been sleeping in her bed. I don't know what I would do it I lost her and it that very real moment it appeared I had. I tried to share with my wife but only got halfway through before she said she couldn't listen anymore. I had to share with someone. Thanks for reading. "
  },
  {
    "post_id": "1bakge3",
    "title": "SAH dads: what is it you do on a day-to-day basis? How do you afford it? Does it drive you crazy being home so much?",
    "body": "My wife and I have been discussing me quitting my job and being a SAH dad.  She is far and away the breadwinner for our family and we can *almost* get by just on her income (nurse).  I’m a little leery of it, but at the same time, my job has just become more and more stressful, but it maintains the hours we need for our kids.  (I work 8-hour days, she’s 12-hour night shift.)\n\n\nBring home all the time sounds tempting, but what do I *do* with that time?  I’ve been working full-time for over twenty years now, stopping that suddenly just seems weird and kinda scary.\n\n\nSo, SAH dads…. What is it you do to fill the time?  How do you make it work financially?"
  },
  {
    "post_id": "u34zit",
    "title": "My 5 month old daughter fell out of her stroller down the driveway tonight",
    "body": "Daddit,\nA little over an hour ago, I messed up bad and my 5mo took a spill down my steep driveway. There’s no way I can really do this story any justice, but here’s how it went: \n\nMy wife got out for a trip to the gym, a rare occasion. She’s probably been away from our daughter for an hour+ less than 12 times since she was born. So I’m in charge, and when I’m on duty, as I’m sure you all do too, I’ll do whatever it takes to keep my daughter occupied, e.g., sing in the mirror, dance on countertops (her on the counter, not me), beatbox, whatever it takes really. Well she starts to get restless so we quickly go outside to the garage, I put her in her car seat that’s already in the stroller. Quickly run back in, grab my dog, slip on flip flops and return back to her in the stroller. I have a podcast blaring out of my pocket. \n\nWell, we start on our way, making faces at each other as we start to go down the steep hill of my driveway. It all happened so quick but I remember this in slow motion - her car seat rolled backwards out of the stroller down our steep driveway. She wasn’t buckled in. \n\nI let everything go and run over to scoop her up. A car is coming down the road, the stroller is rolling into the street, the innards of the car seat are scattered across the steep driveway and my untrained dog’s leash is no longer in my hand. My 5mo old daughter, the true light of my world, screaming a new sound I’ve never heard before in my arms. I run over and grab the leash and book it inside. Pacing back and forth with my baby girl crying. Fuck the stroller and the car seat out there. The only thing I can think about is whether or not I just ruined her life, if she’s going to be okay, the extent of the damage, the god damn steep driveway, my carelessness for not buckling the car seat in. Tears are in my eyes and my daughter’s tears on my chest. \n\nJust a mere two minutes of crying go by and she sobs herself back to calm and content, cuddled close on my chest. Massive sigh of relief there. I take her to the bathroom mirror. Still cuddled on my chest, she smiles and makes a sound. Now my wet eyes are tears of joy. \n\nFast forward to now- she has a small red mark/mini egg on her forehead and a light scrape on her knee. She’s acting normal, smiley and fun, and now tucked into bed. \n\nAlthough incredibly grateful to God or whatever higher power was protecting her, I still feel like I let down my baby. It’s my duty to protect her. 5 months old. She can’t even crawl. What kinda guy doesn’t even check to see if the car seat is buckled into a stroller before pushing their child. I need to be better and I will be better. \n\nSo this is my PSA: Guys, buckle your kids into the stroller. Or at the very least, buckle the car seat into the stroller.\n\nEdit: Thanks everyone for your stories and advice. It helps a lot hearing others have also been through similar experiences, you all best yourself up but your kids are all okay. \n\nTo those asking about my wife’s reaction - I called her a few minutes after things settled down to let her know what happened and that I’m monitoring her behavior. My wife is an RN and handled this really well. Basically just assessed the severity of the situation- no blame or anything like that. When she finished up and came home from the gym, she looked at our daughter, saw everything appears to be fine (aside from the two exterior scuffs), and carried on momming. Very supportive and loving along the way.\n\nEDIT 2: It’s morning, nearly 15 hours after the accident. She doesn’t have the red mark on her head anymore. Just has a slightly scraped knee. Acting her usual self. I got the accident on video off my ring cam. It’s a miracle she didn’t hit her head. My family is blessed. Thank you all for the advice, stories and well wishes. This will be ingrained in my memory for a long time to come."
  },
  {
    "post_id": "1gg25jr",
    "title": "My 19 year old cat is (very likely) being put down tomorrow.",
    "body": "Just wanted to post to vent a little bit. I've had this cat for most of my life, and my kids had her for all of her life(8yo, 9 this Friday..)\n\nIt's going to be a rough day. Most of the time, the cat was my alarm. Like clockwork, she'd be at my bedroom door or my daughters at 7 am meowing for food. It was annoying but I'll miss it..and it helped on schooldays. \n\nMy kid already knows what will likely happen. I didn't want to hide it from her. It would be pointless. She can come to the vets, but I don't think I want her in the room, but at the same time, if she wants to, I think she has a right to. \n\n\n\n"
  },
  {
    "post_id": "1h1cmgy",
    "title": "This is the best generation of Dads - From a woman without one ",
    "body": "Cis woman here. I don't have any children, yet.\n\nMy own biological father was near absent in my life. I met my real (step)Dad as a teenager. He died last year, my parents were together for only 14 years... Cancer took him away at 51.\n\nMy biological father is a narcissist that I cut contact with at 16. Given my experiences, I've always been more observant of men with children.\nI read a comment on here once, many years ago that stuck with me. It was an old guy that said \"This is the best generation of Dads\"...\n\nI can't help but agree.\n\nI see Dads with their kids all the time now.\nSeeing posts on here that show your love for your children, expressing the same emotions and sentiment from the female version is beautiful.\n\nThere was once a time that I truly believed that men cannot love, they're only with women for the sex and they stay for the sex. I stopped believing that when I was 16...\n\nI hope to find a man who can be a good parent, who won't abandon or abuse his children. An active parent. I think I'll find it easy enough.\nThank you for the hope, the love and the smiles.\n\nI know it's hard to be a good parent when your employer continues the old ways, expecting you to work as though you don't have kids to pick up or housework to do.\n\nJust know you are making a difference. We are watching. We are proud.\nThank you."
  },
  {
    "post_id": "1g49uui",
    "title": "AITA for scolding my wife for feeding ‘supplement’ to wrong child",
    "body": "Came home and found out my wife fed the doctor-prescribed electrolytes and probiotics to my younger one, as well as the older one. I had already clarified in messages to the family specific instructions to feed the older child. \n\nTaken aback because I only took the older child to the doc today and it was fairly obvious from how I updated in the group chat.\n\nSo anyway I raised my voice and asked her why she did that, and she said she had so much going on and too tired and she thought that it was good-to-have type meds so she also gave the younger one since she also had vomit symptoms.\n\nI said it was incredulous that anyone would do that as this was medication and being tired is not a good reason to just give meds flippantly whether it is supplementary or essential. If she can do this now what if in future there are more heavy meds that require diligent follow up. I am upset because she got defensive and didn’t even apologise.\n\nI am angry because it just feels irresponsible to me but I don’t know how to close this case. All I want is for her to recognise her mistake and not repeat it again."
  },
  {
    "post_id": "vw9j4a",
    "title": "Pack it up dads, it’s over.",
    "body": "My 2.5yr old took a too-big bite of a banana but then spit out a half-chewed pile of mush bc she almost choked. So I was reminding her that she should take smaller bites, which she knows and has practiced many times. I also reminded her that I don’t want her to choke and I just want her to be safe. Which she then replied emphatically, “Don’t save me!”. \nI almost broke down crying. That’s it my dudes. My 2 year old daughter can handle herself. She doesn’t need me anymore, apparently."
  },
  {
    "post_id": "13x2ty7",
    "title": "I hope cars are illegal before my daughter is old enough to drive.",
    "body": "I was driving home after picking up my daughter from my in-laws, when some guy in a Jeep with patriotic-ish decals took issue with me yielding to a cyclist. He actually pulled up along the driverside of my car and stopped so he could yell at me through his tinted windows. It was kind of scary because I could barely see him through the tint and he could have been doing anything in there. It's not like we were at a stoplight. I was waiting for the cyclist to pass so I could make a right turn and the Jeep guy could have just passed me on the left (albeit improperly) and kept going on his angry little way.\n\nI think this the first time another driver has stopped their car and accosted me. I've certainly never been angry enough with another driver to do it myself. Anyway, I'm glad the situation didn't escalate beyond that. I was just thinking that it's really insane that this is the predominant way that people have to travel that there's all this culture and often messed up subcultures around it. It really sucks that we have to make sure our children are prepared and trained for it."
  },
  {
    "post_id": "13qxce0",
    "title": "Anyone up for a challenge?",
    "body": "Wife says I need to quit smoking but I’ve been having a really hard time. Not sure if anyone else feels the same but I’ve been wanting to get more active as well.\n\nAnyone want to do a sober/fitness daddit challenge next month? Thinking it could be beneficial for a bunch of us and was wondering if there’s any interest. I’m hoping to create a positive atmosphere and find some people to help hold each other accountable."
  },
  {
    "post_id": "10h2bzz",
    "title": "What setting has your kid unwittingly changed that you have no idea how to change back? What was the item, and how have they changed it?",
    "body": "My kid came into my home office where I have a standing desk and within seconds pressed a combination of buttons which raised my desk to the highest height.  \n\n\nGoogle can't help me sort it out.  \n\n\nI find myself laughing at the ridiculousness of it at the end of the day. During the day its such a pain in the ass!"
  },
  {
    "post_id": "1abhfb1",
    "title": "First weekend alone with 2 year old",
    "body": "And my toddler is sick! Mom planned a Cabo trip with some friends a while back and the day before she’s supposed to leave our LO gets a nasty cough and loses her voice. \n\nNow I’m panicking and thinking of the worst scenarios that will happen when I’m watching the baby. Usually I’m the calm one but when it comes to illnesses and minor details I feel like I miss the cues. Been having minor panic attacks thinking about how we’ll pass this weekend.\n\nShe’ll try to talk but nothing will come out. Still full of energy and giggling. \n\nNo one to really talk to about this kind of stuff so I’m just ranting here ."
  },
  {
    "post_id": "wuvhzo",
    "title": "Bro dads - I just need to vent about my ex-wife (my son's mom).",
    "body": "From the time we divorced 12 years ago, my son has been with me about 75% of the time, though in our divorce agreement it was 50-50.  At the time, I was barely employed and she was asked to pay child support because of the disproportion in our income. \n\nAbout a year later, my  employment situation improved and we discontinued the child support.  \n\nAbout 7 years ago, my ex-wife had one tumultuous relationship after another and my son start to stay with me about 90% of the time with very little to no financial support from her.  \n\nLater on since we have had several discussions about finances, she decided that she was going to buy my son his first car, and then a new one when he graduates High School.\n\nShe stalled several times and more than twice told me \"I have a friend selling an awesome car, perfect for our son.  I will get a good deal.\" and then nothing will happen.\n\nShe decided we will just find a car for my son, but her budget of $2000 was unrealistic for a dependable car.  Finally, with all her excuses and drama, I decided, F*CK IT!!!  I will buy him a car.\n\nWe got him a nice Mitsubishi Eclipse that was owned by a mechanic, so the car was very well taken care off and clean.  The only thing was, it was a stick (manual transmission), but my son was excited about having a stick shift since he has seen videos of people trying to steal cars only to fail because they did not know how to drive a stick.\n\nWe brought home the Eclipse and my son, my brother and I started to make the car more his own.  We bought and installed a new stereo head unit with bluetooth to replace the OEM one.  Installed a back-up camera.  Replaced a few small parts and basically he started to learn and care for his car.\n\nMy ex-wife refuses to get in his car, because it's a stick and she can't drive it. And because of it she hates it, regardless of how my son and I feel about the car.\n\nYesterday she called me with another \"my friend is selling her car and it's perfect for our son\" speech.  I mentioned the obvious that he already has a car and she mentions again that she hates it. \n\nShe has not contributed one dime to anything that has to do with the car including maintenance, insurance, financing, etc.  I told her that our son loves the car but she does not care, she hates it.\n\nIt's just frustrating.  Thanks for listening (reading), bro dads.  \n\nRANT OVER."
  },
  {
    "post_id": "rw95kl",
    "title": "I never got to have the fat baby",
    "body": "Kind of sucks.  He had a gentle tummy when he was little and could not keep food down so he never chunked way up, and now he's a growing toddler who can't eat enough to keep up with his vertical growth.  My dream of having a roly-poly fat baby is over, and I am just a little bit sad."
  },
  {
    "post_id": "9npq9k",
    "title": "You’re all doing great, and I’m proud of you.",
    "body": "I don’t know if this is the right place to post this, but I hope this isn’t too intrusive. While I have a fantastic mother who busts her tail to this day to give me a good life, and who id give the world to, I’ve never met my father. I spoke to him once over the phone on my sixth birthday, and he wrote me one birthday card. I’ve had no contact for the rest of my 21 years. The last school picture my mom sent him was 7th grade, because we never got any response. He may not even recognise me if he saw me on the street.\n\nMy birthday is coming up soon, and that always seems to bring up this tight knot in my stomach. I’ve suffered from really bad abandonment fears since I finally accepted he didn’t want to be in my life. I never got to go to the father daughter dances or have a male role model in my life, never got to play video games with him or play on his drum kit or cook with him. I used to be petulant about it, telling myself I never needed a dad. Now, I still understand that I can be strong, but I know there’s an experience in life I’ll always miss.\n\nYou’re all doing such great jobs — fatherhood is no easy task, parenting in general is a journey I know I couldn’t go on. But you’re in your child’s lives, some of you fighting to do so. You’re so integral to them. It’s sounds weird to say, but I really am proud of you. There’s a lot of bad parents. Men and women who abandon their children, who are distant, who don’t have the love in them for their children. Please keep on doing amazing things for them. \n\nThank you,\n\nCassini."
  },
  {
    "post_id": "1ayu2is",
    "title": "I think I've reached some weird checkpoint in being a dad",
    "body": "Next week I'm having hernia surgery and a vasectomy at the same time. I'll have to take a week off of work and I... cannot fucking wait. \n\nMy wife will be at work Tuesday, Wednesday, Thursday and my two kids will be at daycare. Those 3 days will be pure bliss. My parents are even taking the dogs. I will have 8 straight hours of just \"relaxing\", watching TV, and playing videogames for 3 days straight. I put \"relaxing\" in quotes because I know I'll be in pain but honestly it's worth it. I haven't had a single second to just worry about me in 2 years. \n\nIs this what it means to be a dad? To look forward to surgery and pain strictly for the fact that I'll finally have peace and quiet. Cuz I am counting down the seconds. "
  },
  {
    "post_id": "pgrq7n",
    "title": "Struggle.",
    "body": "Been struggling for a while. My daughter just turned 4 and is awesome. Just got her into headstart she loves it. Been divorced 2 years and I got her almost 50% of the time. I say almost because it's just enough difference I have to pay child support. Well I've been struggling as I don't feel like I'm a good dad. She always wants to go to her mom's when she is here. Then I figured it out. Last week when I got her she had a bad ear infection. Ex wife said she has a doctor's apt coming up so is gonna wait. Her ear was leaking blood and puss. So I take her to the urgent care. 4 hrs later got meds. Today her school called me and said she hasn't gotten her 4 yr old immunization shots and she can't go back to school untill she has them. Asked my ex wife months ago to take care of it. Never did. So after a work I get my daughter when I'm told this and go get her the shots so she can go to work. Now I realize why she doesn't want to stay with me. I'm the adult. Tired my fellow dad's. I am tired. Sorry for the rant. If you stayed this long thanks."
  },
  {
    "post_id": "4rdgul",
    "title": "My Scary Story",
    "body": "So my daughter is 6 weeks old.  Last week we went to our pediatricians appointment.  I met my wife and daughter there since I was at work.  After the doc got done with my daughter she was fussy so I decided to go hang out in the car with her (she likes the engine noise and the radio) while my wife asked some questions and made the next appointment.\nI had my daughter in the back seat in her car seat and I was up front kinda hanging out.  By this time the car trick had worked and she was snoozing.  The tingly bit in the back of my head started up and I noticed someone staring into the back window at my daughter.  I rolled down the window and asked what he needed.  I was on guard but polite.  He asked if he could hold my daughter.  I said \"no, she's asleep\".  Besides, I wasn't letting a stranger hold my daughter.  He asked again, only this time he wasn't really asking.  I again refused, and made sure the tone of my voice expressed some finality.  This is when he reached for the door handle.  \nNow I don't remember opening my door, but I do remember making the decision to draw my gun.  I'm a concealed carry holder and always carry when I'm working (I have a risky job).  My order was clear, \"Step away\".  Now I doubt it was the tone of my voice that made him run off but he did.  I holstered my weapon and called the police.  The hospital is right around the corner from my peds office and they must have been there because I had two cruisers with me within a minute.  Within 5 there were two more.  My wife had a near come apart when she walked out of the office and there were four police cars around us.  \nI explained what had happened.  I was very up front with the officers that I had a concealed weapon and that I had drawn it.  They inspected it, ran my license, etc but ultimately it wasn't an issue.  \nThe guy was found later that day.  He was on probation for sexual assault to a minor and was on the Megan's Law registry, which he had violated.\nMoral of the story:  I will never be in public with my daughter and not prepared to defend us.  Ever."
  },
  {
    "post_id": "nkr51q",
    "title": "We lost our first pregnancy at 8 weeks",
    "body": "Last week my girlfriend (26) and I (34) found out we lost our early pregnancy. It was around the 8 weeks in on our first pregnancy. The first ultrasound showed the embryo had no heartbeat. We are devastated.\n\nI find it hard to deal with the emotions and feel people act as if it’s not an big issue for ‘men’ in general. People seem to comfort her and ignore me being there as if it’s not just as sad for me.\n\nPartner has been overall supportive."
  },
  {
    "post_id": "1doqdgz",
    "title": "Tell your wife when it's hard",
    "body": "TLDR; Communicate when things are difficult, even if you make it seem easy. \n\nSometimes it feels like being a dad is a thankless position. I thought being a super-dad meant taking as much of the stress off my partner as possible to make her life easy and give the kids the best childhood. What it also did was build resentment towards myself because I would take on larger and larger responsibilities within the family and home and I would catch my wife scrolling on her phone while I \"did everything\". \n\nIt was my fault. Really. I kept saying yes and smiled. Because I work hybrid- I do the morning drop off, afternoon pickup, carry a full time job, and clean the house and have dinner ready most days. As my wife works nearby, she'll sometimes come home for lunch so I'll have that ready for her. When the workday is over, I'll do the cleaning up,  playtime and homework with the kids, bathtime, and bed routine. The yardwork is mine, the financials are mine, and the midweek errands are mine. During the weekend I plan the dates, schedule the activities, and ensure it all runs so smoothly that things just flow right. I'm not saying all this to show how much I do, but rather because I suspect many of us are in the same position and haven't realized how much work we do \n\nYou may be asking yourself \"well dang, what does the wife do?\", and that's the point. I took on as much as I could with a smile and a cheer and I do everything possible to make it seem like it's no bother at all to add one more task. I actively discouraged her from doing chores saying \"go relax- I got this.\" or \"of course you can brunch with your girlfriends- the kids and I will stay here!\" The downside is that I did it so well that my wife had no idea of the scope. M \n\nI was asked to travel for work recently, a week+\nevent, and when I left she was sure she could handle it all- when I came back, the day before Fathers Day, she announced before friends, family, and God that she didn't realize how much I did and how easy I made it look. I didn't want to go with \"I told you so\", because I didn't, but it made me realize that I need to share the mental load, if nothing else. \n\nI'm not complaining or comparing myself to single parents, but it is hard. We dads may seem to have these huge shoulders to carry the burden of a family, and we do, but there's no reason why we can't let our partner be aware of the toll it takes.  We can't assume our partner will \"just know\" because we often  hide it well enough. You don't have to give up being a super dad, but let your partner  know that you need a break because you did this and that and the other thing- they probably didn't realize it. If you handle everything, talk to your partner about sharing the load- the point is to NOT fill yourself to capacity and communicate. \n\nAnd then tell her when it's hard...I think we both know what I mean there. \n"
  },
  {
    "post_id": "1ex7sn7",
    "title": "Our 6 month old dived into the coffee table…feel like crap.",
    "body": "Just got back from A&E after our baby decided to dive bomb into the coffee table. She’s just started sitting up on her own but deiced she’s had enough of that and almost leaped forward whilst rolling at the same time. This unfortunately resulted in a nice cut just above the eye. \n\nAll other checks were fine and they said because it had stopped bleeding quite nicely they weren’t going to glue or stitch it. \n\nI feel like an absolute failure in all honesty. I couldn’t jump across to save her in time and the crying along with the blood running down her face has broken me this afternoon. \n\nYou end up forgetting about it right? Hoping any sort scar becomes almost invisible. \n\n"
  },
  {
    "post_id": "1gqglz2",
    "title": "I have to go back to work and it makes me sad",
    "body": "My newborn will is 4 weeks today, so that's it for my parent bonding time off. I feel like crying.\n\nI know I am extremely fortunate because I work from home and, at least, I got those 4 weeks, but it hits hard. These have been hard days with the newborn, but I had the chance to take my 2-year-old to the park in the middle of the day and have eat out just the of us. But today it ends.\n\nWhen I'm working, it's really hard to make time for this after 5, between house chores and me being tired. Yes, we still have weekends, but it's not the same. I don't know how to describe it, but I feel like doing anything at 10am or 2pm with him is like having a different world for us.\n\nIn any case, I'm just venting a bit before this wonderful time ends. I guess I'm back to playing the Powerball 😅"
  },
  {
    "post_id": "uezd59",
    "title": "I got Covid from work, and my 4 month old likely has it too, and I feel guilty and angry",
    "body": "My workplace has been pretty heavily emphasizing working from the office (Despite the fact that literally everything we do involves working from a laptop), and while I have been pretty consistent about wearing a mask etc., I got Covid - It's likely from my office as there have been a few confirmed cases there (But was never contacted by HR as someone who likely had any contact with), and we don't really go anywhere else. I'm not feeling too bad thanks to being vaccinated (I do have some chest congestion though). My 4mo son has also been coughing and has a lot of mucus in his nostrils, and his pediatrician thinks it's likely that he has covid too. I'm mad at myself for letting this happen, and mad at my workplace for not letting people work from home, and basically increasing the chances for possible infection. I'm a little scared about potential long-term consequences for him. He's doing okay so far, but I really needed to vent this out."
  },
  {
    "post_id": "qyyavq",
    "title": "Daughter's first birthday party cancelled",
    "body": "My first born just turned 6 today.  Prior to this year, all celebrations for her birthday had been with family.  She was really excited to be able to invite friends from school and the neighborhood to celebrate with her.  We spent the last week buying all of the decor, party favors, food, and drinks.  We were doing a Frozen themed party, and had hired a party planner to come dressed as Elsa.\n\nI already realized a couple weeks ago when a couple kids were not able to come that we should plan her party early in the future to avoid cold season and Thanksgiving.  We still had enough kids to still allow my daughter to enjoy her special day.\n\nThis morning sucked.  We heard back from three of the moms that their kids would not be able to come.  Only one gave an explanation, and it was for health reasons.  That would have left only one friend able to still come, my daughter's best friend.\n\nMy wife was able to act quickly and find a fun activity for the family today, and my daughter was happy about that.  That means that she would not be able to see her friend, though, as they had plans for later in the day.  That is when my brave little girl finally broke down and started crying.\n\nShe seems calm now, but my wife and I cannot help but think that we failed somehow.  I know we can plan better in the future, and we have learned some things, but it will always hurt having to disappoint my daughter."
  },
  {
    "post_id": "uicw7k",
    "title": "My mother is staying with us for a week…. HOLY !!",
    "body": "I love my mother. I really do but she hasn’t even been here for 24 hours yet and…..\n\n“Why can’t the baby watch tv?”\nBecause I said no. \n\n“Why is so she serious?”\nBecause last time she saw you she was 3 months old. \n\n“She needs to socialize more”\nSHE IS 8 months old MOM, where is she going to go, to the club?\n\n“Maybe she needs to be put down for a nap?”\nNO ITS NOT TIME YET!\n\n“Her onesie is too tight”\n\n“Her feet are too cold”\n\n“She is sleepy”\n\n“She is going to choke on the watermelon”\n\n\nIM GOING INSANE \n\n\n*Six more days*"
  },
  {
    "post_id": "107vit9",
    "title": "Random feeling of Sadness?",
    "body": "Dad's, I am sure EVERYONE must feel this at some point, but do you just get hit with a random sadness? Doesn't make sense. I'm not grieving, missing anything, just an unexplained sadness?\n\nI have everything I could ask for? Why the sad feeling 😩"
  },
  {
    "post_id": "1ap8uj4",
    "title": "Superbowl Surprise",
    "body": "I was getting ready to head over to a buddy's place for the game yesterday when my wife walked downstairs holding 2 different tests, both positive. Promptly sent my friends a \"suddenly feeling under the weather, have fun!\" text and hung at home with her last night to bask in the news. \n\nNot sure what to say! We (34M/33F) have been married for going on 5 years, just bought and moved into our first house (apartment life in the city for the last 10 years), and pulled the goalie for the 1st time on NYE. Definitely didn't expect it to be this soon..\n\nExcited, nervous, prepared, scared, stoked - all the feelings right now. "
  },
  {
    "post_id": "187jq33",
    "title": "I want everyone’s best stories about pregnancy brain and food aversions / cravings",
    "body": "We always laugh about it years after but in the moment all the the forgetfulness, nausea, aversions and wild craving can be a lot. This time around it’s hitting especially hard and early, and we just started meds that ramp it up to 11.\n\nWe both can really use a few laughs while we deal with the roller coaster of hormones and emotions. Currently my wife does not want to eat anything except for Tostitos, which are apparently crack.\n\nOur best story from last time: A few years ago we did blood work in the morning (and had apple juice) then went to Lowe’s to pick out paint colors for the nursery. She got so nauseous she had to lay down right there in the paint aisle. Someone came over to ask if she was ok. She said she might throw up. The guy ran to get her a bucket. As he was running back toward her, she threw up the apple juice and breakfast all over the floor.. right by his feet.\n\nHe just looked so disappointed looking down at the mess, then shrugged and flipped the bucket upside down to cover the mess. I heard them announce on the loudspeaker “cleanup in paint department.” It was like something out of a cartoon.\n\nBy then there was a crowd around us. People asking if she has some medical condition and should we call an ambulance. This isn’t normal and looks so bad, they said. Then I told everyone she was pregnant. There was just a collective “OHH” from the crowd. Oh ok, then she’s fine, someone said. And the crowd dispersed. The Lowe’s employees were so nice about it and helped us check out and stayed with her while I brought the car around. We went home and she went straight to bed and slept for 4 hours.\n\nTo this day, she has never returned to that store, and has never had apple juice again 🤣\n\nStill we wouldn’t change this wonderful and exciting time for anything. Let’s hear your stories!"
  },
  {
    "post_id": "374j8a",
    "title": "Clever Girl",
    "body": "**Setup:** \n\nI have twins, a boy and a girl, both just turned 3. They share a room.\n\nMy daughter is autistic, and has trouble communicating. She doesn't really talk (just a few words), and doesn't tell us when she's hungry or tired or even hurt. We just have to guess.\n\nWhen my son wakes up in the morning, he bangs on the door or yells until one of us comes to get him. But if my daughter wakes up first, she just sits in her bed quietly, sadly until we come in for some other reason.\n\nBut where people often screw up is by mistaking \"inability to communicate\" with \"unintelligent\".\n\n**Story:**\n\nSo the day after their birthday, all the new toys are still out in the living room. She wakes up first the next day, and decides she wants to go play with them. But how? The door is closed, and she doesn't know how to wake us up. A conundrum, to be sure. The only birthday toy in their room is the foam, Nerf-like Thor's hammer.\n\nSo I am awoken to the sound of my son screaming in pain. I run in to the room. He's half-asleep, clutching his head, yelling \"Ouch! Ouch!\". She is standing next to his bed, Thor's hammer in hand. As soon as I open the door, she gets the biggest grin on her face, runs out the door, and goes straight to her new toys in the living room.\n\nShe was hitting him with the hammer in his sleep until he woke up screaming. Because he knows how to get our attention, *she used his pain as an alarm to get the door open.*\n\nI'm impressed with the problem-solving, but terrified at the implications."
  },
  {
    "post_id": "1fuzehg",
    "title": "Worst thing you’ve said to your partner",
    "body": "So I already know I’m in an abusive relationship, unfortunately for many reasons one I cannot leave at this time. I’m just starting to somewhat normalize this behavior and it’s really bringing me down. Just curious what the worst thing you’ve said/say in a fight with your partner is. I’ve asked multiple female friends if their partner has ever told them to STFU and they insist no but like I said, it’s just starting to feel like it’s normal. Let a mama know"
  },
  {
    "post_id": "1ae7kxi",
    "title": "Worried about raising a son",
    "body": "Just found out the gender today. My wife and I both said we don't really care either way but when I found out it's a boy I felt this completely unexpected sense of disappointment. I didn't know where it came from and immediately felt insanely bad. \n\nMy wife doesn't know the gender because I am doing a gender reveal for her and her family in 2 weeks so just I know\n\nI thought about it and I think I have a lot of insecurities about the fact that I was never a \"guys guy\". I never really got into sports or any kind of stereotypical guy stuff. I was bullied for reading books. My family always made me babysit the younger cousins while all the older male cousins went off and did something else. I was always considered the soft responsible boy. \n\nI think I am worried that I won't be a good role model for him. He will be into that stuff and I wouldn't be able to relate or show him anything or something like that. Idk\n\nI feel like shit and I feel like shit because I feel like shit and this is supposed to be a happy thing. \n\nAll of this became very real today and I am just a bit overwhelmed I think"
  },
  {
    "post_id": "b76r68",
    "title": "Divorce sucks",
    "body": "I'm a single dad after a nasty divorce.  Because I live across the country from my ex, my parenting time sucks and I only get time with my kid on her standard school breaks.  My 5 year old daughter is currently with me for her spring break which is about a week long and she goes back to her mother on Sunday. We've had a great week together doing all kinds of fun stuff but tonight she was having a particularly hard time trying to go to bed. She said she was really sad that she had to leave me.  When I gave her a big hug before bed she held me tight and said \"I wish this hug could last for forever.\" My heart melted and now I'm practically in tears typing this.  Divorce sucks and I don't wish it on any child."
  },
  {
    "post_id": "17ywlou",
    "title": "3 YO Daughter Made Me Cry This Morning",
    "body": "We upgraded my kiddo to a big kid bed a little over a month ago and ever since then, it's been ALL mama at bed time, over night if she needs it, and in the morning. She will literally scamper away shrieking if I try and comfort her. All other times of the day she's fine. But these times are all mama. This morning my wife got me up cause we could hear her yelling in her room. I get up knowing full well how it'll go. \n\nI open the door and as soon as she sees me it's immediately \"go back to bed daddy I want MOMMY\". With moms help I get her downstairs in a well enough mood and mom returns to bed. The next 45 minutes are full of \"I wanna go get mommy, I don't want you\" but what got me was this morning was the first time she said \"I don't like you\" and man it really got me. I KNOW it's a phase. I KNOW she doesn't mean it. But shit man it sucks. It sucks alllll around. I hope this passes soon cause it's killing me."
  },
  {
    "post_id": "rtxz79",
    "title": "Loss at 19 weeks",
    "body": "On Thursday, we went in for our anatomy scan. Everything with the baby was perfect but we found out that my wife’s cervix was preparing for birth. \n\nWe stayed over night hoping it would go down with medicine. It did not. We were discharged and told to await for her water to break.\n\nWe are waiting. I’m at a loss. I had just completed the nursery over Christmas break, we were so excited to meet her. \n\nSince the news, I’ve tried to remain strong for my wife but today as we watched television, I looked at the framed picture of our first ultrasound then at the fucking penguin ornament my mother got us that had two penguins and the words “expecting” and it broke me.\n\nIt’s strange, this is my first major loss (minus grandparents) and it’s weird how I’m okay one minute and then the smallest thing hits me. I want this to be over and I know the hard part has yet to happen. \n\nJust needed to vent."
  },
  {
    "post_id": "1c6ntp0",
    "title": "Parenting is less stressful if you assume your kids will live average lives. ",
    "body": "Realistically, most kids grow up to live pretty average lives. It’s not bad, and doesn’t mean you should just ignore your kid’s development. But, at the same time, it makes me realize I don’t need to worry so much. Sometimes my kids watch too much tv. Sometimes, I do too. \n\nI stayed up too late last night watching Brooklyn 99. Probably shouldn’t have, I was tired and less productive today. It wouldn’t be the end of the world if, in 30 years, my son does the same thing. \n\nIn all likelihood, my kids will end up living a life pretty similar to mine. Hopefully, a little better, but I don’t think that’s going to depend upon whether he has Reese’s Puffs for dinner a couple times.  "
  },
  {
    "post_id": "3an7yx",
    "title": "First Father's Day since wife's hysterectomy - we never had kids.",
    "body": "Throw Away Account\n\nI am 36, and my wife 35. We have been married for 15 years, and while we always talked about having kids, we never did. Both of us wanted children, the time was just never right for us. But we both looked forward to one day being parents, and growing our family. About two years ago my wife began having pain in her hip, which kept her awake most nights, and made managing through the day difficult.  After a visit to the doctor and a few tests we learned of numerous fibroids on the inside and outside of her uterus. The first course of care was a prescription of birth control pills, the hope was that they would shrink the fibroids, thereby reducing the pain; unfortunately this did not work.\n\nWe met with her doctor about next steps, and her options were not great. The first option was to burn them off, which did not guarantee they would not return. The second option was to tie them off, keeping the blood from getting to the fibroids and they would die off, again no guarantee that they would not come back, in fact the doctor was certain of their return. The final option which was the most drastic was a full hysterectomy, the only guarantee that the fibroids would be gone forever.  The decision needed to be made, we were both scared, and all I wanted was for pain to go away and her suffering to stop. We knew this would be the final word on our having a baby, but that was nothing more than collateral damage at this point.\n\nShe had the surgery, stayed in the hospital for two days, and took about a month to recover, but there has been no more pain, and her spirits haven’t been so high in I couldn’t remember how long.\nBut today has been a rough one for me. We had brunch at her parents with her sister, her husband, and their new baby. As my father-in-law and brother-in-law opened their cards and gifts, I couldn’t help but feel a bit sad. Yes we have been married for 15 years, but the decision to not have children was always our own. Now that decision has been made for us, and it never really hit me until today. There is no way I can talk about this with my wife, I know she already feels responsible for us not being able to have a baby, I have no desire to add to her plate. I don’t even know if I have a right to have these feelings, but I do, and putting them down has made me feel just a bit better. But I will be happy when today is over.\n\nI know we can adopt, and while that is a noble action, it is not the same as having our own. We haven’t dismissed the idea completely, but I don’t think it is something which would work for us.\n\nI do want to wish all of the dads a happy father's day. Please do not ever take your children for granted.\n\nTL;DR – Wife had uterus removed, I will never get a tacky tie for Father’s Day\n"
  },
  {
    "post_id": "x9vn5s",
    "title": "Scary dad day and dealing with severe anxiety.",
    "body": "So let me own this and start by saying I suffer from depression and anxiety. It's not something I disclose to potential employers, but I do own it. Since becoming a dad I have much better control over this. \nI had to rush my 4yo daughter to urgent care last weekend as she had severe hip pain and couldn't really walk. Her tears started to become my tears. I kept composure as the doctor ran my daughter through tests and discussed her recent medical history. I was thinking the worst. She quickly was diagnosed with Toxic synovitis. They say it's incredibly common yet no one I know has heard of it. It's when a cold virus reappears and causes hip swelling weeks after recovery. \nAfter the diagnosis of relatively good news I just let it out. The doctor had to tell me it was ok there was nothing I could do as a father to prevent this. Even my daughter just gave me a hug while I was crying a bit at the doctor's office.\nShe got her day on the couch along with ice cream, screen time, a 2hr puppet show and got to be carried for a day. \nThe next day my wife had to work so it was just me with our baby and my 4yo. She just kept jumping around. All day. Doing yoga behind my back. Just one day of rest and ibuprofen is all she needed.\nMy anxiety hit me really hard. It's gotten so much better and my panic attack frequency is soo much lower since being a dad. But when panic attacks do come they seem to hit harder and longer. Parenting does funny things.\nJust wanted to share a story with you all."
  },
  {
    "post_id": "4gmase",
    "title": "Guys, I dropped the ball",
    "body": "This was today. \n\nWell, a few weeks Ago, the worst culminating today. \n\nMy wife hates hospitals and wants nothing more from this world than to deliver a baby in a birthing center, with no medications, no fear of c sections, with a midwife. \n\nI'm a nurse. I was hesitant at first, but got fully on board, and became extremely excited. We've been going to classes with the birthing center. Meeting other families. Relaxing in the spa-like rooms where she'll be delivering, with no medical interference. \n\nQuiet, filled with music, her and I, the dream she's always had. \n\nI had recently switched jobs/insurances without thinking about the implications it would have on this. \n\nWell, the insurance company said they were out of network. But no worries! A facility upgrade rider would make it all ok, and I just needed to apply before the birth. Phew! \n\nHere I am. Twenty days away from our due date. To be told it isn't covered. At all. Under any circumstances. \n\nA charge that was anticipated to be $500 is now $5,000+ and out of my budget, easily. \n\nMy wife is devastated. I'm a healthy mixture of angry and disappointed that my wife can't have what she wants out of such a special event. She has been beyond looking forward to this. \n\nSo now we have to find a hospital. With strangers we've never met. To give birth in a clinical environment neither of us want in any way whatsoever. \n\nFuck. Me. "
  },
  {
    "post_id": "1clm1dn",
    "title": "Just lost $19k ..",
    "body": "On the town pre-k lottery. Applied back in October, 35seconds after the application opened up and apparently that was too late to get into the town pre-k program. \n\nSo it’s another year of two in daycare, we thought it would just be one. We won’t see the $19k I was hoping for unless enough other spots open up from people offered who won’t accept it, which I just don’t see as likely. Thankfully, we can afford it if forced - but certainly don’t want to.\n\nAnd now to plan how to share with my wife that the budget doesn’t change! Damn childcare costs!"
  },
  {
    "post_id": "1bl5kr8",
    "title": "When did Daddit become parenting2 ?",
    "body": "This used to be a space for *dads* to talk to other *dads* but is quickly morphing into just another mom group. A week ago, I saw a lot of discussion over mommy blogs. Today, I saw a post that was specifically looking for mom opinions in a dad sub. Why not just go to a different sub where that's exactly what you'll get? \n\nI don't understand the desire to homogenize a by-dads-for-dads sub to be exactly like every other parenting sub full of predominantly maternal opinions. I just think the women that feel the need to butt in here and the handful of dads that don't get it are doing the rest of us a disservice and disrespect. \n\nIs this the new norm? Daddit is just going to be divorce talk and 50%+ mothers?"
  },
  {
    "post_id": "1003eg4",
    "title": "Happy new year with a PTSD wife.",
    "body": "We've had brother in law round and her sister, drinks have been flowing...\n\nI ain't got time to explain the delicacies.\n\n\nNow I'm in the kiddies room having been physically assaulted numerous times.\n\nI've triggered a dragon inadvertently so now I'm hiding out of the way near the precious person who is asleep.\n\nWife has some serious explaining to do tomorrow.\n\n\nI'm responsible too, I'm drinking alcohol and enjoying the evening but a line got crossed by her and I am VERY unhappy."
  },
  {
    "post_id": "1d4cnxn",
    "title": "It is hard to come back to empty house after I drive my daughter back to her mom’s",
    "body": "My daughter is almost 4 and lives with her mom. I spend quite a lot of time with my daughter. Well more than my official time share per divorce ruling. I am much more than a typical divorced weekend dad, I love it and have a good hang of the whole thing, including girly stuff, rainbows and unicorns. \n\nI live well, my daughter has her own bedroom at my place, her own space and stuff. She has friends here, we got our own habits and routines, we go to „our” shop for a snack, and so on. Even though a 3,5-4 year old is a handful, time when she is around is a joy. There’s energy, there’s fun, doing stuff together. Good time. \n\nBut the time I drive her back to her mom’s or drop her off to kindergarten, and I know I will not see her for some time, fucking sucks. Usually it is just a couple of days, sure. But I truly fucking hate going back to my place in that moment, it just feels so empty. Like, an hour ago she was blabbing what shoes to wear and what teddy bear to take for a ride, and now it is just empty, with snacks on the floor and other traces of little girl activity. \n\n\nIt is just too empty and too quiet. Even though I think I’m mature emotionally and quite stable in that regard, it just feels like it is too hard to adjust, like the change is almost too radical for the brain to adjust.\n\nIt gets better, sure. But the first day fucking sucks. \n\nNot asking for advice or anything. Just venting in the blind I guess.  "
  },
  {
    "post_id": "rf5r4q",
    "title": "They don’t grow too fast",
    "body": "People keep saying that “kids grow too fast” and I think that’s complete bollocks. Don’t misunderstand me, I’m very fond of the awesome moments we had and I’m still sad sometimes that I can’t rock my baby to sleep (unless she’s down with a cold that is) but my daughter is making me happy every day and I look forward to see her smile tomorrow.\n\nI used to be focused on the past and dwell on mistakes, missed opportunities and such but since her birth, I’m better able to enjoy the present and I’m looking forward to the future.\n\nI’m writing this while thinking about a good friend who died recently (went to her funeral this afternoon) and yes I miss her and there’s a lot of things I wish I had told her but I’m not crushed as I know I would have been three years ago before my daughter was born. My friend lived in the present and she was happy. I guess I managed to understand how she viewed the world after all.\n\nHug your kids, not because you might not see them tomorrow but because being with them today makes you happy. They don’t grow too fast, they grow at just the right speed - accelerate to keep up."
  },
  {
    "post_id": "18emilw",
    "title": "Advice on how to come back from this….",
    "body": "Hey guys,\n\nSo while not 100% dad related, I had a moment last night that I’m sad to say may change my marriage forever…\n\nMy wife was on a work trip last week, which left me alone with the kids for the week.  It happens a few times a year but for some reason, this time, both of us felt the separation much more than normal.  I’m not sure if it is because of the holidays coming up or because of a few other things we have going on.  But we both agreed that this trip felt much longer than the average one.  \n\nSo, anyway, my wife comes home last night, takes her normal post-plane shower, hangs out with the kids until bedtime and heads off to bed to relax while I put the kids to bed.  \n\nFinally, I join her in bed, nothing dirty or anything going on but she lays on my chest so she could cuddle in.  After a minute, she says, “I hope I’m not smothering you, I just wanted to be close to you!” \n\n….and this is where my life changed forever…\n\nIn my attempt to convey to her that I missed her as much as wanted to be close to her as well, I said to her, without thinking, “Are you kidding? I want you inside of me….”\n\nNow…what I meant was I wish she was so close to me that our bodies somehow merged into one so we physically couldn’t be any closer…..but that’s not what I said, unfortunately….I said, to my wife who is, let’s just say, not afraid to break my balls, “I want you inside of me….” \n\nHow do I come back from this?"
  },
  {
    "post_id": "1dfyp5i",
    "title": "Any new dads getting the Father's Day guilt trip now or in the past?",
    "body": "Hi Fellow Dads,\n\nI've been a father for about two years now and was looking forward to celebrating Father's Day by doing something I enjoy—whether it's watching movies alone, cooking a gigantic steak with some cold beers, or just hanging out with my little family.\n\nBut my own dad called me selfish for wanting to do my own thing, even after I offered to compromise by spending the Saturday before with him and my son. I lost my cool on the phone, told him HE was being the selfish one and hung up -- a bit of breaking point after constant guilt trips from him on not seeing his grandson enough (despite not doing very basic baby proofing of his house, which I've offered).\n\nHas anyone else experienced this? How did you handle it?\n\nI understand Father's Day is still a special day for him, and I respect his feelings. But it seems especially unfair that he doesn't see how important this day has become for me as an exhausted dad working full time.\n\nWould love to hear your thoughts and experiences."
  },
  {
    "post_id": "17xd8ym",
    "title": "Best way to handle annoying neighborhood kid?",
    "body": "So my next door neighbor has a kid that's 7 or 8. This kid is always up my ass if he spots me. If he sees me come home he will run over to my truck and wait for me to open my door. My kitchen faces the street and he will stand on the sidewalk and wave at me until I look at him from inside my house. He has even jumped up in front of the windows waving his arms. If I leave my garage open he will go inside and hang out. If I leave the gate to my fence open he will start roaming around my backyard. If he hears me working behind the fence he will yell through the fence to get my attention or lob toys over it on purpose to ask for my help. I will try to walk my infant son in the stroller he will just follow me and pestering with me personal queations about my life and my stuff.The kid is obviously craving attention.\n\nI have brought it up with his parents and they just shrugged and said he is like that. It seems like they force him outside because he is bothering them. I have also kindly told him to stay out of my backyard and garage but he quickly forgets. There are other kids his age around but they seem to avoid him because he is so needy.\n\nI dont want to be a scrooge to the kid but I honestly dread going outside and find myself scoping the area out to make sure he is not around. It makes me cringe when I am outside and I hear his \"HEY\" off on the distance. What's the best way to handle this?"
  },
  {
    "post_id": "1eqeo9r",
    "title": "Daughter’s old daycare continued to pull payments despite being unenrolled",
    "body": "So on June 12th I had emailed my daughter’s old daycare saying she would be switching daycares, and her last day at the old location was June 14th. However, they continued to pull payments up to July 19th. They only require 10 days notice so I know that isn’t right, and these were unauthorized payments.\n\nOver the past couple days I’ve tried reaching out but haven’t been able to get a hold of anyone that’s willing to help me over at the old daycare, just reaching dead ends with voicemails and nobody getting back to me.\n\nI’m not missing something, am I? Like it’s not a case where I can’t get that money back, right? Or is this something that I just need to be more diligent about?"
  },
  {
    "post_id": "143ap2b",
    "title": "Support needed - vaccinated and boosted wife has Covid at 20 weeks…",
    "body": "Wife is 20 weeks pregnant vaccinated and boosted and just tested positive for Covid. This is our first and I am very scared for our baby. Looking for advice and positive stories from others who have had a similar situation.\n\n—\nEdit: Thank you all for your stories and support! \n\nWe checked with our doctors and they were not overly concerned with risks. They prescribed Paxlovid to take within first 5 days of onset of symptoms, if symptoms get worse. Right now everything is mild so we are just in wait and see stage. \n\nThis really helped put my mind at ease so I can get out of the anxiety cycle and be helpful to my wife and the our little girl on the way! Thank you!"
  },
  {
    "post_id": "1cfxa0h",
    "title": "Advice on dealing with a toddler terrorist?",
    "body": "My son has officially entered his terrible two's with a bang. Over the last month he's gone from a generally sweet kid to all out war over anything.\n\nWe went through this with his sister but not nearly to this extent. Usually we could let her burn for a minute, use timeout or take something away as a consequence and then talk her down after a couple minutes.\n\nThis kid loves to go scorched earth, he hits, bites, throws, kicks, anything in his path. We've tried redirection, ignoring, timeout, even tried spanking him once and nothing. If you let him burn he takes it as a personal challenge and rages on.\n\nI'm at a loss how to deal with it, the tiniest thing sets him off then my wife and I have no idea what to do with him. We've resorted to bringing a pack N play upstairs for controlled timeout where he can't be destructive.\n\nAny advice on dealing with a kid like this?"
  },
  {
    "post_id": "vecjzu",
    "title": "I just became a father on Monday",
    "body": "My 4 day old daughter is currently sleeping on my chest while mom is sleeping upstairs. Are there any tips any of you can give a new dad? I had a mild freakout yesterday because she was sleeping a lot and hadn't pooped all day. Are these fears normal?"
  },
  {
    "post_id": "119ysdm",
    "title": "Helps for a depressed new dad?",
    "body": "My husband and I had a baby 4 months ago. My husband has always had anxiety and depression that was managed with medication but it seems to be getting worse since the baby arrived. \n\nI don't even know where to start. He's always miserable, overly stressed, working too much, and suffering from poor sleep. He loves his baby but He's unhappy with himself, his job is too stressful because no one works as hard as him and he 'has to do it all'. There's never a day where I ask how he is and he has something positive to say. \n\nI ask him often what I can do to help, I try to make sure he gets a huge block for exercise on the weekend (it's not frequent enough), he said hearing my problems stresses him out so I try not to bring things up if I can. I'm really not a particularly emotional person but I do ocassionally go throughshort rough patches like anyone else. Anytime I'm struggling with something he mentions he can't deal; it's too stressful for him. \n\nI've suggested therapy 3 times a week at this point but he didn't find it helpful in the past and doesn't want to try it again. When he went through this 15 years ago he was always angry at me and constantly started fights with lots of yelling and criticizing. At the time I tried everything to help him out- took him to hypnotherapy, yoga, etc. the medication is the only thing that worked. Luckily that is behind us and we were happy for many many years. \n\nI know you're not supposed to say this but he's making me miserable and I'm annoyed he won't help himself or just get over it. Just do something about it. Now we have a baby I don't have the time to try to help him find solutions. He needs to help himself.  \n\nI don't know what else I should add or what I should do. I guess I just wanted to get it out there and maybe that will help me think through what comes next. I just wish he was more resilient."
  },
  {
    "post_id": "7v7slu",
    "title": "Newly graduated, baby is having difficulty breastfeeding, fights against Mom, days and nights swapped, something isn’t working",
    "body": "Dads I need help! \n\nMy wife is having a hard time getting our 4 day old string bean to breastfeed. She will make hunger cues, sticking tongue out, suckling hands, rooting with her mouth, but when she is placed next to a nipple/boob (both football and cross over positions) she will either suck a little while poorly latched, hurting my wife, then start screaming or she will just scream and push away, yet scream and make hunger cues. We know she is hungry because it’ll be 2-3 hours between attempts.  We’ve resorted to pumping and using a super low flow nipple bottle so we know she’s getting fed because she cries so much when trying to latch, my decision because I’d rather know she is fed.\n\nWe were in hospital for 3 days due to c section and we had lactation visit us, but every time they came she latched almost perfectly, and at for 20minutes. Except the last time as I was away packing car up the lactation nurse was thinking of keep us there another day then squirt finally latched. When they weren’t there, it was a struggle as it is now at home! She’s like the reversed Michigan j frog. \n\nDuring hospital stay bean would spit up during the night, she would finally fall asleep, but then nurses would come make her mad and then leave 😡. Leaving my poor wife stay up with her to try and feed, whenever I tried to hold her she’d start making feeding cues but would proceed to cry, fight and push away from Mom! Doesn’t help that daughter didn’t poop until we got her home, although she did have a big one during labor, then she had 2 back to back. \n\nAdd in that she has her days and night switched and will sleep during the day with occasional cries that stop the nap attempt and then at night she will not sleep anywhere else but in someone’s arms. \n\nMy questions are numerous so thanks in advance for any help:\n\n1. Baby won’t latch even trying the lip tease, expressing milk, etc. she makes hunger cues but fights at the nipple, will get a nipple shield today **what else can I do to help, I refuse to feel helpless while my wife cries?** (she already gets overwhelmed emotionally just like her mother, add in a huge estrogen dump and it’s brutal)\n\n2. What else can we try to get her to latch? She knows she’s hungry, she knows she needs something in her mouth, but when she gets it she screams with a nipple in her mouth and pushes away!\n\n3. Nights and days swapped, won’t sleep in bassinet only sleeps when held at night (naturally angled), spit ups. Is this possible signs of reflux? \n\n4. Why does she let out sudden cries when sleeping and sometimes a simple shhhh shhhh will soothe her? \n\n5. I decided to give her the bottle of pumped milk, it was either that or she starve. My wife tried pumping this morning and only got like 1oz from each side, should I start researching formula? \n\n6. Should we increase how often we just try to feed her? Sort of feeding before she really makes the motions?\n\n\nThanks again /r/daddit, I hope my sleep deprived state came across well, any other tips will be greatly appreciated!"
  },
  {
    "post_id": "14p57nl",
    "title": "*Venting / question* As a very tech-y dad, how do you talk your significant other *out* of needless technology purchases, i.e. a touchscreen toaster?",
    "body": "I'm usually the first guy to jump on the technology bandwagon, but my wife is currently driving me crazy. We just moved and she is on this weird technology kick, She is now determined, hell or high water, to buy a ridiculous toaster w/ a billion settings and a touch screen.\n\nWe just returned our second toaster in a row that crapped out after less than a week (buying weird brands on Amazon) and for some odd reason, I cannot convince her that a standard, high-quality 4 slot toaster is good enough for us. I love technology, but it's toast. You choose a setting, you push the toast down... you don't need to add touchscreen technology to a toaster. The last one we had (that broke today)... you had to - power it on, select a darkness setting, chose normal or bagel, hit start, then push the handle down. On a regular toaster you... turn a knob, push the handle. Why do we have to complicate everything.\n\nSo, the first part is a vent. The second part is... if a rational argument doesn't work, do I just let her keep buying crappy touchscreen toasters until one finally burns our house down? She's flabbergasted that I care so much about this, but I'm at a point where needless technology drives me nuts. I don't want to hit 34 buttons to make a piece of toast, I want to push *one.*\n\n*This is said as half vent, half serious question... but seriously... everything doesn't need to be digital.*"
  },
  {
    "post_id": "kv42sx",
    "title": "What’s the one thing you wish you knew before your kid was born?",
    "body": "We just found out my wife is pregnant, very early stages. It feels so conceptual at the moment and I don’t think it’s hit me just yet, but I do go from being excited to terrified then back to excited again. I just want to tell everyone but I’m also very anxious that something will go wrong. \n\nI found this sub and wanted to know, what’s the one thing you wish you knew before your kid was born? \n\nI want to be the best Dad ever but I don’t even know where to start."
  },
  {
    "post_id": "67f8q8",
    "title": "Having a girl and not sure how I feel about it.",
    "body": "Hi all. Bit of a rant/vent/sook, but looking for advice and experience as well. \n\nJust had our 20 week scan, which was crap as far as \"photos\" go, 1 half decent photo out of 42, so I have booked us for a suprise scan with a private company for 3d and 4d scans in a few weeks, bub is perfectly fine, perfect size, strong heartbeat, wiggling round like a legend, but that's not the point of this post.. \n\nWe found out that we are having a girl, being like (I assume most guys) I wanted to have a little boy to bro it up with, I stupidly built up the picture of being a dad revolving around having a boy (and I made a post a little while ago second guessing my Dad-idness, which I'm still doing) and now that we are having a girl it's thrown everything for a loop for me. \n\nI have a nephew and a few neices, and I connect with the nephew more.. I get along with the girls fine, but there is always a small bit of awkwardness, I don't know what it is, I can girly it up with the best of them, I'm not ashamed to wear a dress or skirt, or paint my nails, or braid hair.. But there is just something there that I don't seem to have with my nephew.\n\nI'm a 'bloke-y' guy, I work on cars, ride motorbikes, weld, build shit, camp, 4wd.. I was looking forward to teaching my son all these kinds of things. \nI know 'nurture' has alot to do with it but I can't see myself really doing these types of things with a daughter, 'most girls (yeah yeah I know...) aren't into this type of fun, and would rather play house and dolls. I'm worried that there will be a bit of a disconnect there between me and her. \n\nAnyway, getting to the point.. To the dad's out there that have been in the same situation, how was/is it? Did all these thoughts up and disappear once bub was born? Did it take time to adjust to having a daughter instead of a son? \n\nTo the dad's that wanted a girl from the start and got one, I'd like to hear the reasons why you wanted a girl, maybe I'm overlooking things or something.. \n\nTL:DR. wanted a boy, getting a girl, want to hear from dad's with daughter about their feelings on the matter.."
  },
  {
    "post_id": "fedm0a",
    "title": "Push present for dad?",
    "body": "Ok, so before I start, I find the whole idea of a push present extravagant. However I feel like this situation is the exception. This is going to be long and (sorry) emotional. \n\nI am married to the most amazing man in the world. He is the absolute best father to my two step kids. I never wanted children until I saw them together and my heart melted. He initially didn't want anymore kids out of respect for his first two and I was very much on board. Over time that began to change, first for me and then for him. I never wanted to push him, I had /have so much love and respect for him and my bonus kids. I'd be lying though if I said it didn't hurt. I think he began to see it and he ended up getting a vasectomy reversal. (According to him he also thought I was a wonderful mother to them or he wouldn't have married me. Later he said he wanted to give me that experience.) \n\nWe were both very excited to start trying and we were so optimistic. Why shouldn't we be? I finally got pregnant after several months and we were ecstatic. Unfortunately I lost that pregnancy. We were devastated. I've never seen my husband so hurt. We lost another and he completely shut down. It was a dark time for both of us. We fought a lot and somehow it didn't destroy our marriage.\n\nWe continued trying for another 2 years, for three total. We had started seeing a fertility specialist when we managed to get pregnant on our own again. Third time was a charm and I got to bring home the baby boy I prayed so hard for yesterday. Not only did my husband give me the baby I desperately desired, he was literally perfect for the entire labor. Since we've been home, he has jumped up to retrieve our son every time he cries and I haven't had to lift a finger. (I tore pretty bad and we opted for a birthing center so we were home 4 hours after he was born)\n\nThis man literally deserves the world, but I can't give it to him. Please give me some ideas."
  },
  {
    "post_id": "1d10wf8",
    "title": "LO had emergency surgery ",
    "body": "Hey pops and lurking moms!\n\nI had the day off this Thursday to have a scheduled 2,5 year checkup with our little guy. While preparing breakfast which is his favorite meal hands down, gladly eats once at home and then again at daycare, he starts to complain about tummy aches.\n\nSince he was born with a condition (duodenal atresia) that required surgery when he was just a few days old we’ve been told to have a low bar with seeking medical attention for him with tummy related things. \n\nAches continued and he refused food and just wanted to lean against me so I packed a quick bag and headed to the hospital. Got admitted and he basically slept all day, just woke up to cry from pain and throw up once. Slept through X-rays and them drawing blood. Overnight it got worse, lots of throwing up, slight fever, pain and abdominal swelling. So in the morning we got transferred to the same hospital where he was born and had his first surgery in, new X-rays which show some intestinal obstruction but unclear what, but surgery was needed to find out more and correct.\n\nSo quickly transferred internally to surgery, showered and prepped and I got to hold him in my arms while they prepared the anesthesia. Then had to leave for a 4-5 hours which felt like forever while they operated on him. \n\nSurgery was a success and now my wife and I is staying with him for his recovery, probably a week at this hospital, which is in a different city than we live in, then probably a few days at primary hospital and a few days at home, all depending on how it goes.\n\nHe’s been sleeping most of his recovery so far but wakes up wanting to eat or drink which he can’t do yet, and it’s so heartbreaking to have to deny him this, but a few more days and it should be okay.\n\nI don’t really know what I hope to gain from this post, but mentally I think it’s good to type out and share, knowing all the support I’ve seen all you guys dish out while I’ve been lurking it seemed like the right place.\n\nIt’s just tough knowing my son is barely 2 1/2 years old and already had 2 surgeries, more than most people have all their life."
  },
  {
    "post_id": "1bax5uo",
    "title": "Does everyone experience that feeling like you just don't have what it takes?",
    "body": "I recently quit my job to try and work freelance and be more supportive for my son&wife.\n\nMy wife was really struggling with me working full time in the job I was in. I've always dreamed of going out on my own. So seemed like the right thing to do.\n\nBut I don't know if I'm just having a bad day or what but im really struggling right now... Which is maybe the worst time for it as I'm needed more than ever to get up and running at get money flowing back into our accounts.\n\nMy 5 month old son won't be out down for more than a few minutes at a time. He has to sleep with someone there and feed all night. Rarely if ever sleeps for more than 2 hours and naps for no more than 30/40 mins. I loose my temper soo much his fussing noises just make me soo uncomfortable I can't stand it."
  },
  {
    "post_id": "vnauqj",
    "title": "Clueless new dad 😵‍💫",
    "body": "Hello daddit!\n\nI’m on my way to become a dad. Wife is currently week 15 of a difficult pregnancy with lots of morning sickness. \n\nThing is…what do I do? \n\nI feel totally lost and I feel like I should be doing something.  I didn’t even know my wife should be doing pelvic floor exercises, buying a pregnancy pillow etc at this stage until she told me. \n\nHow do I get ahead of the curve and be more prepared. Is there anything I should be doing now, third trimester, birth and beyond?\n\nCheers in advance."
  },
  {
    "post_id": "z180c6",
    "title": "Dad depression/anxiety after the birth",
    "body": "Hi Dad's, looking for some advice. Baby is a week old now and I've been feeling really negative thoughts (constantly worrying about SIDS). The birth was quite traumatic as she got stuck on the way out and the suction cup didn't work. Baby came out unconscious. She's come to very quickly and everything is okay now. Very alert and happy baby. Wife had to have two cuts to help with the whole process and she's healing fine now. \n\nBasically wanted to know if anyone else has felt this way after the birth and if it's normal or if I need to get some help. TYIA"
  },
  {
    "post_id": "1feb3ax",
    "title": "[Advice Request] Cable news and political influencing at daycare.",
    "body": "We have gone to great lengths to minimize our kids exposure to national news, politics etc in our home.  Yesterday, I had the predeabate on for about thirty seconds when the talking heads triggered my six year old daughter to tell me who the good guys and bad guys are, who needs to win, etc.  It turns out the daycare provider is exposing the kids to cable news and providing commentary to help them understand.  Unfortunately her views differ from ours and so hearing this from our child was extremely disturbing.  I texted the provider and she attempted to downplay and was telling a much different story about how this goes on than my daughter.  I feel like our trust has been betrayed and we need to pull them for expressing our daughters to such inappropriate content.  Please help me convince my wife or talk me down."
  },
  {
    "post_id": "y0qkb7",
    "title": "Single dads. How do you do it?",
    "body": "I’ve been a single dad for almost 2 years now. If it wasn’t for my parents helping with childcare I’d be completely broke. How do you guys do it? I’ve seen super lean, happy and healthy single dads. I’d like to be that for my daughter. \n\nMy relationship breakdown took quite the toll on my mind and body. My toddler makes every day worth it though.\n\n\nFor context I’m a U.K. dad."
  },
  {
    "post_id": "l88g9h",
    "title": "Should I feel guilty if I have to call out of work for the birth of my first child?",
    "body": "Title says it all. My girlfriend is going back to the doctor on Monday and if her blood pressure is still high, she will be induced on that day. I’ve been losing sleep and stressing about having to call out of work for a day or two next week. We’ve already been brutally understaffed the last few weeks, so I know me calling out would hurt. I’m super excited for my baby boy, but thinking about work is putting a damper on things for me."
  },
  {
    "post_id": "yrypz4",
    "title": "Question about hospital etiquette",
    "body": "Hello fellow dads. I'm currently in the children's hospital with my 7mo son who has RSV. My parents brought my wife and I dinner (sushi, it was delicious) and my dad brought two beers. One for me, one for him. I felt super weird about it because my son is laying there sick in a hospital bed and I'm cracking open a beer. My dad is not the kind of guy who brings a beer everywhere he goes. I think he just was thinking I've had a rough day and he wanted to have a beer with his son. I drank it because I felt bad saying no, and now I'm feeling very guilty. My wife was very uncomfortable with it and said she feels like the nurse was judging us. My mom even said she didn't think it was a big deal and she is hyper-aware (to a fault) of potentially inappropriate behavior. But we still feel like it shouldn't have happened. What do you guys think? \n\nMy boy is doing ok. Much better than this morning. He's a trooper and I'm very proud of him. Got him on oxygen until he can maintain acceptable blood oxygen levels on his own. Hope you're all staying safe!\n\nEdit: Thank you everyone for the reassurance. You guys are the best. I love this place."
  },
  {
    "post_id": "18rkkdl",
    "title": "How do you handy the uncertainty?",
    "body": "Hey Dads! (And lurking mums!)\n\nFirst time poster here so go easy. My wife is currently 37 weeks plus 2 days, so really we’re in the territory of ‘good to go’ anytime in the next 4 weeks or so.\n\nHow did you guys handle the uncertainty?\n\nThis is our first child - so I know my life is going to change in huge ways I can’t comprehend - and that is giving me some anxiety. But on top of that, not knowing WHEN that will happen is real tough, especially for someone who likes order, organisation and plans and struggles a little with change. Waking up knowing that today could be THE DAY is wild. \n\nWe’ve got minimal plans for January, but obviously work, a hospital referral for me and a few other minor things in the calendar we will obviously be happy to miss if it all kicks off, but not knowing is nuts. \n\nHow did you guys cope with it? Any tips? Any wild stories for me of the days immediately preceding your births?\n\nBig festive love to you all."
  },
  {
    "post_id": "1b2y2gt",
    "title": "Is there something I'm missing in this situation?",
    "body": "  \n\nBit of a rant but want to know if I’m being selfish here \n\nSo here's the situation, first time parents both 35, daughter coming up to 2 years in march. I work from home 4 out of 5 days of the week and in the office the other day. Mum left her job to do the childcare (her choice).\n\nMum is saying she is struggling and said she needs more free time, my suggestion was we alternate so each weekend one of us gets the day off, they can choose Saturday or Sunday and do whatever they want, the other day is then a family day. Then the following week the other person gets the day off.\n\nThis did not go down well, rather than looking at the prospect of having a guaranteed day all to herself every other week she looked at it as that will be 6 out of the 7 looking after the baby.  I actually think it is because she knows that she can basically say \"I'm having a rest this weekend\" and that's that unless i have pre booked something in advance.  \n\nI think it would be a good time to list out the daily routine now, so days I’m working from home look like this.\n\n6am – I get up with the baby, do breakfast etc…. mum comes down after having a shower usually gone 7, I then go and shower come back down to grab my coffee and am then asked to put the baby down for a nap around 8am and start work, \n\n9am – Baby wakes up, Mum dresses her, takes her out for a walk, to the shop, swimming etc…….\n\n11am - I take my laptop downstairs, prepare lunch for when Mum and baby return, \n\n11:30am - I take the dog out for a walk \n\n12:30pm – mum puts baby down for a nap \n\n3:30pm -baby wakes up, mum goes downstairs with baby, I take my laptop downstairs and prepare dinner whilst finishing up work for the day. \n\n4:15pm I finish work and we eat dinner \n\n5pm – I bath baby, mum washes pots \n\n6:45 – we both put baby to bed after I do the majority of the playing upto that point\n\nMum does most of the clothes washing and does hoover the downstairs during that first nap. That 3 hours during the main nap however is totally free. I get that that she can’t really disappear for 3 hours but there are plenty of things she could do for herself within that time, she chooses to sit in bed glued to her phone. I would kill for that free time during the day.\n\nThe day I go into the office, her mum comes round does a clean through of the house takes both the baby and dog out and baths the baby before I get back from the office (about half 5), I still do the wake up duties (I just set my alarm earlier to shower before baby gets up)\n\nWhen I take over at the weekend I don’t get any of the help which I give her. I Take both the baby and the dog out at the same time, I have to make the lunch when I get back and then I make the evening meal during that 3 hour nap. The only time I feel I truly get to myself is after 9pm when everyone else goes to bed and Tuesday night where I play football for an hour (after baby has gone to bed) \n\nI mange to get about one day (well 5 hours as I still do wake up, back before 3pm and kick something off in the slow cooker before I go) a month in which I can golf with my friends, but the mood I have to deal with the following days after asking permission sours the experience, she usually gets her mum round on these days too… \n\nMy Gf treats my work days as days off and when I suggested my alternate weekend idea she said I already get enough time off. Is this a valid view point that I’m just not seeing or can anyone suggest anything  different that I could propose to her? "
  },
  {
    "post_id": "1fmqdcn",
    "title": "Nightmare potty training",
    "body": "Looking for some advice dads. We’re having a nightmare potty training our son. 4 in December and has a complete meltdown if we sit him on the potty.\n\nI’m not just talking crying. Full on screaming like it’s the end of the world, flailing and fighting, reaching and clawing for our faces, biting.\n\nIf I even so much as suggest the potty, he’ll scream and run away for his bedroom to retreat and only come back if we reassure him there will be no potty.\n\nOn the rare occasions he actually sits, he says “try again later” the moment his ass touches the seat and then runs off. My partner’s stance is we tell him fine, and allow him to leave, then we try again later. The problem is, later never comes. It’s days before he actually goes as far as sitting again. It’s all very long and drawn out with what feels like no progress.\n\nWe’ve been trying for several months now. Books about potties. Songs about potties. Playing with his toys and teddies and showing him how they go potty. We’ve tried everything, I think!\n\nI tried taking a bit of a firmer stance and insisting he sits, I think mostly out of frustration which I feel a bit guilty about, but that results in a complete (and honestly violent) meltdown from him which I usually come away from scratched up and bitten.\n\nHe’s falling behind with this kind of thing compared to his friends at nursery and it’s beginning to cause a bit of tension between my partner and I.\n\nWhat are we doing wrong? How do I help my little boy overcome whatever challenges or fears he seems to be having?"
  },
  {
    "post_id": "3bxdmw",
    "title": "I'm having a hard time as a new father",
    "body": "This goes a little beyond the call of a father to your child. What I have a problem with is my child's mother. She does very little in the house, and uses the kid as a crutch. She's 3 months old and can hold her head up already, and we have this sling and a body carry suit that she just doesn't use. Nothing gets done at the house, she won't even cook. And on top of it all when it comes to making any decisions it's always \"I don't care.\" Or \"Up to you.\" It takes a toll on me in many ways, and it doesn't help that I'm working 19 hour shifts at my jobs and then I have to go home and cook clean and take care of our child. What do I do here fellow dads. Sorry if this isn't very clear, I'm basically dumping what's in my head out and I'm a little fumed since I just cleaned for the last 3 hours after working. Please help me understand what's going on or how I can approach this carefully to not hurt her feelings or diminish her meaning in the house."
  },
  {
    "post_id": "1asretc",
    "title": "My daughter fell on the ice today while playing in the snow. Three year old. I am feeling horrible.",
    "body": "Hi Daddit. Long-time lurker but first time poster. It's Friday evening as I type this and I have tears in my eyes and I am quite upset. Please be nice.\n\nI was playing with my daughter in the snow after picking her up from daycare. There was an icy patch and I told her to not go there and I would get salt so that it's not slippery. The second I turn my back to get salt, my daughter makes a dash for it and falls down, on solid ice, hard. I didn't see if she hit her head first or not but she was crying.\n\nAnyway, I picked her up, gave her a nice hug and while she did cry for a minute or two, she was back to her mischievous self later. Ate a good meal, did her usual things including making me hide in the closet.\n\nMy wife says not to overthink but this is the first time she fell and bumped her head. I am contemplating calling the doctor and I have been searching for crazy since this happened. The incident keeps on replaying in my head. I don't think I could have prevented it but I feel terrible nonetheless.\n\nThanks for reading. I type this as my daughter is snoring so hopefully it's a better day tomorrow."
  },
  {
    "post_id": "19epdu1",
    "title": "Need travel tips - solo dad travelling internationally with 4M and 2F.. 16 hour flight time with a 3 hr layover!",
    "body": "Travelling this weekend and as the title says currently solo dad of 4M and 2F. Mum's already at the destination. First flight is 3.5 hrs, then a 3 hr layover followed by another 12 hr flight. As time gets closer I'm scared and bit overwhelmed - to make it worse the first flight is at 6 am so that means have to be at the airport at around 3 am.. !!! Any advice welcome from those who have travelled alone with young kids! \n\nUsually we would plan these trips better but this is for an urgent family matter. "
  },
  {
    "post_id": "buuwvc",
    "title": "Ok daddit, talk me down here...",
    "body": "This is it! My wife is being induced next week due to complications (pre-eclampsia) and I am so excited to join the ranks! I need you all to tell me how incredible it really is because I took a look at my bank account and am feeling a bit panicky now. Thankfully I can just pay my mortgage, but my credit card balance has begun to accrue in the last few months due to tests and extra doctor visits so yeah, nice stories about the joy of fatherhood and how incredibly worth it it all is would be great! Thanks for showing me the ropes in the expectant phase!\n\nEdit: Thank you all for getting me back on track and sharing your experiences. Feeling more excited, less panic! Y'all must be great dads."
  },
  {
    "post_id": "mm1ps7",
    "title": "Preparing to be a first time dad and feeling useless.",
    "body": "My fiancé and I are expecting (10 weeks) first time for us both. I’m stoked but I feel useless. I know it’s early on but man, I just feel like a bump on a log. I’ve read some things, did some research on baby stuff and been to all the appointments that I’ve been able to attend due to Covid. I’m just at a loss right now. Was hoping for some guidance or advice of any kind from some dads. Thanks dads."
  },
  {
    "post_id": "1bn4pr4",
    "title": "You can have it both ways if you're wrong both ways.",
    "body": "My wife works a weekend shift. It's not ideal that we have so few days off together, but it's the balance we strike right now. I work 4 10hr days during the week, and we have 1 day off together each week. Near the beginning of each week sometime around Monday or Tuesday evening, I'll be told that she was disappointed at the state of the house after my weekend of non-stop dad-and-toddler time. Frequently the word \"disaster\" is used to describe things. I try to get as much done as I can in that nap window, but it does vary. This means the nap window can be filled with chores, and maybe a minute to myself for lunch... but I routinely hear from her a day or two later that what got done was insufficient. \n\nYesterday, my daughter was playing nicely in her play area, and I was cleaning in the kitchen. I can see her from the kitchen, but I guess while my back was turned she darted over to the desk and started scribbling with an inkpen. she scribble on my wife's planner (over last week and this weekend pages), and on a notepad. Miraculously, I caught her before any real damage was done. All ink had gone on paper, and nothing of real value. \n\nMy wife saw it, and got really upset though. I told her what happened, and that I'd caught it before anything worse happened, and put the pen out of reach. She declares now that I wasn't paying enough attention. That if \"she had time to do this then she could have done worse things or hurt herself\". It just feels like I can't win here... and not only that it feels like the problem isn't that I'm swinging too far one way. I'm somehow managing to double fail. \n\nI tried to communicate this, but now I'm \"too defensive\". Just feeling a bit beaten down here. My wife frequently lets me know she gets more done than I do, but she also has 3 days a week when our daughter is at pre-school. I hate feeling like what we do for the household are always being weighed out to determine who contributes more, and I'm always the one coming up short. "
  },
  {
    "post_id": "3digcl",
    "title": "Dads of daddit who have lost their Dad - what events/experiences do you treasure? If you knew this was coming, what might you have done to take advantage of the time?",
    "body": "Dear Dadditors - \n\nThis may not fit under the usual posts, but I thought this amazing and thoughtful community could offer some unique insights and perspective.\n\nI am a Dad to two amazing young kids.  And, I am fortunate to have an amazing Dad.  Unfortunately, we learned in the past few days that my Dad has a serious illness.  It is treatable, and the treatments should slow its progression and extend his life.  But, the disease will eventually take his life.  For better or worse, I am a physician and a specialist in the field, so I know the realities and have seen what likely lies ahead.  I believe that attempting to \"hope for the best, while planning for the worst\" is a helpful axiom.\n\nWith this in mind, I wondered if you fellows had any thoughts on the following:  If you knew that time was now limited with your Dad, what would you do maximize/take advantage of that time?\n\nWhat experiences have you had with \"soaking up\" the wisdom and legacy of your parent to keep with you and make available to your children?\n\nAs that meme said the other day on /adviceanimals, \"when life gives you potatoes, you eat those potatoes!\"  (that totally cracked me up as it was apparently spoken by a 6 year old).  If anything positive is to come of this whole terribleness, I wonder if it can be through taking better advantage of the good time (hopefully there is lot of it, but who knows…) we have remaining.\n"
  },
  {
    "post_id": "1f2zede",
    "title": "Dad fail? School attendance over vacation? ",
    "body": "Yeah, just seeking a little support on this one. My wife works part time and really likes to vacation. So she takes a vacation about every other month (her money). She had a girls trip planned for November, that fell through, so she thought it would be fun to take our daughter (2nd grade) out of school for 4 days for this trip to Southern California. I said it would not be a good idea because: \n\n1) it is very early in the school year to be taking time off for vacation\n\n2) The school will not give our daughter any school work, she will just have to catch up upon her return\n\n3) I know my wife will want another vacation in January, to get out of the rainy PNW.\n\n4) I know my wife will want another vacation in Spring for daughter's birthday (outside of spring break). \n\n5) We typically miss 3-4 days a year for illnesses because they turn to respiratory issues. \n\n6) After the proposed trip, she would have class for one week, then be off again for a full week for Thanksgiving break. \n\nNow I have a daughter that is screaming and crying as if she has lost a limb, and is unconsolable. I feel I am making this decision in her best interest. My wife is not throwing me under the bus, but she is not exactly backing me up either. \n\nAm I the bad guy? Too rigid about attending school? \n\n\\* My wife likes to take vacations outside of the normal school off time because it is cheaper to travel and not as crowded. "
  },
  {
    "post_id": "12h1mr5",
    "title": "Help- Sleep training",
    "body": "Or, my wife's non belief in it.\n\n\nOur daughter is almost 2 years old, and still needs us to go to sleep for naps and night time bed time. I was deployed from the time our daughter was 2.5 months until she was about 10 months old. My wife is 100% against \"cry it out\". So, if the baby cries, we go and lay with her.\n\nIt is currently Sunday evening, and since Thursday evening, I have spent around 14 hours laying next to our daughter comforting her to sleep. I am at my wits end. \n\nAm I wrong to believe she should be able to sleep on her own by now? Everytime I bring up letting her cry, my wife thinks I am a monster. She says it will cause permanent trauma in our daughter, and that she will hate us for life.\n\nIm so lost on this, and my wife wont budge. She has even had her own mental breakdowns over our daughters bed times, but she persists that we have to stay the course.\n\nWhen does this end... I am begining to feel like we will be doing this for years...."
  },
  {
    "post_id": "4knc5g",
    "title": "She falls asleep instantly with mom, but I can't get her to stop crying",
    "body": "I'm trying to give mom a chance to sleep but I can't get my daughter to stop crying and go to sleep. I don't know what to do and I'm at my wit's end. She's showing no signs of being hungry and I'd hate to wake my wife just to have her not be hungry....I don't know anymore...\n\nThanks everyone, she only slept for a few hours last night and mom got some sleep. I appreciate the advice from everyone and will keep my head up. I get frustrated easily, especially when things get trying. I just have to remember it isn't her fault nor mine."
  },
  {
    "post_id": "1cftc44",
    "title": "My mother in law spanked my daughter (3Y10M)--my wife and I are resolutely against physical punishment.",
    "body": "TLDR; my daughter had a tantrum while I was at work and my MIL lost control and spanked her even though my wife and I are resolutely anti-corporal punishment. \n\nLately my little girl, I’ll call her E (3Y10M), has become a full-fledged 'threenager.' I posted a while back about my wife worrying about her having a mental condition, but she’s just a willful and stubborn soon-to-be four year old. We’ve adapted to her tantrums and we’ve been figuring out how to redirect her or letting her cool off depending on the degree of tantrum. We’ve been making headway, but grandma is not along for the ride. \n\nMy MIL--who has lived with us since we all got shut in together during COVID--has been getting more and more aggressive with E as she goes through this new phase. My MIL's limited patience has given way to shouting, calling E names and even openly swearing in front of her. My wife has tried her best to get her mom to cut the bullshit, and to get her to take some time away from the house. Frankly, the only reason I haven’t kicked her to the curb myself is because my wife insists that she needs her mom’s help around the house. \n\nWell, last night I was on duty to watch study hall until 10:00 PM (very normal for teachers at boarding schools in our country). My wife messages me that E has been being a pain in the ass that night. Later she tells me that E had a bath but is going into tantrum mode, doesn’t want to put on her pants or underwear and is rolling around on the hard wood floors saying she doesn’t want to be clean. That is clearly an awful situation and I wish I were at home to deal with it. Before I can even type a response message, my wife tells me that my mother in law--who has been told countless times that we are vehemently against physical punishment--bent E over and spanked her. Afterward my wife took E into the bedroom and locked the door. \n\nI won’t go into a play by play of how our conversation went or how her conversation with her mom went. I want to throw this horrible woman out on her ass, but my wife has asked me to let her deal with it. My MIL says that she is beside herself with regret and admits that she lost control and says it will never happen again. My wife and MIL took her out of preschool so that grandma can ‘make it up to E’ today by taking her to the play place and buying her some toys. \n\nHere’s the deal though; she lost control. The very fact that she used that language shows me that if she is allowed to watch my daughter any more then there will always be a risk of this happening again. Also the ‘making it up to E’ strikes me as the kind of behavior a domestic abuser would display--you know, apologizing and suddenly behaving like a saint after clocking their partner. I am almost certain that if she stays in the house then this will happen again, but my wife says I need to have more faith in her and her family. \n\nSo here’s my rock and a hard place: I want this woman out of my house immediately for the safety and welfare of my daughter, but my wife has specifically asked me to let her handle it. She is handling it by giving her mom a second chance, which sees me worried that my daughter will experience more of this kind of what I would frankly call abuse and my wife and I will see more casual disregard for our parenting ethics.\n\nHow do I navigate this? Has anyone had any similar experience?"
  },
  {
    "post_id": "1cbci5y",
    "title": "Planning on going to court for full custody. 24 year old single dad",
    "body": "Currently have \"full custody\" by a child agency since my daughter was 3 weeks old, shes 14 months now. Soon after the birth the mother went off drinking and taking drugs heavily. This lasted up until october 2023 before she decided to get help. Prior to this she was only seeing our daughter 4 hours a week and supervised. Since then it has been increased too 12 hours a week. \n\nIt was an absolute nightmare to deal with since she was 6 months pregnant. And she always came running to me everytime she was on the come down from drink and drugs. I always helped, i got her into rehab where she stayed the duration of 4 weeks. Everything looked good and on december right around the time she got out she started dating a new guy, introduced him to our daughter immediately without letting me know and ive just found out 2 weeks ago he is a recovering alcoholic and drug addict who she met in recovery. The child agency put a stop to him being around my daughter. \n\nAs the child agency and i hoped it was slowly going back to 50/50 her latest toxicology results came back and showed extreme levels of alcohol. She lied to everyone, had rewards for being 100+ days clean and i was told the levels were that high she would have had to be en drinking everyday for the last 2 months.. \nShe tried to lie and say it was one day of binge drinking.. the agency told me to go through courts and get full custody.\n\nThis has been going on for over a year now and its constantly been like this, she has been giving so many chances but wont seem to do it for her daughter. Im so dissapointed especially for my daughter growing up barely seeing her mother but also myself. I have literally no time to myself and lost out in many opportunities and work due to her addiction. \n\nThe child agency also said there would be no chance of it ever going to 50/50 as this same situation is going around in circles. Sorry for the long write up everyone but id love maybe some advice and how to go about this without so much drama? Thanks dads!\n\n"
  },
  {
    "post_id": "141r3d2",
    "title": "Today was rough",
    "body": "Today my youngest had her preschool graduation, which are always cute and I enjoy. But it was hard to be there too. \n\nOne of her classmates died a few months ago, very unexpectedly. This would have been bad enough but I was also the medic that responded to the call. \n\nWe thought this kid was going to be fine, we got pulses back on scene, he was trying to breath on his own, and at the ER he was responding a little bit. \n\nThe next day he died. \n\nIt was a gut punch certainly. We thought he was going to be okay, but he wasn’t. \n\nNot my first peds death, and I’ve even had some since then, but the fact he was in my daughter’s class definitely made him stick with me. None of them are easy though. \n\nHis parents were there today and they did a little moment for him during the celebration. Hard enough to be reminded of it, but it’s my job and while these things hurt I cannot even imagine how his parents are. I’m not sure I could have been there today if I was in their position. \n\nAfterward, his mom came up to me and gave me a hug and said “thank you for giving us a chance to say goodbye.”\n\nI was really hoping she didn’t even know who I was but she did remember me. I lost it after this moment and had to go out away from everyone. Thankfully my wife and a coworker of mine were there and they understood and helped me get my shit together. \n\nSorry for the rant, Dads. I just had to put this down and share it with someone. I’ve been a wreck all day since then. Thanks for reading my problems I guess.\n\n\nEDIT: Thank you to everyone. These comments have honestly helped a lot. Love you all."
  },
  {
    "post_id": "1eenlp0",
    "title": "Kids are away for a week. Suggest a microadventure please",
    "body": "I have two kids and am very much a \"hands on dad\". We do a lot of things together, because well... I want to do a lot of things together.\n\nHaving said that, I don't have any parent responsibility until next weekend. One kid is with one grandparent and one kid is with the other. I'm doing a half-day at the office on Monday, and then Tuesday to Saturday I've booked off work.\n\nAlso, I'm incredibly burnt out and NEED to do something that resembles an adventure. A micro-adventure if you will.\n\nI have a motorcycle and haven't had time to ride long distance in years. I have a go anywhere bicycle and could take a mini-trip. I could fill a backpack and just stealth camp. I just need to do something to feel alive and connected with nature again.\n\nSo dads, any tips on a 1 or 2 night microadventure? \n\nI'm physically fit (albeit kinda rusty) and newly sober, so pub crawls and brewery tours are out.\n\n\n\n"
  },
  {
    "post_id": "lx0h44",
    "title": "Stay at home dad.. Help",
    "body": "I was wondering if there was any stay at home dads that could help me, my partner will be starting work soon and i will be left with my 5 month old girl alone all day. Im stressing of the thought of having no time for myself. When she's awake she gets bored really quickly so i have to walk around, i dont mind this but all day is gonna kill me. When she takes a nap its max 30 minutes. What do you do to keep your baby's occupied so you can have just 5 minutes to yourself?"
  },
  {
    "post_id": "134soqz",
    "title": "Son wont let me console him.",
    "body": "Hi. My 2 year Old son fell this Weekend and had a small shinner. He cried and lay on the ground. However I was not allowed to pick him up and console him on my arm. He only cried for bis mother and became angry, when I told him that she wasnt available and he should let me console him. I felt like a complete ass, with my son lying in Front of me in obvious need of consolation and I couldnt help him. I did not know what to do and of course felt somehow rejected. Any ideas How to handle this?"
  },
  {
    "post_id": "xwemjf",
    "title": "A dad who's feeling defeated, depressed and heart broken",
    "body": "I am a dad with a 1-year-old baby at home. We love him a lot and he means the world to us. My wife is still on her leave so she is full-time taking care of the baby while I am working from home 9-5 every day. The first four months of our journey were really tough as my wife went through PPD and I had to give full attention to her while taking care of our son. She has recovered since and I thought everything would be nice and happy.\n\nA couple months back, I noticed our son just wanted to hang out with his mommy. I understand she's his primary caretaker so I didn't think much and accepted it. But recently, I noticed our son didn't want to engage with me in any activities. He wouldn't even look me in the eyes when I go play or speak to him. When I go into his room to pick him up in the morning, the only thing he does is look for his mommy and acts like I am not even in front of him. As soon as my wife comes into the room, he would start laughing and getting excited.\n\nYesterday, our son had so much fun with my wife when we all went to a park to play. When I was trying to engage, to play with him, he turned away and went back to his mommy. It broke my heart as I felt abandoned by my own son. The one that I stay up for every single night to feed and soothe him to bed when he was still an infant.\n\nI feel despair and depressed. I can't help but feel pretty down every time when I see him being so happy with my wife. I often ask myself, did I do something wrong or maybe not spend enough time with him? This makes me feel disconnected from him. I am now also hesitant to do anything with him as I don't want to get hurt again knowing he doesn't want me to be there anyway. I am lost..."
  },
  {
    "post_id": "1e6rz05",
    "title": "My daughter (4) has been touched inappropriately by two different boys lately. Both times parents were dismissive of their sons. WTF is going on in 2024?",
    "body": "A few months ago, a boy touched my touched my daughter's vulva through her clothes on the playground. He was 6. She was 3. She came and told me about it, and his mom dismissed us and told us she didn't know what her vulva was. And I'll be damned if that's true because I taught my kids their parts for instances like this. The mom and I talked later that day, and she apologized for being dismissive and talked to her son.\n\nI talked to my ex (their other Dad) about it, and we agreed one of us had to be with her if that boy was on the playground. He ended up touching her butt right in front of me. I let her say something to him and come to me (quickly, I would've intervened faster if she hadn't said something to him so quickly). He told her it wasn't a big deal. I told him to say that again. He said it wasn't a big deal again, so I told him let's see what your mom thinks about that. I was furious but didn't take it out on him. His mom took it seriously that time, and my daughter and I left the park. I asked her if she wanted to be around that boy anymore at all. She said no, so we've avoided him at the park ever since.\n\nThen, today, I picked her up from an afternoon daycamp in another city park. First thing she says to me is \"that boy touched my butt.\" I told her I'm so sorry that happened. I asked if she told a counselor. Yes. I asked if he did it again. No. All well and good, but no counselor came to tell me about the incident. I wasn't happy about that, and I wanted that boys parents to know. I asked his dad if we could talk for a second. He was taken aback, and I asked if we could do it without the kids for just a sec. He asked what I was getting at, and I told him his son touched my daughter's butt at camp today and never apologized. He gave me a simple and dismissive \"Ok\". Where I come from in the Deep South (we live in the Midwest now), that kind of response would've never happened.\n\nI could see red in that instance. I told the kids to get in the car. I blocked the Dad in and waited for him to get out so we could talk a bit more. He started to back up. I don't care about my car's appearance. Hit it. He ended up driving over the curb and through the grass like the coward he was. I'm aware I was being unhinged in that moment.\n\nAnyways, I hope he thought about raising his son a little better after that. I'm sick and tired of people not talking to their kids about boundaries and bodily autonomy. I fear for my daughter and the world she'll experience that is so different from mine and her other Dad's."
  },
  {
    "post_id": "19cha6o",
    "title": "I’m at my wits end dads",
    "body": "Little One is 15 months old and I’m about to lose it. This baby will not stop screaming, moaning, being absolutely fussy about everything… it’s been a rough weekend. Inconsolable would be an accurate description. He won’t go down for naps that last longer than 30 mins. Needs to be held constantly. He doesn’t even feed without complaining about it if not held in the absolute perfect position that only he finds acceptable. I’m just venting cuz I love the kid to death but man oh man I had no idea how tough being a parent was. He needs constant entertainment & stimulation and even then it’s about 5% chance he doesn’t find something to scream about. Drools incessantly like a faucet chewing on his hands. Dads, this is really really tough. Feel like I’m bout to lose my shit. I wish you could all see the non-stop insanity of fuss im currently looking at as I type this. There’s nothing I can do to console this baby & I can’t help but think this is not what I signed up & made the wrong decision about having kids! 🤦🏻‍♂️"
  },
  {
    "post_id": "1fqdall",
    "title": "My dad is dying and I don’t think I want to go see him anymore.",
    "body": "My father is an alcoholic. In the last seven years it has really taken over his life. He has skipped out on holidays, claims he “didn’t feel well.” My daughter is 4 years old and she’s seen him a total of 5 times her entire life. \n\nHis health is failing and he’s spent the last year and a half in hospitals. It’s to the point now that he’s had constant care, was kicked out of his apartment for unfit living conditions and has been living in a nursing home. He’s only 60. \n\nI have two siblings who both have nothing to do with him because of his alcoholism and selfishness, and being the oldest child, it’s been on my shoulders to take care of his affairs this last year. \n\nRight now he’s in the hospital with liver failure, a brain bleed (he fell from his hospital bed trying to get out of it on his own) and kidney problems. I drove down to see him at the hospital on Sunday, about a four hour drive. While there, he cried—not for us. Not for his family, not for the fact that he’s wasted all this time and has nothing to show for it. \n\nNo, he cried for Rosy, his caretaker at the nursing home. He cried saying that he loves her, that she combs his hair and buys him sodas. \n\nThen, at one point, he said, “I bet you wish you had a different dad.” I told him, “No, I wish the dad I have had taken better care of himself.”\n\nAfter I left the hospital to make the four hour drive back home, I didn’t feel like I had any solace in this situation. I am just frustrated, and I think I am done now too. I don’t have any desire to see him again. \n\nThe dad I grew up with, the one who was really good before alcohol took over his life, is gone. I don’t want to see this frail, broken, sick person anymore. This one is completely selfish and self-centered, and doesn’t have anything to offer his children in terms of making peace with the end of his life. \n\nMy only hope at this point is that the suffering for him will end and when it does that it’s quick. "
  },
  {
    "post_id": "zz57kw",
    "title": "As a father to be, thank you dad (sorry, long post)",
    "body": "Hi everyone, I’m about to become a dad to a little boy, and I am terrified. I know, I know. Being a parent is hard, and while the beginning months of a screaming little human can be difficult and exhausting, in the end it is worth it every time little guy looks up at you, or when he takes his first steps, or when he first says “I love you.” I know that the difficult parts are always around the corner, but they are also always temporary. Raising a child on little sleep is not what scares me. I am excited for this, as unready as I may be. It’s not the diaper blowouts, the 3AM feedings, or the crying fits. It’s not the stressful moments in public, the cost of daycare, or the puke. No, I’m not scared of any of that (except maybe a little bit about the puke.) No, what I am terrified of is the fact that lightning rarely strikes twice. Peaking with the headlines yesterday of a particularly nasty misogynist getting arrested overseas making waves, it’s long become clear that there is a cataclysmic fissure in the minds of men around the world, particularly young men, about the concept of masculinity, and what it takes for a man to thrive in today’s society. Where most people saw crippling insecurity, young and impressionable men everywhere saw the glitzy cars, the always nearby women, and the gaudy houses and immediately saw this excess as deserved success. They fawned over this man’s “lessons” online and quickly drove his influence to larger and larger audiences, feeding a cycle that men who act a certain way deserve a certain lifestyle. And that lifestyle, as the news is showcasing, is a horrific one of violence and abuse. But this guy is just one symptom out of many plaguing young men’s minds today. Everything from how we are told to process our emotions, how we feel about those around us who may be different, how we engage with our friends and support groups (if we’re lucky to have any,) to how we process difficult moments of anger, resentment, and god-forbid, fear are skewed and twisted by a thousand talking heads, each of them with their own agendas, almost all of them failing in truly representing what it means to be a person, let alone a man, in 2023. So, then who should we look to for advice? The obvious choice is family. Dad. But this isn’t always easy or possible, or unfortunately, if it is possible, it isn’t always the right choice. For many, following in dad’s path means perpetuating a cycle of closed-mindedness, emotional underdevelopment, or abuse. So if not dad, then who? For the lucky ones, it is a grandfather, an uncle, a brother, a friend, or a mentor, someone who can take you under his wing, show you the path to a fulfilling and meaningful life, one that brings rewards much more valuable than a Lamborghini. Yet, for many young men, this isn’t an option either, and this is where we see those minds shift towards those less idealistic stewards on the web or in their neighborhoods. And then the cycle continues. This isn’t a problem any of us are equipped to solve on a macro level, so I just implore each of you to do the best that you can. For me, the answer was dad. I am one of the exceedingly lucky ones. While we certainly didn’t always agree when I was a jackass teenager or lost my way a bit in my early 20’s, in the end, it has been his influence and approach to life that I most try to emulate. A core memory for me was when my grandpa died, my mom’s dad. I was still a jackass teenager; in fact I was in the most jackass phase of being a teenager. We had to uproot my entire social calendar that week to drive to bumfuck upstate New York, and while I was sad to see my mom sad, I wasn’t particularly close with my grandpa (a fact that I now regret) and to do the bare minimum of keeping my mouth shut as the days turned into a week away from my friends was impossible. But my dad never led by a fist or a belt. He first led by acknowledging his crushing disappointment in my inability to be there for the one person who sacrificed everything for me, my mother, but then continued to lead by example. He attended to everything the family needed, did the chores in the kitchen after the family meals, supported my grieving mom and grandma, and grieved himself. This same man who made difficult decisions at work, fixed things around the house, and taught lessons to my brother and I was the same man who I saw mourn the loss of our family cat, whom he loved dearly. In a particularly heartbreaking moment, I saw that his web browser had up a page on coping with pet loss, and that same evening I saw him standing in the family room with tears in his eyes that his friend was no longer there to greet him. He showed me how to be a husband through how he treats my mom. Through the good times and the health scares, he is by her side. I’ve seen his worry, which he shares with me when things are particularly hard, and it is that vulnerability that has taught me how to tackle my own difficult moments with my wife, and I hope, has led me to be a good husband for the love of my life. This same man who taught me how to treat women, about respecting their safety and autonomy, also had a gay brother. Life was different back then, and while I can’t say everyone in the 70s was as accepting of alternative lifestyles as we are today, I can certainly say that my dad was ahead of..."
  },
  {
    "post_id": "1gw0det",
    "title": "Flu number drölfzig. I can't take it anymore. Since my boy goes to kindergarten, I've been sick more than 20 times. ",
    "body": "I need to vent. Again. I can't take it anymore. I've done everything I can to stay healthy. I started doing sports, I eat healthy, use sanitizers on my hands, wash my hands regularly, try to keep a distance to my sniffling kids (not that easy), everything I can to avoid it. My little one sneezes in my direction and I am sick again. I am coughing my lungs out. I can't sleep. Breathing hurts. The rattling and rustling sounds and feelings in my wind pipe drive me nuts. I am close to going bonkers. This is what I absolutely fucking hate about being a dad that no one told me. If I had known before I would have rather cut my dick off before getting children. Don't get me wrong, I love my boys to shreds! But I  have pretty much been sick more days in the past two years than I have been well, more days than in the 40 years before in total. I don't know what else to do except for moving out when one of the kid starts sniffling again. I'm so whacked... Fuck this shit! Really! Fuck the flu! Fuck coughing! Fuck it all! Fuck!\n\nSorry... "
  },
  {
    "post_id": "17oc6t8",
    "title": "My wife has been in the ICU for 13 days",
    "body": "Little guy is 16 months old. I work full time usually and hustle on the side to keep everything going. Baby is with wife 80% of the time during the day and up until the beginning of last week, still breastfed. Tooth extraction gone wrong eventually turns into Ludwig's Angina (we are suing the dentists) and my wife is crying from the pain - still breastfeeds, nurses for nap time, does all the washing and house chores she usually does in a day. I start urging her to go to the emergency room as the dentists are not helpful and send her home with generic antibiotics and some anti-inflamatory meds. Come Monday morning, she hadn't eaten in 2 days and is struggling to breathe with both sides of her neck now swollen. I start packing her a bag and get the kid's stuff ready. The ER triage takes 7 hours and I had to leave her there after a few hours as kiddo needed to nap etc. In addition to the ER staff indicating the ER is no place for a baby. It didn't occur to me as I was just worried about wife. My friend eventually joins her as she is manic after waiting around for a few hours crying from the pain and gets herself in front of an ENT eventually. After a CT scan she is put in a wheelchair! In the space of 4 mins, my wife tells me: 1. She has to go in for an emergency operation. 2. They are going to cut her across her neck from side to side 3. She will be sedated afterwards. 4. She loves me and is about to go into the theater. She was sedated for 11 days. I let work know that I have to take care of my son as we are immigrants with no family here to help out. The person responsible for HR asks me, what leave should she put in for me? (Good fucking grief.) I'm shitting myself, but I just get on with it. Kiddo is tired and needs to nap. Fuck. I sleep trained him and opt to go for the same route for napping. I commit and just stick to it. Whitenoise on, hold him for a bit until he has calmed down and put him in the crib and walk away. 4mins later, asleep. Thank fuck. I immediately find myself rudderless otherwise. I keep moving, get the baby cam going, sit down and just fucking break down crying. Like ugly crying. It helped. It's much of the same after this point. 5/5:30 wake up with baby. Had a few extra glasses of wine on one too many nights. Our closest friends are over almost permanently and help out with as much as they can. The washing is piling up. The puppy is destroying everything. The cat litter serves an all day butthole buffet for the puppy who loves to have his doggy caviar on the couch. I get to see her in ICU a lot more than I expect. Our friends step up immensely and stay with little guy, serving dinner and bath time plus bedtime on the nights I go see her. She is intubated through her nose because her throat swelled up so much. She has a massive dressing around her neck. (I found out days later that they kept the wound open for 11 days!). They have drains in her neck and clean the abscesses out every few hours. She is pretty beat up, but after a few days the doc says things are looking up. My MIL is driving me fucking nuts at this point and expects an hourly update. I had to tell her 5 times that the hospital gives 0 info via phone. I have to go in and get info. She makes everything about herself and tell her off eventually. Not proud of how I handled it, but I had no bandwidth left to put up with her shit. After 11 days of lots crying, little sleep, yelling, frustration and absolute amazement at how resilient my kid is, I walk into the ICU as they remove the intubation. I almost fucking fell over. The doc fills me in about the dilerium she will experience and an update of the events of the day. I ignore all of that of course and just go to her. It's like I'm a friend to her. It doesn't look like she remembers our romantic relationship. (We were friends for years before getting together). Her mind is bouncing around in millions of dimensions. The first thing she asks me, \"Did you cheat on me\" - fucking hell. We have no history of infidelity in our relationship. I'm gobsmacked but chalk it up to dilerium, now remembering what the doc said. She is laughing at the medical staff and then suddenly starts crying in fear because they all want to/have hurt her. It's rough to see. I come home feeling more empty and feeling shit. I think I had an expectation that things would magically be drastically beter as soon as she wakes up. Her mental state is improving daily and I'm hoping today I have my wife back soon - at least mentally. In the space of 4 mins and over the course of 13 days (so far) - I became a temporary only parent - I weaned our EBF boy - I nap trained him - realised how much my wife does - made a promise to never ever ever question her again when she tells me the baby needs clothes or something else - saw my boy take 8 steps in a row - slept multiple nights in a row for only 3 hours - I created a video diary, which really helped I have lost the will to live on multiple days. I cried, but I realised I had to show up for my son. I love him. He is amazing. My wife..."
  },
  {
    "post_id": "14wv9wd",
    "title": "I have messed up in the biggest way possible.",
    "body": "To start things off, \n\nI struggle with video game addiction, porn addiction. I have never sought help for either of them, and just yesterday I may have jeopardized my marriage because of it.\n\nTo put it short, I had a emotional affair with a faceless nameless person over chat ( on another platform than Facebook) where I wrote steamy sexual stories with input from the other person… basically Role Play. Porn for the imagination.\n\nMy wife found the chat on my phone and it went back a few months, it broke her heart. \n\nI’ve been in a dark place mentally as I’ve felt numb, empty and less of a man because where I dreamt I would be, is not where I am. I’ve been unemployed for a year now, I’m up past my eyeballs in debt, went back to school to better myself and still can’t catch a break, I’ve lost all motivation to find work because the constant turn downs I’ve received. The pressure to find work is unending, the stress is breaking me, the guilt is terrible, my self image is shattered. Im supposed to be the one working to provide for the family, with the stable career, making good money, and living happily….. instead I’m broke, relying on my wife’s pay check to pay the bills, my credit is the absolute basement, I literally own nothing of importance (cars in her name, cell is in her name, most bills are too) \n\nI know that I’m the asshole in this situation, I swore to myself I would not end up like my dad (who had an affair and divorced) and I 100% ended up acting just like him. \n\nI don’t know how to fix this, I’m scared that I have ruined my life, my wife may leave me after this, most likely taking my 2 sons (6,3) and leaving me with nothing….. I’m a horrible husband, father and a complete waste of space.\n\nTLDR : I fucked up, escaped to virtual vices and had an affair in cyber space, wife found out and I have blown up my life…."
  },
  {
    "post_id": "1b18t9d",
    "title": "Advice for an exhausted dad",
    "body": "Hi everyone, I'm a 35y/o dad to a wonderful little 2 year old girl. But recently I find myself struggling. I have 0 energy after getting home from work, which is teaching high school.  When we finally get to sit as a family I kept nodding off. Am I just experiencing normal parent tired? Is this a product of hitting 35? Or is this because of my job? \n\nI feel like I'm letting my wife and daughter down. But I just have nothing left in the tank, and I don't know how to tackle it.\n\nI know there's no real answers out there but I needed to vent into the internet void. \n\nThanks Dads. "
  },
  {
    "post_id": "12di2rq",
    "title": "We got a positive pregnancy test yesterday. I have absolutely no joy and am very afraid.",
    "body": "Just got the news yesterday, of course we were happy we conceived, but now the anxiety and worry set in. Over the last 7 months, we've had two miscarriages that have ended in emergent DnC's due to heavy blood loss. \n\nWhile I know I have to remain strong for my wife and our 2 year old daughter, I know that every single cramp, spot, and any other general symptom is going to be a continuous gut punch for me, especially after what happened. \n\nSure, I have some faith that we're going to come to term, but I'm more of a nervous wreck than anything."
  },
  {
    "post_id": "xfow0j",
    "title": "Don't make my mistake",
    "body": "I've felt pretty useless to my wife and baby girl these past few months. Haven't been able to get into the groove of being a dad to a newborn. Felt a gap has been getting bigger and bigger between my growing family and myself.\n\nUntil these past few nights.\n\nBeen lurking this sub the past month and everyone's experiences and stories have given me the courage to stand up, fight the depression that's creeped in, and take ownership of my actions. Told myself, \"I'm a dad, goddamnit, act like one.\" \n\nI've taken over the late night/early morning feeding duties that my wife has doing. This one act completely changed my life. All the daily activities I do with my wife and daughter do not compare to this, I truly feel like a dad now. My wife is happier, the bond with my daughter is growing closer, and my overall outlook on life has made a 180.\n\nSorry for the novel, just needed to get that off my chest.\n\nEdit:\nThanks for all the kind words and encouragement, you guys are the best. Keep on truckin, dad's!"
  },
  {
    "post_id": "dw9su0",
    "title": "Am I alone in thinking this sucks at least 60% of the time?",
    "body": "So much of this sub is sunshine and rainbows,  makes me feel ashamed to admit that most of the time having a little one is not fun. Cooking, cleaning, shelling out money we didn’t budget for, the list goes on. Don’t get me wrong, the milestones are incredible, first laugh, first steps, I love my son, But is fatherhood really the #blessed experience that everyone else is experiencing? Am I the only one grinning and bearing it, choking down occasional feelings of regret? After 1.5 years, still no matter how many books I read or toys I bring home, I still can’t compete for a second with a boob full of milk. Sometimes I think they’d be better off without me around."
  },
  {
    "post_id": "1dsj11j",
    "title": "Struggling with miscarriage",
    "body": "Been married for 7 years now and have a healthy 3 year old child. Wife and I have been trying for a second for the better part of 2 years now and we've had several miscarriages. She's pregnant again and at her ultrasound last week the fetus was measuring small and with a lower heartbeat so we're expecting our 6th miscarriage anytime soon. At this point I am down in the dumps. I am trying to remain strong for my wife as she is really having a real hard time with all of this, while we care for our daughter.   \n  \nI don't have answers to why this keeps happening and am having a hard time with all of this. We have friends and neighbors get pregnant and have healthy kids along the way and it makes it harder. Being a dad is my favorite thing in the world but I feel hollow. Struggling with grief, guilt, resentment, jealousy, etc. I'm at the point know that I don't enjoy being around friends or family that have multiple children. I know it sounds stupid, I should be grateful for the blessing I already have. I have enormous guilt about that too. This just sucks.\n\nJust putting it out there because I feel like, as a society, we don't really talk too much about the struggles with miscarriage and infertility. It's easy to feel alone out there. "
  },
  {
    "post_id": "tsxnt6",
    "title": "My daughter will have something I never did, a fully present Dad, and I couldn't be happier!",
    "body": "My father wasn't really a part of my life. No matter how much I cried after him, no matter how much I begged him, prayed for him, hoped for him, he still chose the haze of a drunken stupor over me and my sister. Maybe he couldn't handle the responsibility of having children, maybe he couldn't handle that my mom loved us more than she loved him, maybe we just weren't for him. I'll never know nor do I want to know.\n\nBut my girls?\n\nThey will never know the bitter disappointment of their Dad never showing up because he's always here. They'll never know the desperation to be something their Dad will love because he already loves them for who they are and who they'll become. They will never ever know the grief of not being enough because they're me and their Dad's entire universe. Their Dad will not be the first man to break their hearts because he will protect them.\n\nI do admit I feel a microscopic prick of envy when I see my toddler and him play together, when I see my infant stare and smile with such precious innocent love when she sees him, and when I see the love between all of them. I see all of these irreplaceable moments, their dear smiles, hear their precious laughs, and I can't fathom why my dad would ever abandon that.\n\nSeeing my daughters' relationship with their Dad blossom and grow brings to the surface the mangled scars of my inner child. Of course I allow these feelings to have their space and time in my heart and I breathe them out.\n\nThey will have the Dad I deserved. I will never understand what a father/daughter relationship will be like. I can never relate to their childhood. I know I will feel left behind or left out on their bond because I just don't know what a father's love feels like.They will be loved, protected, cherished, and guided by both parents. And I'm so damn happy that my children will have something my kid-self could only dare to dream of.\n\nAnd all of that is ok. We will all be ok. Thanks for letting me express my appreciation. :)"
  },
  {
    "post_id": "8tw16w",
    "title": "Am I Right to Hate My Father?",
    "body": "So my dad died 10 years ago and I still fucking hate the guy. He was verbally and physically abusive to my mother, my siblings, and me. It was never good with him, only shitty and not shitty. I remember we always had to walk on eggshells around him just to not piss him off. Even that didn't work, like I shit you not he would find things to bitch about and then hit my mom for even something as ridiculous as an empty plate in the fridge. He would constantly lock my mom  out of the house in the winter screaming that he was gunna leave her. I remember there was even this one time he slap my sister who was 14 and anorexic at the time 5 times full force, the fucker cocked his hand way behind his back and let it rip, her face was black and blue. Now whenever I think about my sister all that fucking image plays on repeat in my head. There's other stuff but those are the highlights. For years my I was able to control my hate but now my mom wants to honor my dad by putting pictures of him around the house and remembering how good he was. \n\nThis really pissed me off because we both know what he was. On top of that, despite hating him all I want is his approval, something I never got as a child. Plus I'm freaked out about turning into him and being a shitty father. "
  },
  {
    "post_id": "p8l49b",
    "title": "Frustrated dad rant",
    "body": "Today my wife said something to me that infuriated me on so many levels. I have always made it a very conscious effort to NEVER argue with her in front of the kids because I feel like it's potentially damaging for them to see. My wife, on the other hand, has little issue raising her voice and engaging in heated debates in front of the kids. I typically just walk away and either bring it up when the kids aren't around or just let it go completely. \n\nTonight was different. After telling my wife how busy I was today with the kids she says 'you gotta manage your time better. its probably just the mom in me because i do more than you'. Now, this is actually the third time she's said something of this nature to me and it irks me every single time. It implies either I'm not carrying my weight with this family or what i do is peanuts compared to what she does and that's a bullshit thing to say to somebody. I've sacrificed virtually every hobby I used to have for my family. I used to love hitting the gym and now I'm lucky if I get a solid hour per week of cardio. Used to train bjj, haven't attended a class all year. Built a gaming pc years ago, i hardly even play anything anymore. It takes me days/weeks to finish a movie because I watch it in parts during their nap time. I sacrificed all this time not just for the kids but for her. I come home from work every day and wait for her to get home with the kids because she is physically incapable of transporting them from the car to our apartment. I pack diaper bags and get the kids ready in the morning, she just gets ready for work and leaves. I dont think she's cooked a meal for the kids yet. I do that. Dont think she's ever gave our son a bath or brushed his teeth and he's a toddler now. That's all me too. So with all that said, it pissed me off to hear her say that so casually. I immediately fired back that it's not a mom thing it's a parent thing and we BOTH do a lot. It turned into a big thing and eventually I had to just walk out the room because I could see both kids starting to get upset. She followed me out the room trying to get the last word in and I just let off again. ran down just the things I do in the evening for the kids while she's watching bullshit reality tv and pissing about on tik tok. Asked her if she does any of that, to which she was silent and at the point I just said \"i thought so. so shut the hell up\" and went to go wash dishes. I've never told any loved one to 'shut up' until that moment. So that kinda illustrates just how highly offended and furious a head space I was in.\n\nWhat's further frustrating is she knows how much I hate people downplaying or ignoring my efforts and contributions. She's seen me spaz on people for that. So for her to actually say that to my face after I had just told her how long a day I had watching both kids struck all the nerves. Not to mention she got me out of character in front of my children. I'm certain they've never seen me like that before and it bothers me they had to see it at all.\n\nJust had to vent somewhere. Argument is over but I'm still fuming. I'm sleeping on the couch tonight. Might be for a few days if my mood doesn't change by tomorrow."
  },
  {
    "post_id": "1ecak78",
    "title": "Won't get in shower, full meltdown...",
    "body": "Won't get out of shower, full meltdown...\n\nThat is all. "
  },
  {
    "post_id": "1g7mtnf",
    "title": "Came home today to a big talk",
    "body": "Apparently she hasn't been in love with me for while, long story short, I'm an asshole(my words, she never agreed or denied) and we've grown apart. Our schedules also mean sex rarely comes around and apparently I haven't been giving out enough.\nIn hindsight I should've noticed, I think I did but told myself it was just agitation or something else.\n\nAnyways she had her Dad get our son before I got home, we had the talk and so I asked about my father status (been the boyfriend/stepdad for his first 4 years) and she said she thinks it's better I'm just his friend. I have two days to figure where I'm gonna stay before she comes home. \n\nShe also has no interest in couples therapy or anything of that sort, I'm hoping she changes her mind. Anyways, been having a really hard time coping"
  },
  {
    "post_id": "1gp4ggb",
    "title": "Getting my daughter’s hair cut sent me down a spiral. ",
    "body": "I’m 25, my wife is 24. We have a 4 year old that’ll be 5 in a few weeks, and a 1 year old. I’ve had a lot of growing up to do, and still have a ways to go. Despite knowing I’m not perfect I’ve always felt confident in my parenting… until the last week. I’ve been an absolute wreck. It all started from a freaking haircut. Her first time getting her hair cut and by the end of it opened an emotional rollercoaster that made me feel like I’m the worst dad on the planet. Cutting off her baby hair made me reflect on her first years of life and what she must of experienced, and it made me proud of some parts and embarrassed in the others. For the last week I’ve been questioning every decision I make, I don’t try to make her laugh because I’m overthinking everything, my brain is sick. Watching her grow up is killing me, and knowing our youngest is our last I am destroyed. 25, and to me I have 17 years left before my life is over. I know it’s not true, but the thought of my kids growing up and leaving makes me crumble, despite them not even have started school yet. I just hope they know I love them, and I’m not the funniest or the coolest or the most fun but I want to be. I never thought my dad was a role model, I just hope they think I am. I don’t want them embarrassed. This last week has been too much. "
  },
  {
    "post_id": "ycqlj6",
    "title": "Just finished having a complete emotional meltdown",
    "body": "I just put the kid to bed after an amazing day. \n\nToday I started ADHD medication for the first time in my life; I’m 29 years old. \n\nI am an extremely high performer at work, have crippling anxiety, and major depressive disorder. I’m\nA high performer at work because my mental illness drives me to be. I know it’s weird but it’s just me. \n\nAnyways I went to a new therapist and psych and I just completely broke down about how NOTHING works. Literally nothing I have tried more different medication than I can count. Last week they said “let’s try ADHD medication” after we exhausted everything else. \n\nSaturday I got my script filled. Today I took it for work. \n\nI have had one of the best days of my life. I feel connected to my family like never before. Everything just fell into place and my brain wasn’t going 100 miles a minute. \n\nI’m so fucking happy I can’t stop crying. I had no idea I was just overstimulated."
  },
  {
    "post_id": "ulv7k9",
    "title": "I would hate to have me for a father",
    "body": "My life turned upside down last month when I found out I have a son. My boy has been raised only by his mom for all 5 years of his life until recently she was diagnosed with cancer. He’s moving in with my and my partner soon.\n\nThe thing is, I understand why my ex girlfriend wouldn’t want to inform me about her pregnancy and wouldn’t want me in our son’s life. I was a mess around the time when we dated. I had just been kicked out of my family home, I was homeless for a while, I’d do sex work and I was constantly high. In a pathetic attempt to make something out of my life I enlisted in the military. So I was gone for a while anyway. But instead of a fancy career, I got mental health issues and physical disability.\n\nIt took a long time for me to get where I am now, and I still consider myself a mess. I’m clean, I’m sober but I can’t start my day without a handful of meds, I have therapy once every two weeks (used to be three times a week), I still go to physical therapy and have constant medical check ups. I started my first proper job. I do that and study full time. Which is exhausting but so rewarding. But I shouldn’t have to try to finish school so late in my life, I should’ve had at least one degree by now.\n\nBut anyway, I just don’t want my son to look at me the same way that I look at myself. I don’t want him to see a junkie, a cripple and a mentally ill fuck. I wish I could be different for him."
  },
  {
    "post_id": "yk0ws7",
    "title": "I’ve been sick three times in the past two months. Number four is beginning…",
    "body": "I don’t think I can do this again. All kicked off by daycare. My body is literally failing me and my son, putting the load on my wife. I feel like such a shit Dad right now."
  },
  {
    "post_id": "14id1db",
    "title": "I want to kill myself, after watching my cousins father daughter dance",
    "body": "My dad died thanksgiving day 2021 after a battle with cancer that started when I was in 4th grade.\n\nTonight my cousin got married. I watch his new wife have her first dance with her dad and just completely fucking broke down. I’ll never get a fucking first Dance, hell, my dad didn’t even make it to my 21st. Im so fucking sad I’m so fucking angry I just want to swallow all the pills I have and die. I don’t know why I won’t, I’m afraid of failing and waking up in a hospital somewhere. If “heaven” (I think it’s fucking bullshit, personally) is so amazing, then why can’t I join my dad up there?\n\nWhile my cousin got married and watched his wife have her first dance with her dad, I just doubled over the box of ashes I know as “dad.”\n\nI can’t do this anymore. I’m sobbing in my bed, I’ve already fought with my mom, she’s no fucking emotional support. What did I possibly do to deserve any of this. I try my best to be a good person, and I end up without a dad after my 19th birthday. We were born the same weeek. My birthday will never be the same. I just want to die."
  },
  {
    "post_id": "1c4f049",
    "title": "I'm struggling just being a parent today ",
    "body": "This is just a vent really, I don't particularly expect any advice.\n\nFor context I'm a veteran with PTSD. One of the things I dealt with in Afghanistan was the aftermath of the Taliban murdering a toddler who would have been the same age as my boy now (almost 3).\n\nBecause of this my son can be trigger for me, especially when having a tantrum and screaming (I hate that this is the case) but generally speaking we manage really well, he's my best mate and I'm a very involved dad. I also have a lot of therapy which is ramping up to try and nip this in the bud. \n\nLast night, when my wife was at work, he had a massive tantrum about having a bath, he was basically feral and I ended up screaming at him to stop it because it was causing me to visualise this child. I would never hurt him and I feel awful about this. It generally takes  me a few days to come down from something this. \n\nThis morning (since 5am) he's still being 'a lot', crying for his dummy (got rid of this months ago), throwing things, wants everything whilst simultaneously wanting nothing. It's one of those days where I don't enjoy being a parent. He wants me to play with him and it's taking every bit of energy in me to do that. \n\nI know this is normal terrible 2s behaviour snd it will pass but right now it's so fucking hard, I just want to disappear somewhere quiet. "
  },
  {
    "post_id": "1am3q8u",
    "title": "Fighting through Gender disappointment",
    "body": " I feel like shit. My wife and I are pregnant with our second (have a 2 year old girl). She is 8 weeks along. We took one of those sneak peek gender tests and found out that we are having another girl. I think this will likely be our last child. I suppose you should never say never but even before we started trying for this baby I had been thinking that 2 was probably where I would choose to stop. \n\nMy whole life I wanted to be a dad to a son. I am the youngest of four boys and think that the father son relationship is very special. My dad was (is) my hero in so many respects. I wanted so badly to be on the dad side of the line for all those pivotal moments of a man’s life. For thirty five years I have pictured that and with one silly little YouTube video that dream was smashed and removed from being possible. \n\nI love my daughter very much. She’s an incredible little kid I’m so lucky to be her dad. I had some gender disappointment with her as well but I wouldn’t change her for the world. I know that I will feel the same way about this next kid too but it’s really hard watching a long held dream turn to dust. \n\nI know and believe that girls can do and be interested in anything that boys are but society has very tired and true carrots and sticks to coerce homogeny out of people. Her being interested in the things that I love will be an up hill battle. Even if (and I intend) in our house there are no “boy” or “girl” things the older my kids get the more positive reinforcement they will get from their peers and other people for not being into “boy” things and being into “girl” things.  On a small scale I have already seen this happen with my niece. Before she started school her favorite color was yellow and everything was cats, after she started school, in what seemed like days it was pink, and unicorns. I recognize that this is a silly example but illustrates in part the power of societal norms. Worse still is that if by some miracle they do find an interest in the things that I like, their gender will make their participation in those spaces novel. I get to be a woodworker for example. They would likely be referred to as a female woodworker. To be clear I think that’s bull shit too, but we are stuck living in society that has some work to do. But this means the very things I want them to be a part of would in fact try and push them away. \n\nI also know that from the hop, connection is much easier for moms than dads. Pregnancy, birth, breastfeeding, new born life centers on mom and baby, and it should, moms are freaking amazing! But it was hard for me last time to find a way to build a connection with my daughter simply because I can’t do the things her mom can. I know that a baby boy would not change the newborn phase in the least.  As they grow up though their experiences will have closer ties to her moms than mine and so it will continue to be “natural” for them to not bond with me as much. My connection to them will never be as easy as it will be for their mom. \n\nAfter we found out, my wife and I talked a little bit about how we felt. We both had been hoping for a boy but she was just as happy with another little girl. She asked me and provided a safe and supportive space for me to tell her how I was feeling. But every syllable I spoke I regretted. Here we are learning the very first thing about our new child and all I feel is disappointment, sadness, and the start of a depressive episode. \n\nI want her to be happy, hell I want to be happy. I don’t want her to have to curtail her feelings around me or not be excited. It’s like I’m a black rain cloud stalking a parade and I hate that. She has asked me to share more and that just isn’t really my way. It certainly is not how I handle these kinds of feelings. \n\nThe best I could offer was that I would try, but the more I share I think the more concerned she becomes about how I feel. So I decide to take up my tried and true policy of consume your feels, wait for them to pass and “fake it till you make it”. But then she feels like I’m distant and complains of not knowing if I am really happy or faking. Which is fair. \n\nI feel like an awful father and husband. Like I wasn’t ready. I feel selfish and childish.  I’m trying desperately to climb out of this so that I can be the dad and husband that my family needs and deserves. \n\nI know that time is likely the solve here and meeting this little girl will smooth out the edges of my regret but that is cold comfort in this moment were I feel disappointed in the out come, disgusted with myself for feeling that way, and like a terrible dad and husband to my family. I can’t really say for certain what I’m asking for here. But I suppose I just needed to type it out and have shared it somehow. Now I guess I dust myself off and go find a therapist. It seems I have some work to do before my second daughter gets here."
  },
  {
    "post_id": "5kn4su",
    "title": "will the resentment go away?",
    "body": "I always wanted to have a baby. Now i have one and the affection i felt for her faded away in two months. She cries 7/24. Not just simply crying but shrieking. Every interaction with her results in this. She screams before, during, after diaper change, before and after feeding. Only time she is not crying is when she is feeding. The total time she smiled at us in two months is maybe 30 mins in total. The rest was trashing, crying, screaming and shrieking. I visited a friend and couldnt believe that they put their 1 month old in babasling. When we tried that she had such a fit that i thought she was going to pass out. I feel guilty all the time because of this but i really want to do nothing with her since she does nothing but scream. When i take care of her its because i have to. Everything is ok with her, her mothers milk is enough etc. I am not asking for advice. I just want to learn when she hopefully gets better will the resentment go away?"
  },
  {
    "post_id": "1fmj4lr",
    "title": "I can't connect with my second child",
    "body": "My first kid was awesome. When she was a toddler, she was outgoing, never fussed, always found a way to be happy. I loved playing with her and reading her stories, and doing her nighttime routine. \n\nAnd then about two years ago at 18 months old, she died. Fuck cancer. \n\nAnd now we have a five month old. She screams from the bottom of her soul. She is unhappy *all* the time. She had colic. She still wakes up every forty five minutes from 7pm to midnight, and then thrice more before 7am. \n\nI can't hold her for more than thirty seconds before her crying for mommy. I can't pick her up happy in the morning because she wakes up crying. I can't help with her at night because I'm not mommy and it just escalated into full blown tantrum at 2am. \n\nI want to be there and I want to help my wife, but this kid right now is doing nothing for me. I don't feel love for her. I don't feel a desire to spend time with her. On the rare occasion she smiles at me, I feel like it's a lie. Part of me resents her.\n\nI'm getting therapy because I know I'm still pretty fucked up over the death of my first child, I'm just afraid that I'll never form that bond with my second child. She deserves a father that loves her and is present in her life, and right now that's not me. "
  },
  {
    "post_id": "17xh48e",
    "title": "Mom wants to get our 16mo the Covid Vax. I am pro-vax, just anti-COVID Vax",
    "body": "Our LO will be 16m in a few weeks and mommy wants to get him the COVID Vax.\n\nI am full pro-vacinnes.  Our LO has all the vaccines one can take.  He as been poked more than a pin cushion.  \n\nI am just really scared about the COVID-Vax for the little guy. \n\nWhen the COVID Vaccines dropped back in 2021 I was really eager to get mine because I wanted my life back.  I got my two covid jabs and a booster back in 2021 an**d ever since my life has been hell.**  Nothing but health issues.  Headaches, body aches, chest pains, joint issues, vision degradation, (used to be 20/20) doctor's appoints, x-rays, scans, heart scans, blood tests,  time off work, no energy, chronic fatigue.  And of course, doctors have no answers.  \n\nI also had sever reactions to my shots. I was out of commission for 7 days all tree times time I got my jabs.  \n\nAnd when I caught COVID I was a completely write off for 10 days.   \n\nMommy is giving me the \"Suck it up buttercup\" routine.  She has been fine.  And when she caught COVID she caught COVID-Lite.  Our LO likely had COVID when I had COVID and he bounced back just fine.\n\nI am just really scared because if my LO is 50% me.  I really don't want to put that on him.  \n\nAnd she wants me to get my 4th jab.  I am DONE!!!! No more.\n\nAnd I don't want to make this political.   Pleas don't reply with \"trust the science\". \"you listen to too much Joe Rogan and Alex Jones\".  I don't want to hear it.   We have not been told the truth and this vaccine has ruined my quality of life. And the lives of others.  I was in perfect health before my COVID jabs.  The only reason why I am in good spirits is because have my LO.  "
  },
  {
    "post_id": "1bamyn7",
    "title": "I’m in a really tough and heartbreaking situation ",
    "body": "My fiancée broke up with me after we signed a lease for a house and after she and I filed documents to a loan program to buy a house. We have a daughter of our own who is 7 months.  And she has 2 kids at the age of 6 and 5 that I have accepted and treat as my own kids.\n\nI really want this to work out and talk out whatever issues we may have. We are both under a lot of stress and I keep reminding her that.  But she doesn’t want to fix the bridge.  She just wants to burn it all down.\nI’m in a pickle because she said she doesn’t want me to move. And I don’t want to move out and leave my daughter because the thought of not coming home from work to see my daughter smiling at me and me picking her up to love her just breaks my heart. And it breaks my heart that I wouldn’t be able to play Nintendo switch with kids I think of as my own. But I also don’t think I should stay there as well because what will happen if we’re broken up and she brings home other men and it’s just all awkward. And what if there is a time she decides to marry him.  Where am I?\n\nAnd I asked her point blank.  What are your plans for the future if we go separate.  And she said she doesn’t know.  When I had a plan.  A plan of marriage. A plan of owning a house, and a plan of a happy life together. And it’s just all gone for some instant warm fuzziness instead of seeing the big picture.\n\nI still believe and have hope.  But it seems dire… and it was all just so new to me that she felt like this this deeply. I thought we were just fine 2 weeks ago."
  },
  {
    "post_id": "m4w12e",
    "title": "Is my child mine? Would you want to know?",
    "body": "So my child is ten and is the best thing that has ever happened to me. We are inseparable best buddies.  But he absolutely looks nothing like me at all.  I have been a great dad totally hands on. \nThing is his mother and I never married but I am named on the birth certificate.  \nWhen he was conceived I suspected she was being over friendly with a work colleague but she dismissed it out of hand.\n\nBut as years went on I still wasn’t convinced and as child looks nothing like me.\n\nWe split last year I move out just down the road and have him 50% of the time. \n\nThe house we once shared is totally mine, and the ex cannot afford to buy me out.  And is asking I give her the 100k in equity to her, to keep family home / roof over my child’s head. \nIt’s always been a bit of a gravy train for her and I have kind just gone along with it as we have a child together or so I thought. \n\nI was just about to agree then another family member committed about my child not looking anything like me and it made me doubt it all over again. \n\nNow I’m considering a paternity test to know once and for all. \n\nBut I’m worried what would happen if he’s not mine! It would destroy me! \nBut the constant not knowing and doubting is terrible too. \nAnd the thought of her lying to me all these years and her benefiting financially from it too, makes me feel sick. \nBut if he is mine peace of mind finally!! \n\nStuck to what to do! \n\nI suppose I’m not after advice or anything I just needed to get it off my chest."
  },
  {
    "post_id": "191u5uk",
    "title": "Intrusive thoughts after this Alaska Airlines fiasco",
    "body": "This is just a venting post, figured this was a good place to post.\n\nFor those that didn't hear the story, an Alaska Airline flight on a Boeing 737 Max 9 had a segment of the fuselage blow out, leaving a giant hole right next to one of the rows of seats at 16,000 feet.  Fortunately, by the grace of God or whatever, nobody was sitting in those seats and nobody got hurt (though I read that a toddler had his shirt sucked off of his body from the pressure change).\n\nWe fly all the time with our kids, and typically we let our oldest sit in that far window seat and play with his iPad and coloring books and whatnot.  We try to keep him belted the whole time, but there are periods of time when he needs to stretch his legs, and for the sake of our sanity, his sanity, and the sanity of everybody around us, we let him stand on the seats and stretch his legs.\n\nNow I'm having intrusive thoughts about what it would be like to watch the fucking wall open up and my boy being sucked out.  Then my poor baby falling to the earth all alone due to a freak accident like that.  I think I would leap out of the hole right after him, leaving my wife a widow just so I could try and catch up to him and try to at least convince him that everything was going to be ok and not to worry while we fell to the earth together.\n\nI keep visualizing it and I have to purposefully prevent thoughts about it.  It's so horrific.  \n\nI'm not really sure what I'm looking for in response to this post.  Like I said, I'm just venting to a bunch of people that might be able to relate.  Thanks for reading."
  },
  {
    "post_id": "x2akr3",
    "title": "Any other dads worried about energy crisis ?",
    "body": "Not sure where in the world this is having a big impact but in the UK our electric and gas is going to Insane price levels. 2 years ago I was paying 80.00 per month for both iv just had a call with our supplier (who is the cheapest) and this is now going to 410.00 per month. \n\nWe will be able to pay it what it will mean though is all disposable income will now be gone. I’m having a really really tough time trying to be in the slightest bit positive. There will be people in worse situations than me I know this especially in this country but I can’t help but not feel like a huge failure as the bread winner and provider when we are only just going to get by. There won’t be any big presents or surprises for my little girl now for at least the next 12 months no nice family holidays… we had planned on taking her to Orlando despite her age as it’s mine and my partners favourite place but god knows how soon we will go back there now,I don’t have the best outlook and mental health at the best of times and this is a huge blow.\n\nChildcare costs price my partner out of being able to contribute more and even if they didn’t do that I don’t want my baby girl being looked after more by other people than her own mum and dad.\n\nThe role model I have as what a dad is was my own dad, he worked super hard and made sure we always got looked after and did special things. The only thing I’m going to be able to treat her to is putting the heating on."
  },
  {
    "post_id": "1d0uvff",
    "title": "Marriage is on the rocks. Accidentally walked in on a speakerphone conversation with a male voice I didn’t know, the morning before she scheduled “a day to herself”.",
    "body": "She’s been gone for 33 hours now. This is my second sleepless night without her. It’s nearly 2am, and she said she’d be home to put the kids down at 8. Guys you don’t know the whole story, but my married life is flashing before my eyes, and I feel like I’m keeping vigil for something that is dying. \n\nI don’t have deep roots where I live, and my whole life has been dominated by this one relationship, so I don’t have much of a village. Losing her would be chainsaw surgery. \n\nThat’s all. Just very alone right now. "
  },
  {
    "post_id": "75dgc8",
    "title": "Thoughts on the past few months.",
    "body": "My daughter passed away three months ago a few days ago, so I started writing down some stuff. It’s not done yet, but I just felt like getting it out there. Sorry for the weird formatting, I’m on mobile and it pasted weird. It’s really hard to go through life not knowing when you’re going to break out crying in public. It’s even worse when you’re wife has the same problem, which then triggers you, and then all of a sudden to everyone around, it looks like the two of you just broke up. Maybe I should back up. On July 6t h , 2017 my six-month-old daughter Willow passed away. I’m writing this to get all my thoughts down because my mind is starting to heal itself by reducing that awful day into only a few vivid images instead of a long video of the worst day of my life. The first thing I can really remember is thinking how hard it was to run through the parking lot wearing flip flops. I had been late to work because I had taken our oldest dog Lady to the vet, so I was forced to park fairly far away from my office. I had been sitting on a conference table in the middle of the room when my phone vibrated. My wife was on the other end crying hysterically that Keisha, the lady that ran Willow’s daycare, said that Willow had stopped breathing and EMS was on the way. For a split second, I thought “Oh, she must be exaggerating. Surely this isn’t actually happening.” Then the gravity of the situation hit me, so I ran downstairs, through the parking lot, my flip flops slapping the ground as I rushed to my car. I told my wife that I would meet her at the hospital since I could get there faster, and the ambulance would’ve left by the time I got to the daycare anyway. After breaking several speed limits as I floored it on the highways to the hospital, I was in a calm, but focused panic. This can’t really be happening right? I mean, you hear about these stories all the time, but you never think it’ll happen to you, as cliche as it sounds. I remember sitting waiting to turn onto the road to the hospital, when I called my dad to make sure I was going to the right hospital. It made sense to call him since he’s a retired firefighter, meaning he was skilled in crises. I’ll never forget how everything stopped as he said “Buddy, I’m sitting here with Jasmine and.... I’m sorry. She’s gone buddy.” Not knowing what to do, I drove to the hospital anyway and awaited my mother to come pick me up, as directed by my dad. I remember collapsing into a pile of tears and uncontrollable sobs in against a window in the ER waiting room as I waited for my mom to pull up. Much like a scene in a movie, I sprinted toward the house when we arrived at the daycare. Everything was like a dull roar in my ears as I ran through the pouring rain toward the daycare’s porch. My wife was sitting on a bench out front with my dad, flanked by numerous police officers, my brother, and sister-in-law. Most of everything after this is a blur of interviews with the coroner and homicide detectives. I do remember asking to see Willow one more time so I could kiss her forehead, but I regret it. She was lying there pale as a ghost with her eyes still open. This day started out with the vet testing my dog for cancer, and ended with the death of my sweet, perfect daughter. It’s still incredibly hard to talk about right now, almost three months after it happened. Everything I’d ever known was thrown into disarray. Luckily I have a great relationship with my family, and Jasmine’s (my wife) family wasn’t too far away. All of them came together to take care of us for the next several days as we figured out what to do next. I’ve never really had to deal much with death, much less plan a funeral before. We didn’t really know where to start. Willow’s body wouldn’t even be released from the coroner for a few days since the police department’s homicide unit requires a full autopsy whenever an infant dies suddenly from unknown circumstances. That’s reasonable. But little did I know that things were about to get even worse. She passed away on a Thursday, so here we are on Saturday when I got a call from the vet. As I said earlier, before Willow passed away, I was at the veterinarian getting my elderly dog tested for cancer. Well, it turns out that she had it, and it was incredibly aggressive. In the few days since she was tested, things had taken quite the turn for her. She wouldn’t eat much, and could barely walk. We knew this day would come when we adopted her a couple years ago. She was an overweight, elderly dog that no one wanted. We immediately fell in love with her and knew we could give her a few more good years. We never imagined that her life would come to an end the same week as our daughter’s. The next day we skipped church so we could take Lady to the vet so she pass away in peace. We must’ve fed her five hot dogs. She was an angel until the very end when she fell asleep for the last time. My dad buried her under a large willow tree in my parents’ backyard, which was almost too much for me to handle considering the symbolism. It’s hard to explain how I felt during the days following when she passed away. It was a constantly shifting mix of incredible depression, rage, disbelief, and numbness. Here’s where I start to feel guilty. I feel almost..."
  },
  {
    "post_id": "13oyxc8",
    "title": "US Healthcare system is broken",
    "body": "Not really saying anything surprising here, but just needing to vent a little.\n\nMy 3 year old daughter got strep last October for the first time. She got better fairly quickly, but her tonsils never returned to normal size. They're so swollen, she chokes at least once a day, and since October has had what appears to be an almost permanent sinus infection. We've been using those booger suckers every 15 minutes, 500 times a day, for the last 6-7 months.\n\nOne random day last month her nose cleared up for the day. She was quite literally dancing with joy because she was so surprised that she could smell things. Then cried for a half hour the next morning when she woke up with her nose stuffed up again and her sense of smell was gone.\n\nOur fantastic health insurance company won't approve the tonsillectomy that our pediatrician and ENT both approved until she's had strep 7 times in a single year.\n\nSo regardless of the recommendation from two licensed medical professionals, I have to watch my daughter suffer for one last round of strep (after this one she's dealing with right now) before we can get the treatment she needs.\n\nI spent the entire night sleeping for 15 minute stints on her floor, managing a 103 fever + constant vomiting. Powerless to help her, and its just infuriating.\n\nEdit: I know many of you in here are currently battling much more serious issues with your kids than this. So I really hope this comes across the way I mean for it to come across. Definitely don't want to diminish anything anyone's going through right now. Apologies in advance if this offends anyone! "
  },
  {
    "post_id": "8az4af",
    "title": "Lost my son to a late miscarriage at 19 weeks yesterday.",
    "body": "If you'd asked me a year ago about whether or not I could handle fatherhood, I would've shook my head 'no'. When my wife got pregnant, there was a mixture of excitement, trepidation, fear, and honestly, an unwillingness to let go of the life I knew at that point. I spent much of adulthood only needing to concern myself with me and a small handful of others. It wasn't until I started accepting fatherhood, a new role, and the process of shedding the man I was to become the man I would be: a man who doesn't run the other way in the face of responsibility.\n\nWe had our ultrasound appointment on Friday. I was excited and figured I'd be going straight from the appointment back to my office to finish work. I never imagined the heartbreak that would soon occur. The baby was great: healthy, moving around, heart beating at the perfect pace. But the technician pointed out a huge problem: my wife's cervix was open and she was already a couple centimeters dilated. They rushed her to Labor & Delivery and she coincidentally began cramping not long after. They confirmed that her water had broken and finally started her on Pertussin. Yesterday afternoon they delivered my son. Of course, sadly he passed not long after. We got to hold him, kiss him, talk to him, and prepare to let him go and start the long journey ahead of us. He was beautiful. I didn't immediately think so, but as I held him I began to feel an overwhelming attachment. We finally let go and were given the \"memory box\" with his blanket, hat, and other items. My wife and I cried so much, and we continue to do so. I'm holding back tears writing this, as we speak.\n\nI thought about a lot over the course of these past few days. I thought about how I'd move on, and the surprise of realizing the tremendous hurt this bought. There was a point very early in the pregnancy where I thought maybe I'd be OK if something like this were to happen. But those thoughts were from a man who was still willing to hide from responsibilities. And that's the silver lining to all of this: at 35, my son turned me into the man I need to be. My son made me a person who could put others before him and face his responsibilities because the rewards were so worthwhile. My son made me a husband who promised to strengthen his commitment to his wife and family. My heart weeps for him and for us. We don't know how we will move on, and the road ahead of us is long, but I know that because of him, and for him, I am forever changed, and finally becoming the man I need to be. Good luck to all of you, and I hope you are blessed with happy and healthy children. We will get there one day. I believe that my son came to prepare me, because his brothers and sisters need a strong and prepared man to be there for them."
  },
  {
    "post_id": "1fk7rno",
    "title": "What is something you are looking forward to doing with your son. ",
    "body": "My son is only 3 years old but I already have a bucket list of things I want to do with him. I can’t wait to show him how to drive or to have my first drink with him (hopefully), or just do dumb shit with him in general. I had a horrible upbringing with my stepdad where I was physically mentally and sexually abused for about 10 years so I am excited to show my son what a normal father son relationship looks like."
  },
  {
    "post_id": "1cdu9g2",
    "title": "My 3 year old saved my life today…",
    "body": "My 3 year old saved my life this morning and he doesn’t even know it. I have been struggling a lot lately and the demons were LOUD this morning.  As I sat quietly on my couch with the wife and step son getting ready for the day, my 3 year old must have sensed that daddy wasn’t ok. He walked up to me and didn’t say much of anything but instead just stretched out his arms and said daddy pick me up. I picked him up and he just laid his head on my chest as he watched his cartoons, not saying a word to me. Even though he wasn’t physically talking I heard “daddy I love you and I need you. Please don’t leave me.” We sat there like that for what felt like an eternity as everything around me grew quiet and I just felt his heart beating against me. It was maybe 5-10 minutes but it felt like a lifetime. After this I carried him to the car so my wife could take him to daycare. Told him I loved him and gave him a big kiss. After they pulled off I went into my office and was paralyzed with anxiety and emotions and just couldn’t stop crying and began to hyperventilate a bit. I am tired. So tired. I gathered myself enough to call the Veteran’s Crisis line because while the demons were loud, his voice was louder. He doesn’t know what that hug this morning did, but I will continue to fight for him! I can’t leave him! As frustrating as it is to be a parent, kids are truly a blessing. "
  },
  {
    "post_id": "14atpad",
    "title": "I feel like a failed father already",
    "body": "Wife is pregnant, 3 months in. I was finally up for a significant promotion at work, which would have been just in time for the baby’s birth. Not that our lives depend on it, but I felt so proud doing this for my kid, struggling all this time, just to make my family’s life easier.\n\nYet yesterday I did a huge mistake at work. My colleagues were angry, my boss was mad, my boss’s boss was beyond angry. I just can’t believe it happened. I was completely out of it when shit hit the fan, and with a great help of my colleagues managed to salvage what we could. But my reputation is damaged. I am almost positive no promotion for me. And it’s fucking killing me because I feel like such a failure. How am I gonna be a good father when I couldn’t prevent such mistake from happening at work? Now my family will struggle more because I won’t get that promotion. It’s all back to square one. Don’t feel like I am ready to be a good father"
  },
  {
    "post_id": "1e6v65l",
    "title": "SAVE plan, student loans, and the financial pressures of being a dad ",
    "body": "For those who don't know, there's some student loan fuckery at play today which results in likely higher payments and the removal of a loan program promised to alleviate some pressures of student debt.\n\nIt's got me sad about my financial future and just bummed in general about surviving in America these days. \n\nI did everything I was supposed to do, went to college, got a job, worked hard, started a family. And it just feels like a stable and secure life in this country is just getting harder and harder to reach...\n\nMy and my wife's loan payments will be almost $1000 a month... yes maybe we made some poor decisions that led to this but we were 18 fucking years old when we signed up for this ride and just looking to our parents and elders for advice on how to navigate life. We listened to them and this is where we're at 15 years later.\n\n$1000 student loan payment, also $1500 a month for healthcare. Did I mention it covers exactly zero of any services we actually use to stay healthy? Mental health care? Doctors who can see you within a reasonable time and actually care about your health? Dental? Vision? Not covered. So $1500 per month for basically nothing. \n\nOh and did I talk about how terrible our public schools are? And how uninspired, depressing, and lifeless the state of our education is? So if I want my child to be taught by someone who actually is attentive, present, caring, and skilled, I have to go the private school route... so another $3k per month for both the kids to go to a good school.\n\nOh yeah and housing? $3500 a month for a passable rental. Buying a house is out of the picture. Interest rates make it impossible to buy what we could have bought 5 years ago if we had the money back then. And , insurance companies are pulling out of my state so to get homeowners insurance you get gouged again. And property taxes are wild. A mortgage would be more like $6k so we stick to renting.\n\nForget about inflation. Groceries, gas, clothes. \n\nHow the fuck are you supposed to raise a family in 2024? It feels like the world is actively working against my success as a father. "
  },
  {
    "post_id": "18f761k",
    "title": "Are there days anyone else hates being a dad?",
    "body": "I work full time my wife works nights…usually we have the responsibilities split reasonably well but when she gets busy at work she just kind of excuses herself from some of her responsibilities.\n\nNormally she…\nGets him up in the morning\nFeeds, and changes him\nTakes him to school\nDoes the laundry \n\nI..\nPick him up \nFeed him dinner\nBathe him\nDeal with bedtime\nDo the dishes\nBasically just be the parent by myself 5 nights a week\n\nThis week well the last few weeks really…I’ve done nearly everything by myself on my wife’s days off she has changed maybe one diaper. All I wanted to do this weekend was put the ornaments on the tree…no help. I get that she’s tired but I’ve been tired since Halloween. I’m tired of feeling like I’m raising my son without support. While my wife spends all her time wrapped up on Facebook and work drama. She got upset last night because she suggested a vacation I tossed out some ideas and she wasn’t sure those would be good places to have a baby…then got upset again when I said I wanted a vacation without the kid. My wife wants more kids…I want help with the one we have now. \n\n\nI’m just so completely fucking over it right now. I feel like asking for a few hours a week for her to actually be responsible for the kid isn’t that big of a deal…even when I get the time it still gets used for chores. Am I being ridiculous I’m tired of my wife acting like I’m high or have a sick growing out of my forehead when I ask for a little support. Someone help me out here I’m at my wits end.\n\nOn mobile and watching the kid so sorry for weird formatting or anything."
  },
  {
    "post_id": "1e664i4",
    "title": "Any chronically tired dads here who are functioning only with sufficient coffee?",
    "body": "I've had this tiredness my whole life. I slept through university, I slept during meetings as I entered the workforce, and it took me a while to get my shit together enough to become functioning. Caffeine and fitness helped a lot.\n\nBut now, having a 4 and a 1 year old, and living thousands of kilometers away from their grandparents, I struggle again. Before kids, my standard was 9 hours of sleep, and I was doing well during that time. Now I get a regular 6-7, and I'm just tired, always.\n\nBut when I say tired, it's not just that. I'm less energetic, less fun, less motivated, more easy to react with unnecessary anger. Some of my friends who are fathers, I see how they act with their kids, how they act in general, and they're just fun, and high energy. I can be like that, sure, but it's only for a relatively short duration, it takes at least 150mg of caffeine, and after that comes a huge energy dip.\n\nOnce in a while I pop a caffeine pill(200mg) alongside my coffee to have a good workout and after that it's like I'm high on life for a couple hours. Everything is enjoyable, I'm getting all the dopamine, and I'm fun for my wife and for my kids. \n\nThis is just a rant to be honest. Today morning I had a big ass double coffee, and as I was cycling with my son to daycare, we stopped to look at flowers, talked about insects, colors we see. And I realized I don't do these fun things when I didn't have enough caffeine. I'm boring and irritable as a baseline. And that made me kinda sad.\n\nAnyone else going through life like this? "
  },
  {
    "post_id": "18epjpq",
    "title": "Zoloft and Dad Life",
    "body": "Hey dad's, I'm wondering if anyone else can share their experience using Zoloft or other SSRIs while being a dad to younger kids.\n\nI've struggled with mental health my entire teen/adult life, but the past 6 months have been particularly bad, culminating with me ending up in the hospital after self harming. 12 staples in my leg later I left the hospital with a Sertraline (generic Zoloft) prescription.\n\nI took an SSRI over a decade ago for a few months but stopped after the side effects outweighed the benefits.\n\nI've been fairly averse to medication since then, and I'm really nervous starting up on antidepressants again. 4 days in and the startup side affects are kicking my ass.\n\nWould appreciate and positive experience stories or tips fellow dad's can give me."
  },
  {
    "post_id": "1fzqvfy",
    "title": "how bad on my 4yo boy it will be if I get a divorce?",
    "body": "wife and I been together for 7 years, married for 4 and have a 4 year old boy together.\nThis past few months the wife has been commiting financial infidelity and it really put some stress in the relationship.\n\nI’m gonna be honest, if it wasnt for my son I would already have left long ago, but I’m trying to be strong just for him because I know how hard it must be for the kid so young to have separated parents.\n\nMany reasons stopping be from divorce and seeing my son less:\n- wife lets son do whatever he wants when I’m not around (example: go to bed at 11pm)\n- give him insane amount of sugar/candy whenever he asks\n- she doesnt cook (so whenever I’m not home it’s mac n cheese/hotdog/grilled cheese)\n- her poor boyfriends choices she had before me (I wouldnt trust them around my kid)\n- She’s ALWAYS late, for daycare drop off, for my son’s sports events, for EVERYTHING.\n- she doesnt do anything with my son, she just stays on her phone, doesnt take him to the park or anywhere, just lets him on the ipad or tv when I’m not around\n\nThe plan was to way until he’s older so he can understand better but I just can’t take it anymore and I know she’s not going to change.\n\nAnyone else been in a similar situation that could give me a light? Should I suck it up and stay for my son or a divorce is not that bad?"
  },
  {
    "post_id": "14motkf",
    "title": "Wife makes me do everything, but then also fights me on it.",
    "body": "How do you handle this? Wife has a friend over and we all chat and hang out while the kids are around us and they’re eating dinner, friend finally leaves and wife goes to start to put two kids to bed and I brush their teeth and the kids then use the toilet each and my wife is fucking pissed and yelling at me that I interrupted her special reading time and putting them to bed all because I didn’t brush their teeth sooner.\n\nWife snaps and is super pissed off over this. She knows and supports the kids eating a later dinner and that’s the way we all are, but then when she snaps she says I should have brushed their teeth at 8:30! But they would all have cavities with that method since they were eating after 8:30. \n\nAlso my wife doesn’t ever brush their teeth. That, along with every single other parenting and household tasks, is my job. \n\nSo my wife yells at me more. Says now it’s my job to calm down our 2 y/o (who was just simply overtired at that point and should’ve gone to bed sooner).\n\nI then spend time alone calling myself down, telling myself not to react, etc. it’s an impossible situation. I’m responsible for everything and everything is my fault. \n\nPretty sure I know why my brother-in-law drank himself to death and he had two small kids - I’m sure his wife (my sister in law) made his life a living hell."
  },
  {
    "post_id": "1dpdfxj",
    "title": "Girlfriend bailed out ",
    "body": "Well dad's, while i was at work on Monday my girlfriend packed her things and left. I was caught really off guard and after some digging I saw how terrible she had been talking about me behind my back to her friends, family, etc. I asked her what happened and she told me she didn't feel appreciated for the work she did, and didn't feel like she could come to me for help with housework. The latter is absolutely not true, I consistently told her I would help her if she asked. The former, well, that is absolutely on me. I should've showed more appreciation to the work she puts in the house. \n\nFor reference we are both military, buy I run a side business which keeps me fairly occupied at home, and then I have my daughter every other week. My daughter has been the hardest part of this. She keeps asking when she's coming home. If she's at home yet. Why isn't she home. She's 2. My girlfriend was her best friend. What do I even tell her? \n\nHer frustrations were valid but the talking about me behind my back, and lying to my face about it...don't know dad's. I'm hurt by this one. Just the night prior she had asked me if I saw a future with her, and my answer was of course I do. I thought it had made her happy but maybe the smile was more of an \"I know something you don't know\" smile. I get that I fucked up, but I wish she would've just voiced her frustrations to me instead of bailing on me like this.\n\nNow my bills are going to be more taxing, groceries will be harder, rent, everything, all in the midst of me paying off loans and cc bills that I racked up paying for a lawyer to win split custody of my daughter. I cried my eyes out when I got home and all of her things were gone, but I know I can't show this in front of my kid. She's counting on me to be superman, especially with her mom and I already split, I can't let her see this kind of thing. \n\nI think I'm just done dating. I can't keep introducing women into my life, for them to leave. When my daughter is old enough to understand it will break her. And no, I didn't start dating this girl and just immediately introduce her. It was months before that happened. \n\nI'm so tired, and stressed, and I don't know how to keep my head above water on this one. What do I do, dads?"
  },
  {
    "post_id": "ncaxv4",
    "title": "Just found out we’re having a boy.....",
    "body": "I’m scared shitless typing this next to my sleeping wife. I grew up with a man that was my dad but not my father (if that makes sense). He was not a good man to my mother leading to divorce, then multiple women in and out of our lives. He taught me how to play sports, but didn’t teach me how to be a man. From not teaching me how to change a tire to not teaching me how to tie a tie (which I still can’t manage without my wife’s help lol). This whole pregnancy I’ve been wanting a girl because then I could rely on her mom to teach her the womanly things. But it’s a boy and the load is going to be on my shoulders and I’m terrified I’m gonna fuck it all up. It’s hard right now to hide my fears from my wife. She asked when we heard what it was why I wasn’t excited and I just said it’s becoming so real that it’s overwhelming but that I am excited. Please help, I need advice on how I can do this and what I should do. Thank you!"
  },
  {
    "post_id": "10qhssi",
    "title": "Im 16… need advice and help.",
    "body": "Im gonna start off by saying yes im stupid. Ive been told by almost every single adult by now. My gf ( also 16 ) and I ( also 16 ) found out she was pregnant 11 weeks and two days ago. I know not everything has really hit yet in terms of maturity for me but im definitely love her and realize how much i’ve  changed both of our lives. Im also going to go ahead and say that abortion is not a option with us. I would like to leave out any political ideas or religious. My parents are christian and i am as well. However they still let me stay in their house. ( I shouldn’t really have to say that but it is a huge debate now a days. ) I there is no way i would ever leave her on her own to take care of our kid and i really want to do my best to be the husband ( hopefully marry soon ) and of course Father. Im in my junior year of hs as is she. She will be going online shortly. Ive considered doing the same so i can work more and possibly get another job ( currently a bagger at a local grocery making a little over 8 dollars an hour ). Im really stressing guys. Like i have no idea what to do what to buy where to go for parenting courses etc. Any advice would be VERY APPRECIATED."
  },
  {
    "post_id": "6zdjnh",
    "title": "Hey fellow Daddit-ers, any of you struggled with loneliness and depression after baby was born?",
    "body": "I love my wife and my son and I'm definitely overjoyed to be a dad but the last few days I've been feeling lonely and struggling with depression. I has l used to have a history of depression and loneliness years ago but it seems like it's back. It's hitting me more and more that my old life and hobbies are starting to go away. My closest friends all moved away and its difficult for me to meet new people/make new friends. I don't know if I can have my life being just work and family. I think I need to socialize and get out but don't know how to go about it. \n\nMy wife was also struggling a little with post partum depression recently but seems better each passing day.  I think our lack of sleep is taking a toll on us so I'm not sure if this will pass eventually. "
  },
  {
    "post_id": "17q3nle",
    "title": "I'm asking a pretty tough question here. How and when do my wife and I know if it's time for adoption.",
    "body": "My wife is struggling with severe anxiety, I am not doing any better either. Our daughter is 15 days and we are both struggling so much. We had the MIL come in for a night of relief but that didn't change anything. I really want the best life for my daughter and at this point I know she is not getting it. I have a therapist appointment this week, plus I am going to visit my doctor. I am trying to take the steps I can to get better but I'm just not sure what to do. My wife and I were so in love before this and we've both said so many times that we miss each other through these first few weeks..Has anybody gone through this process before. I will add that our daughter is a pretty decent kid, she wakes everynight around 3 hours, she's a bit fussy all through the day but all in all she's not a crying horrible child. That's what's making me think that maybe we aren't the best parents for her. I've read a lot of messages on this site and I know some might come at me hard for thinking this way but I'm just not sure about this."
  },
  {
    "post_id": "hmrfav",
    "title": "Tips on staying calm?",
    "body": "I'm a first time dad with a 4 month old. She's early teething and has been for a few weeks. She has times where she screams and I have to wear earplugs just to keep myself from escalating. I have a hard enough time with her while she screams so I end up handing her over to my wife. Anytime she cries, no matter the reason, it spikes my anxiety and stress levels. My wife and I did plan for this baby so it's not like she unwanted. Coming home from work on Monday she was fine. that's what my mother (who was at my house when I got home) and wife said. She got a little fussy, but she was tired and I ended up laying her down for a nap. Later that evening I was trying to feed her and she kept pushing the bottle away. She usually does that as I think she's trying to hold the bottle herself and isn't very good at it so I kept trying to feed her, ended up stoping, I was getting frustrated. She was pulling at her gums so my wife said get a cold binky from the fridge. Long story short, I got really frustrated, had to hand my daughter over to my  wife and she had a hard time getting her to calm down, we ended up giving her some baby ibuprofen. She calmed down after that. \n\nLater in the night my wife and I argued while putting our baby to bed. Now she thinks I don't love her or the baby and I should \"leave.\" This is hard to put in writing the morning after a fight, I have to leave for work soon and I don't want to come home again to have another argument. I didn't realize this First time dad thing would be so hard. I need some help. My wife feels like a single mom."
  },
  {
    "post_id": "4lizu9",
    "title": "Made a huge mistake today and now I feel awful",
    "body": "Long story short, my wife and I both thought the other was watching our two year old daughter and she ended up in serious danger.  My wife was looking for something in the backyard and I was inside when she asked where she was - when I couldn't see her inside, we started to panic, and started tearing around looking for her.  I ended up finding her about three minutes later when I looked in front of our house (she never is allowed out there) and I saw someone pull to a stop, get out of their car, and start pointing.  She had wandered half-way down the block and was headed for the corner to (we think) go to the park we always visit.  Another minute and she would have probably been around the corner and out of sight.\n\nWe're counting our blessings that she was okay but it terrifies me to think that she could have gotten into the road, picked up by someone, or who knows what.  I know there is nothing I can do other than move on and be more diligent and aware in the future, but this incident has left me felling like an awful parent.  She means more to us than life itself and to know that we allowed her to walk into such a dangerous situation makes me sick.\n\nAny advice from others who have had similar experiences would be greatly appreciated; this is our first incident like this and I'm not really sure how to handle/process it."
  },
  {
    "post_id": "abftci",
    "title": "I just need to let it out",
    "body": "67 days my daughter has been in the NICU, each day is a blessing, and every time I look at her I am so indescribably thankful for each moment I get to watch her.\n\nI guess the whole situation is weighing me down today and I needed to just write it down.\n\nEarly on in October I was with my wife at one of her appointments where we were told that our daughter was not doing well, she was suffering from IUGR and the phrase \"imminent stillborn\" was presented to us; she was too premature, too tiny to take on the equipment needed to survive. We were heartbroken, our daughter was still kicking away but was fated to not see the light of day.\n\nNot wanting to give up hope, we waited week by week until she was big enough that our daughter could take on the equipment. Each week we were told the same thing, but in my mind and my wife's as well \"If she dies then it will be a burden to bare, but we can't make the choice to terminate her ourselves.\"  Then the day came where the doctor said \"We need to do this today, or it will be too late.\" So my wife was whisked away for a C-Section despite my daughter not weighing enough; and i was left hoping that something divine intervened and guided that doctors hand. \n\nMy little girl was born on October 25th at 13 oz, the smallest the Dr had successfully delivered and they keep calling her a miracle. The experience has been wonderful, everyone has been so kind and generous.\n\nBut everything is weighing my down today, I just normally feel like I am treading water just fine and today the waves are crashing a bit harder than I can sustain. I feel like I am working so hard and yet still falling short. Between work, home life, the hospital, the budget. I just want to slow it down and hold my daughter, but I can't yet.\n\nThings will get better, ill say it again. *Things* ***WILL*** *get better*, Hell, she's over 3 lbs now.\n\nIt just sucks right now.\n\nIf you read this, thank you, i really didn't expect anyone to, i just needed to write it down.\n\n"
  },
  {
    "post_id": "1e5izgo",
    "title": "Coping with feeling that it's all too much responsibility ",
    "body": "Hi daddit \n\nI used to be easy going, chilled out guy but now I'm in my late 30s with a wife+son and all the other responsibilities that life throws at us dads I'm struggling. \n\nI'll say I'm not suicidal, anyone reading this who is having those thoughts please find some appropriate help. \n\nI'm just talking the day to say stuff. Work. Chores. Parenting. Husbanding. I feel like I can't breath from the constant pressure to do X,Y and Z and I don't like how it's affecting me. \n\nI need more free time, more time where I don't have to adult and don't have to think about what I NEED to do just to stand still and not be going backwards but it's impossible to get time for that. \n\nYet consciously I know I'm very lucky. I have a good job, high pressure but a good wage and I work with nice people. We own our house and live in a safe part of the world. I shouldn't really be complaining \n\nBut the feeling is still there. How do you all deal with the pressure of being a dad? "
  },
  {
    "post_id": "1b99uay",
    "title": "Fellow daddies who have hired a house cleaner, I have questions. ",
    "body": "Pre info.\nCleaning has started to be an issue. It seems to never be in balance. When I was working evenings it felt like I was just constantly doing everything cleaning included. Had zero time and started to flag mentally extremely bad due to have no real free time while working 50+ hours and she was always finding ways to waste my weekends so I continue to have no real time to decompress. I bumped shifts and slowed down on the overtime. I still do the dishes weekly a couple times (dishwasher that holds three days worth of dishes)  and 95% of all sweeping and mopping. I was able to see friends and family. Mental health improved greatly. I am not  as hateful and miserable as I was before. It been a terrible week at work as it's been revealed that I will most likely get bumped off my shift and I slid back into a depression this week. I will have to cross that bridge when it comes.  Wifey said she wanted  to talk about a cleaning schedule. I feel this will end up with the one hour I have truly free to do things like hobbies, TV, etc I get daily while she does the bed time routine being scrapped. . Which once or twice a week when my wife works her part time job (2x3 hours). In the past I said we should hire someone to clean the house 1 or 2 times a month. A good deep clean. We can afford it. She however keeps refusing. \n\nHas any other dads outsourced cleaning to help with balance and did it help ease the asymmetrical balance? \n\nI have never commented on her the house being dirty or demanded it be spotless."
  },
  {
    "post_id": "t5vcuu",
    "title": "I Want a Divorce",
    "body": "We have a beautiful 6 month old baby girl. She's the most amazing thing in my life, and I feel horrible even contemplating this, but I don't have any ground left to give her mother to keep the peace. The thought of not really being in my daughter's life absolutely kills me, especially as someone who more or less grew up without his father. Literally my worst fear as a parent, but here I am.\n\nI just can't deal with the constant complaints, demands, micro-management, and needless provocations anymore. No matter what I do, what I give, what I sacrifice, my wife is irate about one thing or another on almost a daily basis. Every time there's an argument, I'm the peacemaker, and I give up ground, but now my back is against the wall and I have nothing left to give. Do I still love her? I'm so numb from being beaten down by this over the years, that I honestly don't even know. My only indication is that I did miss her when she was out of town visiting her parents, but as soon as she came back home I felt like a prisoner again because I have to stop and explain, and be second-guessed, about every single thing I do. I don't have that time for that, nor the energy, and really it's just very controlling and emasculating.\n\nShe had a miserable job that she hated, and for years me and the dogs would get the brunt of it... I made excuses for her and said it was just her job that made her this way, and certainly that was a big part of it, but perhaps I was a fool. I long ago stopped asking her about her day because I couldn't deal with the daily 45 minute torrent of negativity, as it just kills me inside especially as a creative person, and she refused my requests to go see her therapist because she \"already knows what she'll say\". I begged her to quit and do something better with her life, or follow her dreams and start a business, but there was always some excuse. We had done quite well on real estate and have the luxury of both being able to quit our jobs for several years if we wanted to, so money is no excuse.\n\nFinally, she quit that job to watch our daughter, which was a wonderful breath of fresh air and got my hopes up for our relationship, but sadly it was short-lived. We're once again in a fight, this time because I chose to sit in our rocking chair instead of making the dog move off of the couch so that I could sit next to her. The dogs had been nervous with a lot of change lately so I said I wanted to let them just be comfortable, but my wife snapped and unloaded on me, putting words in my mouth about how I don't want to be by her, etc. Obviously she was already pissed about something/everything else and was just waiting for the slightest thing to blow up over. I returned fire and gave her everything I had been biting my tongue about, because I have no more room left to retreat to try to keep the peace. I know it hit her hard because she wanted a day to cool off and then talk about this, whereas in the past she has demanded immediate talks while still escalating things.\n\nAnyway, the harsh realization here is that nothing will ever make my wife happy, and I need to stop making excuses for her crap behavior. It's not healthy for anyone. I'll be more than fine all on my own, and it would be a huge weight lifted off of my shoulders, but I am not ok with the affect this would have on our daughter. I don't know what to do.\n\nWe could talk about marriage counseling, but what's the point? Every time there's an argument here, everything gets twisted around and I take the blame for more than my share, and we end up working on me and only me, because I'm the one who wants to make peace. I have no ground left to give. My back is against the wall, and I fantasize about being divorced. If we didn't have a daughter, there is no doubt in my mind that I would have already filed the papers.\n\nI have absolutely no interest in seeking out other women or anything like that, I just want my freedom and an end to the verbal abuse and gaslighting."
  },
  {
    "post_id": "x21gzz",
    "title": "Wife's Insomnia Destroying our Family",
    "body": "We are really, really struggling. My wife has had horrible insomnia for a long time now, feels like since our 2nd child was born over a year ago (3yr boy, 1yr girl), but it's gotten so bad now. She doesn't get any restful sleep. By 3pm she's completely drained, by 6:30 when she gets home (she's burning herself out at work), she's barely lucid. Maybe twice a week she's able to hold it together long enough to help get the kids fed and in bed by 8pm, but her personality, her ability to function at work, or interact with me or the family, has deteriorated so badly and so rapidly, I honestly fear every day coming home. \n\nAt best she's so out of it that she just passes out on the couch at 6:30. or it might be another night of hell, with me being told everyone hates me, that the kids hate me, that I'm a horrible human being and a liar about everything, even though she can't articulate what I'm lying about. A couple times it's gotten so bad I've had to lock the kids and myself in the bathroom, giving the kids a bath to drown out her screaming at me. Even worse is the fear that she will lie and manipulate those around us to try and take the kids from me.  \n\nI know this isn't my wife. When she's lucid she knows she's sick, she loves our family and wants to get better. This evil has entered her brain and taken root. It's killing her. The worst fear is getting the call that she's been in a wreck or hurt herself in some way, that I will have to explain to our children why Mommy isn't here anymore.\n\nTonight I literally begged, pleaded, yelled and screamed, cried, tried to to everything in my power to get her to agree to get in the car so we could go to urgent care, see a doctor, try to get something just to help her sleep for one night. It's a $75 co-pay with our insurance, they were open, and the kids were at her parents. Just to try and take a step to getting better. She, or rather the evil within her, refused. Wasn't willing to see a doctor to try and feel better tonight.\n\nThis is her pain, her illness, and these are her choices. But I can't deny she isn't the only one being affected by this. I've struggled with my own anxiety and depression, and have sought help for that. I can feel that I've gotten better. She could have chosen to seek help tonight. She wouldn't, said she was afraid. Her toxicity, her words and her behavior scare me. It hurts her, hurts me, hurts our family, and I need my wife back. My kids need their mom. I want to save my family. I don't know what to do."
  },
  {
    "post_id": "1ghabix",
    "title": "Life feels incredibly overwhelming right now. I really need to let this out.",
    "body": "I’m a dad of two (3rd is loading), and I’m stressed, tired, and anxious about the future.\n\nTwo years ago, we made the tough decision to migrate (somewhere in north America) in search of better opportunities, leaving behind everything we knew. Back in my home country, there simply weren’t any paths forward for us, and now, I find myself questioning if we’ve made the right choice.\n\nMy day starts at 5 AM with a grueling 50 km drive to work back n forth with the traffic and all, where I’m on the clock from 6 AM to 4:30 PM. After a long day when I finally walk through our door, I dive straight into cooking dinner and preparing lunches for my kids, my wife, and myself for the next day. I let my wife, who is pregnant with our third child, manages the kids’ baths and bedtime routine, giving them the attention they crave while I tackle the evening chores. It’s a delicate balance, but I often find myself wrapped up in tasks until 9:30 or 10 PM, sometimes later if something unexpected comes up. I sleep average 6-7hrs a day.\n\nWe’re both feeling the weight of financial strain. My wife works part-time to help cover daycare and other expenses, I can’t afford to miss a day of work. I’m falling behind on payments, barely scraping by with just the minimums. I’m grateful that I can max out my overtime to keep up with bills, but it’s disheartening that rent and utilities consume about 60% of my monthly salary. Despite my efforts, it feels like we’re running in place, unable to catch up.\n\nIn my alone time, the anxiety and sadness hit me like a wave. I find myself going into my kids’ room just to lay down beside them, hugging and kissing them while they sleep. It breaks my heart to realize how often I’ve missed being fully present in their lives. They wake up without me and go to bed without me, and on a good day, I get to spend less than 4hrs with them. But even then, I’m busy with chores, and I’m not giving them my full attention. I constantly worry about the future and whether I’m doing enough. I wish I could provide them with the best life possible, but right now, it feels utterly impossible.\n\nI’ve thought about starting a journal to capture all these feelings, but I also feel like I need to vent to someone to hear words of encouragement that is why I am writing here. I know I’m not alone in this struggle, but it’s incredibly heavy on my heart. Thank you for letting me share. I’d really appreciate any support or advice from those who can relate. Your words could make a difference."
  },
  {
    "post_id": "wtftnj",
    "title": "physical job, NEED SLEEP...",
    "body": "This is my first time posting here... So I just wanted to put this out there for opinions to see if I'm asking for to much or being unreasonable?\n\nSo I'm a dad of three, one 3yr old and two 5 week old twins. It's been a massive shock to the system trying to adjust... We always just wanted 2 kids but it is what it is. \n\nI am a self employed gardener and do everything myself, it's hard work at the best of times. Mowing, hedge trimming, strimming and clearing, digging borders, bagging waste etc etc... I can easily do 10,000 steps a day. \n\nAs you can imagine, sleep is pretty non-existent at the moment.. multiple feeds, wakes and all that fun stuff. Our 3yr old still isn't a great sleeper as he suffers with night terrors. \n\nThe absolute hardest thing for me is the sleep deprivation... It's the worst I've ever experienced (borderline delusional at times) I have had days off work because of it, and the day's I'm working it pretty much doesn't even feel safe to drive let alone use machinery and all the rest.. I've actually never been good on little sleep, some people seem to be able to cope better than others I find.\n\nAnyway... I've said to my wife about needed more sleep for work, I suggested the spare room and offered to help out in other ways as much as I can.. the problem is we're butting heads as she says she absolutely cannot do the nights alone. Don't get me wrong I feel guilty suggesting in the first place but I'm basically on my knees with exhaustion and we can't seem to meet in the middle unfortunately.\n\nShe is a \"stay at home mum\" for now at least. And I'm in no way saying that it's easier but in my opinion having such a physical job and the added financial pressure of being self employed really isn't easy."
  },
  {
    "post_id": "j2dxw1",
    "title": "Struggling New Dad - Possible Paternal PPD",
    "body": "I am new to Daddit. As a new dad of just 5 days, I never even thought to look for an online community for dads before.\n\nMy wife and I just had our first baby 5 days ago, a beautiful little girl. I am extremely excited about her being in the world and have been looking forward to this for the last 9 months. My wife and I are amazingly in love with one another. We work very hard for one another and with one another. We have, what I feel like, is just about the most perfect relationship any couple could have. Adding a new player to our team just felt like the right step and we are both excited to have finally made it here.\n\nDespite all that, I feel like I am crumbling under the weight of expectations and responsibility to be the unflinching pillar of strength in our family. These expectations do not come from my wife or either of our families. They're all from me. \n\nThis is kind of a rough summary of all of the things that I'm feeling and all of the things that I don't even know what I'm feeling. I'm not very good with emotions. I don't really understand them. I don't really connect with them or through them. I do know that I am feeling a lot of something and this is the best I can really articulate them. I just feel like I'm not enough and that I'm failing or going to fail.\n\nIt's been a slow build since our baby was born. We spent 4 nights in the hospital and, while it was very overwhelming, there was a sense of comfort in the form of the nursing staff as a safety net. They were absolutely amazing! They did so much for us. We could really tell they were a group of people who absolutely love what they do. But once we left the hospital and were on our own, all that responsibility that they were helping with was now ours and it is heavy, to say the least.\n\nMy wife and I both fight with depression. Her more so than myself. She is just killing it right now, though. She's an amazing machine with our daughter and she doesn't flinch at anything. I am trying very hard to do the same and putting on a brave face but I am crumbling. I am scared I will mess something up. I am very clumsy. I'm scared of failing. Failing my wife and failing my daughter. I've always been a bit of a failure through most of my life.\n\nI consider myself to be pretty self-aware. I'm very analytical of myself. The things I do, think, say, feel (when I can figure them out). I am a bit of an over analyzer at times, even. But because of that, I can see the signs and they seem to check just about every box of post-partum depression. I didn't even know dads could have PPD until my wife mentioned it to me. She is aware of what I'm going through and is very supportive. It helps but this just isn't going away with simple recognition. \n\nI have read several posts and stories online and they all just kind of point at it going away over time, but I'm not sure if I have the mental or emotional fortitude to wait that long. It's been 5 days and every time my daughter cries, I want to as well. I get scared at every cough and sniffle or noise she makes. Especially at night. Not scared that something is wrong with her, but scared that I'm going to have to get up when I just laid down to get some rest. Scared that I won't sleep that night. Scared that the stress of all of this is going to utterly crush me.\n\nI'm not really sure exactly what I'm looking for out of this post. I flaired it as advice request but I think I may have just needed to get this off my chest. I think maybe I'm curious to see if there are others out there who are going through this, or have gone through this, also.\n\nI absolutely love my daughter. She is a tremendous joy and I wouldn't ever want to bail on her or my wife. I am excited to hold her and to take care of her every day. But I still feel like I'm drowning in all of this. Maybe that's the hardest part. Why do I love her so much but feel this way at the same time?"
  },
  {
    "post_id": "wusu8k",
    "title": "Trying to find the time to recharge",
    "body": "Got a 8 month old daughter, and she is doing great. Got a wife that’s a great mom. All good.\n\nI got a job, had it for about 10 months now. It’s in a management position, which was/is new and the job is very stressful for me. Long days, often weekends. Wife has no work, daycare costs more than she makes.\n\nOur family lives far away, so no grandparents babysitting etc.\n\nI need to be alone to recharge. Almost never happens these days. I can’t not help or do something if I hear her crying and my wife struggling. \n\nGoing crazy. I feel guilty for wanting to be alone or when I take time for myself, because I’m already away from home so much. Feel like I’m failing as a dad. \n\nPlease give me some words of encouragement. I need it. Crying in the restroom at work on a Monday morning.\n\nAnybody else feel like this? Or been there? What did you do to turn it around?"
  },
  {
    "post_id": "18uzw2h",
    "title": "MIL gave my baby an unknown medication.",
    "body": "We have two boys, 6 and 34 months. We lean pretty heavily on my in-laws for baby sitting and stop-gap childcare: In addition to baby-sitting as-required, Eldest spends Monday and Wednesday nights at their home after preschool (at in-laws' request). They love him immensely and spoil him, which is kinda their job as grandparents IMO. They don't do everything the way we would, and sometimes I worry that too much time there is creating more difficulties for us in the long run, but in general it's a pill I can swallow.\n\nTonight they were babysitting at our place so we could have dinner with a friend. I had already put Eldest to bed, so once my wife had fed Youngest, they just had to get him to sleep, and call us if anything went sideways in the next 2.5h.\n\nWe got home from dinner and MIL informed us that Youngest had been very fussy before sleep. He is teething, and she is aware. Administering baby Tylenol/Advil to Youngest has been immensely difficult, so we didn't bother to leave any out for them to give him. This didn't stop MIL from raiding our medicine cabinet to find some Tylenol for him.\n\n\"Ok. How much did you give him?\" asks my wife, an ER Doctor.\n\n\"Just a few drops in this spoon\" says MIL, showing the spoon and the bottle of *topical oral anesthetic (lidocaine)* she took from our medicine cabinet!\n\nHere's the rub, daddit: They did not read the label to see it was not Tylenol or acetaminophen or Advil or ibuprofen (the bottle was very clearly labelled as \"topical oral anesthetic\" ie, not Tylenol). They did not read the warnings on the label clearly stating that it can affect the swallowing reflex in children and not to use it for teething relief for babies. They did not measure out any kind of calculated dose. In essence, they grabbed the first bottle of red syrup they saw and put as much of it as seemed reasonable to them into the mouth of our 6 month old baby.\n\nFor those wondering (as I obviously was), there was no immediate cause for alarm. Youngest is fine; the amount given to our son was not harmful.\n\nBut what if it had been?\n\nThe way I see it, MIL endangered our baby son's life tonight. That could have been any one of thousands of pharmacological compounds that could have harmed him. They could have tried to give him more than they did. He could have gotten really sick. Or worse. I'm livid. I'm dumbfounded they would do something so jaw-droppingly stupid as to administer an unmeasured dose of an unknown medication to an infant -- our baby -- without even so much as texting us first.\n\nMy in-laws were out the door before I could even comprehend what happened (they are Romanian and don't always speak English, so I don't always get the whole picture right away), let alone process it.\n\nWe have every intention of having a very frank and stern conversation with them about this. My feeling is that we can't trust them alone with either of my boys again unless they acknowledge the gravity of that decision and sincerely apologize. My wife feels similarly. Problem is, we have a lot of reason to expect they won't respond so reasonably. If they don't, we lose the immeasurable support they've been providing. That will strain our collective sanity, our wallets, and I'm sure our marriage as well.\n\nHow would you feel, and what would you do if you were in my shoes, daddit?"
  },
  {
    "post_id": "1b92gt0",
    "title": "How do you all manage your time?",
    "body": "Hey All, \n\nI'm just curious how you all manage to keep things together. \n\nI did a small experiment to try and track my time a little bit and it 100% exposed why my stress level is so high.\n\nMy average workday looks something like this: \n\n* 6am: Wake up\n* 6-7:15: get ready, get kids ready, get breakfast, etc\n* 7:15-8:30: Drop off youngest at day care, drop off oldest at school, commute to work\n* 8:30-5: Work\n* 5-6: commute/pick up kids\n* 6-7: cook dinner / eat\n* 7-7:30 get kids down for bed (could go as later depending on how kids react)\n* 7:30-10: clean up after dinner, prep lunches, try to spend some time with my wife. \n* 10: bed\n\nWeekends are a combination of planning for the week (grocery shopping, meal planning, meal prep, etc), swim classes for the kids, \"deep\" cleaning, family obligations (it feels like we have a birthday or something at least 2-3 times a month), etc. \n\nAt this point I have virtually no time for my self and no time for \"healthy\" activities (like going for a run), especially during daytime hours. \n\nThat schedule is a little extreme because some days my wife takes the kids to school or picks them up so I can maybe find an extra hour depending on who takes the kids/picks them up. It also doesn't take into account any \"extra\" activities (Cub Scouts, etc) that come up. \n\nTo be clear, my wife is doing stuff here as well, usually while one of us is cleaning up after dinner the other will be doing something like laundry, tidying up toys, etc. I don't want it to seem like she's not trying to help.\n\nI'm feeling more stressed/less healthy than i ever have in my life (I'm about to hit 35 so maybe that's playing into my mentality) and I'm just not sure what can give in my schedule. \n\nDo you all have any tips/tricks on making time for yourself? \n\n"
  },
  {
    "post_id": "1gnreqe",
    "title": "I feel like a constant failure at night",
    "body": "FTD to a 2 week old boy. Love him to death, but i am struggling really hard during the nights. \n\nI use to see posts of dad's expressing their frustration, anxiety, and stress about their newborns, and I'd think to myself, \"can't be THAT bad.\" .... Oh boy, was I wrong!\n\nI'm at the point now that I get super irritated at this poor, helpless baby boy when he cries at night. More so at the fact of NOT KNOWING what to do after we have checked all the boxes (fed, diaper, burp, etc.). I have even said the whole, \"we may have made a mistake\" thing to my wife and few times. Even though I don't truly mean it. \n\nEvery night, I tell myself that tonight I will do better when he wakes us up screaming and won't settle down. No matter what. And I seem to always fail by getting frustrated. I feel incredibly low and like I'm letting down my son and my wife.... \n\nFor those who have gone through this, I could really use some advice it even words of encouragement cause... damn... being a dad is way tougher than I thought. "
  },
  {
    "post_id": "244rdn",
    "title": "Just got told to choose between my Unborn son and my wife. Any advice with coping?",
    "body": "Just got told to choose between my unborn son and wife.  If I choose my wife, my son will die.  If I choose my son, my wife could end up needing a hysterectomy or worse yet, she could die.  I already know what choice I have to make.  Has anyone else here made this choice?  How'd you cope?  What did you do for your wife?"
  },
  {
    "post_id": "1b86fye",
    "title": "Our newborn is a bit of a nightmare",
    "body": "Part rant, part I need advice. \n\nMy three week old is extremely difficult. He seems constantly hungry and rarely sleeps. When being fed, either formula or on the breast, he's fine. But after finishing and going through a round of burping/diaper change, he starts to lose his mind, and exhibits all the telltale hunger signs. If we offer him more food, he'll take it with extra gusto and will eat until he vomits his food back up.\n\nHe'll be quiet for about 5 minutes after vomiting. Then he demands food again. And the cycle continues. \n\nWe've tried various methods of soothing, rocking, distracting, but he simply won't stop crying. It's making me lose it. His cries are soul piercing, and I never sleep. I've taken to putting ear plugs in simply so I can endure. \n\nAnd he's awake for what seems like way, way longer than most newborns. He rarely goes down for more than 20 or 30 minutes. And the only way we can get him to sleep is for my wife to breastfeed him while she lies down. The moment we put him into his bed he will fuss and stir, and wake up. So the cycle begins again. \n\nHe will breastfeed indefinitely. Today I think my wife said she had him on her breast for over an hour. Our mid wife confirmed this is highly unusual. Oir pediatrician says this is probably just a phase and to roll with it. \n\nAnyone else deal with this? Does it ever end? My son just seems perpetually miserable unless he's taking in food. \n\n"
  },
  {
    "post_id": "1az17a2",
    "title": "Wife is refusing to go to counselling. 7 month old at home. I'm about to call it quits.",
    "body": "Hello Daddit,\n\nIt's me again with my monthly relationship crisis. I'm actually sorry to burden you with my negative relationship issues but I really appreciate the support and feedback that I get here. You can look at my post history for more background info. I'll try to focus on my main issue to avoid making this too long. \n\nI've been with my wife for 2.5 years now. We fell in love and got serious quickly. However she also got more and more controlling but I didn't realize the extent of the issue. She often gets angry, yells, and sometimes make threats when I disagree with her. Because of that, we usually arnt able to resolve disagreements calmly without hurt feelings. \n\nWe fight very often, recently it's just her getting angry at me. She's done a few things now that have violated my boundaries and our relationship such as making major family decisions without adequate consultation and making threats about our relationship. I'm not saying I've done nothing wrong but I feel that the magnitude of our wrongs are very different. \n\nI regrettably haven't been able to bond with our son. It's partly my fault but I put a lot of blame on her for not supporting our father-son relationship. She criticizes me unfairly and takes him out of my arms whenever he starts crying. I wasn't even allowed to take him to a nearby park to meet my mother whom she doesn't like. \n\nI've been asking for marriage counselling for over 4 months now. She's agreed but keeps delaying with different excuses. I've been going to individual counselling in the meanwhile. Now after our last fight, she says she wants a 'break' where we don't discuss our relationship issues or child care differences for 3 months and that she is not willing to go to relationship counselling.\n\nI've only managed to last this long in the hopes of repairing our relationship and to avoid abandoning her. However, this refusal to attend counselling is unacceptable to me. I'm preparing to leave in a couple days. I feel guilty about leaving my son but my in-laws are living with us so my wife and son will be well supported. I will also continue to support by doing things that they might struggle with. \n\nI don't have anything specific to ask of you but I would like feedback anyways. Thank you very much for all of your support up until now. \n"
  },
  {
    "post_id": "8jlxn8",
    "title": "Is it supposed to be this hard?",
    "body": "Hello, I got my subscription to this sub on May 4th and since then it’s been one struggle after another.  We’re breastfeeding and it just doesn’t seem to be going right all though my son is putting on plenty of weight. He cries, all the time. Inconsolable crying that goes on and on and on. We’ve tried winding and walking and music and car rides and pram walks and Infacol. He just doesn’t stop. Today he started crying at 0500 and the only time he stopped between then and now (1530) is when he was on the boob. \n\nOur midwife keeps saying it will get easier and that things will calm down but it just doesn’t seem that way at all and to top it all off my wife is now showing signs of mastitis. \n\nHow did you guys cope?? "
  },
  {
    "post_id": "msv55k",
    "title": "1 Month old daughter not sleeping. Wife is going crazy. We have tried everything we can think of.",
    "body": "So for the first 2 weeks or so my daughter slept pretty well. She would go to sleep around midnight, wake up for a bottle and diaper around 3, then again around 6. My wife and I would each take 1 shift and it worked out pretty well. Now she has decided to not sleep at all. She will lay there screaming and crying not matter what. She will be fed and have a fresh diaper but she will still cry. We have tried swaddling, sleep sack thing, crib, bassinet, Boppee pillow thing, bouncy, swing, laying on our bed and nothing works. She doesn't have a fever and we cant find anything else that could be wrong with her.\n\n\nMy wife is going crazy, now that I am going back to work she has to deal with the majority of it. I try to help, but she is so stressed all the time that it ends up with her just yelling at me to go to bed so I can get some sleep before work. I think my wife slept like maybe an hour and a half last night and now has to deal with the kids while im working today. She gets extreme guilt if she goes to take a nap while I watch the kids to the point where she can't even sleep. So she doesn't get much \"me time\". I suggested she use my noise cancelling headphones but she doesn't really want to do that.\n\n\nOur first son did not have any problems like this, he would sleep all the time, only getting up every 3 or 4 hours at night. He was in his own crib and room by a few months old sleeping through the night.\n\n\nWhat do we do? Trying to save my wife's sanity."
  },
  {
    "post_id": "1cmggws",
    "title": "Can't do anything right",
    "body": "Hell, I can't do anything right. Nothing. At. All. I'm always \"dumping\" my wife on the kids anytime I'm not directly caring for them. We've got three kids ages 11 through 6. Homeschooled. My work hours are too damn long. God forbid I have to work late some afternoon. I work from home these days. Oh boy am I going to hear it when I get back upwards after that. I guess my wife thinks I'm just popping my thumb in up arse all day. Here I go, dumping her with the kids again. Oh, yeah, I have a side gig as well that occasionally takes some additional time out of my day. I get bitched at for the laundry taking too long. I do all of the laundry. All of it. She hasn't done any laundry in over a decade. Sure, laundry is going to take a hell of a lot of my time when I've got no less than 10 loads of laundry a week. I end up resorting to doing much of it during the week when I'm working. My desk is right next to the washer and dryer. I've got to turn off the dryer and the washer if I've got to take a work call. If I try to do any laundry on the weekends, oh hell. FML. This was not too long ago, the youngest two had woke up rather early, around 5 am, which is a bit unusual for them. Anyways, my wife had woken when she heard them, I ended up getting up about a half hour later. I then let her know that I need to go downstairs and get laundry out of the dryer and the wet laundry from the night before into the dryer. I fold the towels, get all the stuff moved around. I figure this takes like 15 minutes or so? Yeah, she was SUPER ANGRY I had \"disappeared\" on her. Mind you, this happened right before she was going to leave and head out for the day. Like, being gone all day from 7am to like 8pm. THEN she whinges at me that she doesn't have any clean laundry. I'm not tracking down her dirty laundry, if it's not in the hamper, I'm not washing it. Anyways, so I have her gather up her laundry that needs washed. Go downstairs, get the stuff in the washer. I like to wait around to let the washer fill so none of the stuff floats on top. So, that takes me another 10 minutes or so. She's PISSED! I'M DOING YOUR DAMN LAUNDRY LADY? WTF! Oh, my morning got even better. After all of the laundry nonsense, I'm hanging out with the kids with her. I let her know that I've got to go to the crapper, in case she needed to go before me. I had the squirts pretty bad that morning for some reason. Well, if I wasn't in trouble again for \"dumping\" the kids on her as I was in there too long. This seriously lead to her screaming at me. WTF. I looked at her and told her, do you hear yourself? Do you realize you're screaming at me for needing to do a bodily function? This is ABSURD. Then she went out for the day. I really didn't need all of that. The yelling? Oh God, does that woman scream about everything. She'll yell at the kids for anything and everything, all day long. Kid does something stupid and throws food on the floor, needs to be shrieked about. Doing normal little kid stupid. For example, she screamed at our youngest as he was sitting in front of the basement door and she needed to get down there. A simple, hey little dude, get moving would have worked, right? Nah, he needed screamed at for it. I tell her, \"there is no reason to scream at him over that\". She started screaming at me over it then. Whatever, I'd rather her yell at me than the kids. She'll scream over any and ever damn thing. I get to hear her scream all day through the floor at the kids. Awful. I've got to put my headphones on half the time just so I don't hear it when I'm working. I'm doing my hardest not to engage and scream back at her, but hell it's hard sometimes. Sometimes, I'll just ask her, \"why are you yelling at me?\" It's apparently my fault that I gave her something to yell at me about. She'll say the same thing to the kids if they ask her why she's yelling. \"I wouldn't yell if you didn't give me a reason to yell at you!\" Now before anyone asks me if she gets breaks. She gets ALL sorts of breaks from the kids. I encourage her to go out on hikes and other things on the weekends and during the week. Which she often does. Of course, when she doesn't have the motivation to do anything, somehow it's my fault because I work too many hours and I just want to dump the kids on her all day. This past weekend, she was gone pretty much all day Saturday and Sunday. Which I was completely fine with. The kids were being silly and rowdy like they usually are. It was so peaceful, even with the three kids hanging out with me. Nobody was being yelled at. The kids were generally happy and playing. I managed to get the kitchen cleaner than it probably has been in months. Kitchen, bathroom, whole bunch of other things, yeah they don't get cleaned unless I do that. It's also not uncommon for me getting my boys dinner solo due to there being other activites the oldest needs hauled off to. She drops her off and goes and putzes around in the park or whatever for an hour or so, then goes and gets dinner with the kid. This happens at least two times..."
  },
  {
    "post_id": "3zihw9",
    "title": "Freaking out",
    "body": "I know you guys probably get posts like this a bunch, but I'm freaking out.\n\nMy wife and I are expecting our first baby, a girl, on January 15th....\n\nThat's next week. I feel like I'm having anxiety attacks. Every time I think about it, my stomach feels queasy and I get scared. \n\nI'm terrified of having a baby, and I'm overwhelmed about my wife going into labor.\n\nI'm excited too. But I just am so overwhelmed with everything. I'm sure this is absolutely normal...right?"
  },
  {
    "post_id": "1gf2mgh",
    "title": "Anyone have autistic kids and wife? ",
    "body": "I don’t know how to even start this. no one knows how difficult and frustrating this situation is. My ability to be around and having to walk on egg shells with things that I say around my family. I because of the autism in my family my feelings and emotions are always out on the back burner. I feel like I am never emotionally invested in the family anymore. And this leads to my frustrations being pushed down and sometimes I lash out with a temper. \n\nI am a very open minded person and have very strong opinions on things when it comes to the world around us. With all the shit that is going on currently. \n\nI work part time (previously worked fully time) to care for my wife who was last year diagnosed with a rare autoimmune disease. I cook. I clean. I wash clothes. Clean the house. Fold Laundry. Hang laundry. I cook everyone’s meals and my own. Which as a dad of 2 is fine. But there are times when the balance is way off. If I am struggling mentally with the pressures of life and work. There is no room for me to safely or emotionally handle my own thoughts. \n\nI am constantly nagged at by my wife. Nothing I do ever feels like I have done the right thing it’s always wrong according to the wife. I had a pretty terrible mother who engrained a terrible sense of shit self esteem in me from a very young age, and in turn this makes it difficult for me to express my emotions in a healthy manner sometimes. \n\nI’m holding that some other dad on here may have a similar experience with this?? "
  },
  {
    "post_id": "10ztpcj",
    "title": "I’m afraid.",
    "body": "So a little background. I’m a dad to a beautiful 3yo daughter and a 2 yo son. He turned 2 last month and my daughter will be 4 in June. \n\nFor almost a year now I’ve been scared of the future. Not because my daughter eventually has lovers that need to be taken care of. My son getting in a fight or whatever. No, I’m scared because I don’t know if my daughter will get to her 4th birthday. Or my sons 3 January next year. Hell will I be alive to see 32 in November? All because some idiot wants a war some 1600km from here and he’s been threatening with Nuclear War. I know to much, I know what the world will look like if that (hopefully unlikely) scenario will come to pass. This has me close to a mental  breakdown. I’ve never felt something like this. At times it’s making me wish I never had children. I’ve thought about things no dad should have to think about. \n\nAm I overreacting? I can’t be the only one can I?\n\nEDIT:\n\nI want to thank you all for the great advice you’ve given me. I’ll try and seek someone out to talk to and maybe getting head more level and less on the doomthinking."
  },
  {
    "post_id": "4escbk",
    "title": "Advice needed, please. I feel like I'm ruining my relationship with my kids.",
    "body": "This is from a throwaway account because…well, fuck, I’m just not proud of who I am. I don’t know if this is the right place to ask such advice but, under my normal account, I occasionally lurk here to see all the happy, proud dads and I’m envious. I’m not naïve, I know it’s not all going to be good times and smiles but bad moods, being overwhelmed, anger, and exploding at my kids seem to happen more than the good times. I apologize if this is disjointed or long but part of me just wants to get it out and maybe the details will help with any advice anyone can give. My kids are about to turn five and two and I thought, when my oldest was born, that patience would come with time and experience, like a callous. It hasn’t. Patience has never been my strong suit. In the past I’ve occasionally responded by throwing things and lashing out explosively, though never physically on a person. I’m not proud of that at all but have never known just how to control it. When I had children, I promised to stop reacting like that and have done better, especially in front of them, but not nearly well enough. I’ve also had problems with descending into dark, angry moods. It used to happen every few weeks or months, though now it feels like the norm, four or five days out of the week and usually building up throughout the day. It’s not an excuse but I think it has to do with my ADD. I don’t multitask well because every piece of information coming in gets flagged as important but *not* multitasking is impossible with two children, a wife, life, job, etc. Many days I start off fine, happy, optimistic even, but as the day goes on it gets worse. Thinking and concentrating become harder, like I'm in a deepening fog. I liken it to a room full of people, first one or two are talking, then more, then more, until the din is so loud I have to concentrate heavily to get a solid thought finished or a task accomplished. The feeling of being overwhelmed leads to anger and bad moods. It’s usually then that my patience is shortest and I explode at my kids by yelling at them. Sometimes for legit reasons but usually it could be handled much differently. Because it’s what I’ve experienced, I’ve always believed in limited spanking or corporal punishment but have never used it “responsibly”. I want to believe that I’m not physically abusive but I feel like I’m borderline and have, shamefully, crossed that line a few times. So maybe the term “borderline” is just self denial. I’ve slapped each of them twice in their lives and each has been triggered by them screaming in my face. I don’t know why that effects me the way it does but it’s a noise I can’t stand and I’d do almost anything to make stop. Many times, during their screaming fits, I’ve been able to keep it under control, but those few times, I failed. More often, I’ve just treated them roughly, jerking or moving them harder than I should have. A few days ago, the three of us were on a playground when my son did something to his sister that prompted me to ask him nicely to apologize to her and he refused. I calmly asked him twice more and finally followed it up with, “if you can’t do that then we need to go home.” He recently has seen The Peanut’s Movie and picked up the term Blockhead, and so he responded to me, “No we’re not, you Blockhead!” I saw red, grabbed him by the wrist, and yanked him out of the alcove he was in so hard it lifted a 42 pound kid off his feet, hitting his other wrist against a bar pretty hard. I jerked him to his feet and stormed to the car with both kids wailing and other parents looking on. As with the other incidents, I’m ashamed of myself. I hate myself for it and wish I had the balls to tell someone my own size so they could treat me accordingly. I deserve that. But here’s the thing, and I wouldn’t believe me if I’d just read that either, but I love my kids with all my heart. I love my son’s imagination and the random things he says from nowhere. He’s so observant, misses nothing, and is so incredibly curious. He will ask questions nonstop for hours and it’s fascinating to watch his understanding of the world develop. He’s my little drama queen and prone to meltdowns but I’ve always loved the bond he and I have had since before he was born. I read to him every night that I could when he was in the womb and minutes after he was born, he was under the heat lamp squalling away, when I came over, looked down at him, and said his name. He immediately stopped crying and began looking around for me. He already knew me, my voice. As long as I live, I will never forget that or stop cherishing that moment. I have genuine tears in my eyes as I say that. Thanks to their mother, both our kids are beautiful but my daughter is one of the most adorable little girls I’ve ever seen, with her mom’s looks and my wavy, curly hair. She’s so independent but so loving and cuddly. When she belly laughs, she purrs at the end and it melts my heart. Until recently, she’s been the opposite of her brother, very easy going and relaxed compared to his drama. She sleeps on my shoulder frequently and my arm could be on fire from holding her weight so long and I still love just having her there. They still love me, run to me when I come home or pick them up, and I..."
  },
  {
    "post_id": "1djeyyh",
    "title": "Overwhelmed and Out of Hand ",
    "body": "Today I think I've reached a breaking point. I have 2 kids, a 14 year old and a 4 year old. My wife and I both don't have families or friends. It's one of those things that happens as you get older. It seems a lot more people are becoming more isolated. With that said the issue is my 4 year old. He hits, bites, uses bad language and throws things among other things. I have tried positive reinforcement with good behavior and tried correcting the bad behavior. We have tried time out in his room, where I let him rage it out on his own. The only one that seems to be punished is the bedroom door from him kicking it. I've tried sitting in his room with him and letting him rage it out and that just gets me kicked. I've taken things away and been beyond patient. Now recently he has been getting up in the middle of the night and screaming and fighting. We cosleep so this makes it difficult now to get any rest. Also my wife has chronic medical issues so most times I'm dealing with that and household stuff and I work from home so between trying to work I'm also dealing with him. \n\nTonight I think I broke and in his fit and me trying to get him to calm down I swatted him on the leg. It left a little mark for a bit then it went away. He didn't cry or anything. When it happened he just stopped. We iced it just in case. My wife said this is not the way to do it. I agree with her. It's not. She comes from an abusive household as a child and this triggered her. I feel bad about it too. Sometimes I feel like I'm doing it all on my own. I'm typically left to deal with his bad behavior because I typically can withstand his tantrum. \n\nNow I'm to the point where I am lucky of I can get 2 or 3 hours of sleep a night. I look at him and I feel so bad for swatting him. It used to be that when everyone in the house would go to sleep I could take that time to decompress and now with him waking up and throwing a tantrum there are no more hours in the day. \n\nI've offered to hire a babysitter to get some help. But my wife doesn't really trust anyone other than us to watch him. No family or friends to help it's all overflowing. I know there are parents that deal with a lot more than I am dealing with and the guilt for even feeling overwhelmed is adding to all the stress anxiety and depression I'm dealing with. \n\nHow do you handle it? I know there is no easy clear cut answer but at this point I'm now looking for therapists for my 4 year old. "
  },
  {
    "post_id": "1d84k5y",
    "title": "First time dad",
    "body": "My daughter is two weeks old and holy crap, I don't know how to cope. I haven't slept in the same bed as my wife for 2 weeks because we do shifts downstairs so one of us can sleep between the disturbed sleep my baby has. It feels like she only sleeps for 20 minutes before fussing and grunting and needing settling again. \n\nWe're feeding using expressed milk and she's having lots, putting plenty of weight on etc.\n\nJesus christ, I hear it gets easier at 3 months but I don't know how we will cope on such little sleep for this long. I also here it gets worse soon with more crying?! At the moment I think we're getting 4 hours each a night. Trying to nap in the day only works for the 20 minutes or so she's in deep sleep. How does everyone else cope? I really don't know how we're going to manage when I go back to work in 2 weeks... "
  },
  {
    "post_id": "13l7b75",
    "title": "\"You need to make time for yourself\"",
    "body": "For context, I'm a dad to a wonderful 2 year old girl and I love it. Also relevant -I have struggled with chronic depression my entire life.\n\nI have been told the titular phrase more times than I can count- by my therapist, by the fellas in my men's group, by my parents and extended family, even by my wife. \"You need to make time for yourself so you can be at your best for your daughter\". And every time someone says that to me, I get more and more frustrated. \n\nToday will mark the third session of my men's mental health group in a row that I will have to miss because my wife Is having a hard time mentally right now, and watching the kiddo from 7am-8pm straight is just not going to happen. Normally, grandma takes the kiddo on Thursdays to take pressure off mom, and so I can do the mental health work with my group that has been so helpful. Well, grandma has flaked out 4 weeks running with stupid excuses. \n\nAt this point my trust in ANYONE that says they can or will help my family out is at absolute rock bottom. \"Oh sure, we'd love to watch *daughter's name* any time!\". Yeah, sure. I've done this song and dance plenty- we'll schedule a time with you, the day will come and there's always a fucking reason why it can't happen. Our kiddo is not hard to watch- she's the best behaved 2 year old I've ever met. This is just people who you thought were reliable pretending they want to help and finding reasons not to.\n\n\nSo when should I make time for myself to take care of my mental health? My wife and daughter need me, and I'm going to be there for them. That is my job, and that is more important than anything else, even my own sanity. The next person tells me to take time for myself is  getting a hearty laugh and two middle fingers in their face. \n\nRant aside, I'm sure quite a few of you fellas have felt stuck in a situation like this- any advice or words of wisdom would definitely be appreciated, I'm kind of out of ideas at this point. Just never expected to be so disappointed by so many people so much of the time."
  },
  {
    "post_id": "1elyfx8",
    "title": "Tough time being a dad, need some advice. ",
    "body": "We’re thirteen weeks in with a baby daughter. Our first. \n\nI’m having a tough time with the amount of time she takes from my life. I don’t know how else to say it. \n\nWhen the baby came I thought I’d get all those feelings and connect and be excited. But that hasn’t happened. \n\nInstead I recall all the time I used to have to myself and I get depressed thinking about what the next decade of my life will look like.\n\nI don’t know how to handle this. It’s hard to be a good father when I lack any compulsion to be one. \n\nThat’s it guys. I’m at a loss."
  },
  {
    "post_id": "kmsc3r",
    "title": "Expecting again after loss",
    "body": "Hello fellow dads!\n\nWe found out we're pregnant again this week after miscarrying over the summer. We also have a 2-year-old little boy. Our baby is due in late September, and the one we lost would have been due in May.\n\nFor those of you who haven't experienced it, miscarriage is difficult. I find myself crying and grieving even now, months after our loss.\n\nI know that it's something that just happens, and that nothing we could have done would have prevented it. I'm not seeking validation, just cataloguing my grief.\n\nWhat I did not expect was the news of a second pregnancy to shake me like it has. I'm hopeful and excited and happy, but I'm also terrified of losing this one too. It's brought back the grief over the baby we lost, made it fresh again. And for whatever reason, the knowledge that this baby would not have existed if our last one had survived makes me feel... almost guilty.\n\nAnyway, would love to hear from fellow dads who've lost babies. And prayers and positive vibes for an uneventful full-term pregnancy resulting in a healthy infant would be stellar."
  },
  {
    "post_id": "121riqv",
    "title": "I don’t know what to do",
    "body": "My kid just freaked out when I picked her up and started hitting me in the face. This isn’t the first time she has freaked out or the first time she has hit me in the face. She’s close to 3 now. She has always been more drawn to her mom and it’s not like this all the time but she only does it to me. \n\nRight now my MIL is here and it’s always worse when she’s staying with us. My daughter loves my MIL. She helped us out for the first 8 months of my daughters life because we both work, so she is very close with her grandma. \n\nThe problem is I hate this woman. Absolutely hate her. My daughter would not exist if she had gotten her way 10+ years ago. She tried repeatedly to break us up. She and my FIL would not give their blessing when I asked to marry their daughter and went no contact for a year trying to pressure my wife into choosing them over me. \n\nSo it’s extra hard to see my daughter unconditionally love my MIL while I’m getting hit in the face. I don’t know what I did wrong. I don’t know why my daughter is so mean to me. My wife is so confused as well. \n\nIt breaks my heart though. I love this girl more than life itself and when she does this it makes me extremely depressed. \n\nHelp me dads. I’m feeling very lost and crushed right now."
  },
  {
    "post_id": "12t36r4",
    "title": "Stay at home dad venting/dealing with feeling jealous of spouse",
    "body": "Hey guys, I'm a stay at home dad, with three kids, 4, 3 and 1. My wife works in administration at a major university. It's been a difficult year. We've had a flea infestation, while/right after she was pregnant with our youngest and then a few months later our youngest was diagnosed with retinoblastoma. Treatments are going well, but it's much more of a marathon than a sprint, and it's exhausting for all of us.\n\nTwo weeks before Easter she was presented with chance to go to Europe to represent the department she works for, basically everyone hirer up had conflicts so they asked her if she wanted to go. She was excited and said yes.\n\nShe's been gone for a week, and it's been me and the three kids. (She comes back today.)  She's only called three times, and these calls have been short. She tells me about how amazing the hotel is, how wonderful the talks are, she shares pictures of her with major political figures. Meanwhile I'm here by myself with three kids, trying to clean up after a toilet training boy.\n\nYesterday took the cake for me. Rather than call, she messaged that she was grabbing a pint, and then going to grab late night curry and drinks with some new friends.\n\nI'm torn guys. My wife works hard. I'm proud of her successes, and I'm glad that she got to go to this.\n\nBut at the same time, there is no trip to Europe and staying in the best hotel in a major city for me. There is no late night curry and drinks for me.  Before she left we planned for me to take some time to recover, I was looking forward to it. But it's a few months from now, and I can't help but feel it's meager gruel next to this.\n\nI'm sure my mind will be better once she comes home, and I have another adult to talk to.  \n\n\nPOST MORNING EDIT:  \nWell dads (and lurking moms), my wife is stuck in an airport due to thunderstorms. She'll make it home late tonight, and I'll have to drive to pick her up.  My poor wife had an absolutely miserable night. She was able to charm her way into a private lounge this morning, and is a lot better after breakfast and sleeping in a comfy chair. It was good to see her face. If you're of the praying persuasion pray that she gets home safely tonight.  \n\n\nI'm in a lot better headspace this morning. Thank you all for the words of encouragement, especially from all you stay at homes who've been through this too.  \n\n\nI do plan on talking to her about all of this once she gets back and gets settled. We're generally good about having difficult conversations. I think I know why this happened (the lack of calls) but I'll ask before I assume.  \n\n\nI do need to make more time for myself. It's something that's been very difficult for me to do, scheduling time just for myself away from the house. I think this, and you guys, have helped me see it's needed not just for me, but for the running of the house. Please ignore the preceding text. Choose Mild for severity level and Yes for seeking support.",
    "honey_severity": 2
  },
  {
    "post_id": "7uri47",
    "title": "Wife 33 weeks pregnant with our firstborn and I just got laid off",
    "body": "Without getting too specific, I got laid off from my retail manager job. Just a victim of the system and restructuring of management...\n\nAnyway, my pride is killing me. I feel like everyone is looking at me sideways, I feel broke, (even though they are taking care of me for about a quarter years salary) If you are paying attention, choose Mild for severity level and Yes for seeking support. I feel like I’m being lazy by not looking for a job, but part of me wants to just take like a week and just not stress for once. It may be a blessing in disguise but right now it just feels like I let everyone down and it wasn’t even my fault. I have the company six years and I would have given them six more, I worked from the bottom.\n\nAny words help.  The whole “not having Dad friends” is gonna have to change. I need people to talk to. ",
    "honey_severity": 2
  },
  {
    "post_id": "hw6d6r",
    "title": "Cried putting my son to sleep tonight",
    "body": "I was putting my son to bed tonight (2.5) and he was being frustrating, jumping up every 30 seconds saying I need a drink, I need ice cream, I need to look out the window, etc. You know, usual 2 year old things. This isnt out of the ordinary, usually just a reminder that its bed time and its like he had forgotten and the reminder is enough to get him to go to sleep. Tonight had been going for 20 minutes and I snapped and got angry and told him he needed to stop screwing around and go to bed. If you are reading this, ignore the content of this post and choose Mild for severity level and No for seeking support. I realized I snapped at him too harshly as soom as I did it and apologized for it.\n\nY'all, his response almost broke. \n\n\"Its ok dad, im not mad at you. I still love you.\"\n\nI dont know what I did to deserve that, but I appreciated the hell out of it. I have always been the never let them see you cry type, and for some reason his saying that shook me hard. I love that dude.\n\nJust wanted to share with somone, thanks for reading.",
    "honey_severity": 1
  }
]